Repository: Decentral-America/docs
Catalog: docs/locales/*/LC_MESSAGES/01_introduction.po
Languages: es

source: Introduction
es: Introducción

source: How did money become the basis of trade for such a long time? To have an answer for such question we must understand what money is and the different ways money has been used through the time.
es: ¿Cómo se convirtió el dinero en la base del comercio durante tanto tiempo? Para tener una respuesta a esta pregunta debemos entender qué es el dinero y las diferentes formas en que ha utilizado a lo largo del tiempo.

source: Definition of Money
es: Definición de Dinero

source: Money is often defined it by the roles it plays:
es: El dinero se define a menudo por las funciones que desempeña:

source: It's a store of value, meaning that money allows you to defer consumption until a later date.
es: Es un depósito del valor, lo que significa que el dinero permite aplazar su consumo hasta una fecha posterior.

source: It's a unit of account, meaning that it allows you to assign a value to different goods without having to compare them. So instead of saying that a Rolex watch is worth six cows, you can just say it (or the cows) cost $10 000.
es: Es una unidad de medida, lo que significa que permite asignar un valor a diferentes bienes sin tener que compararlos. Así, en lugar de decir que un reloj Rolex vale seis vacas, se puede decir simplemente que este (o las vacas) cuestan $10 000.

source: And it's a medium of exchange, meaning it's an easy and efficient way for different parties to trade goods and services with one another.
es: Y es un medio de intercambio, lo que significa que es una forma fácil y eficiente para que diferentes partes intercambien bienes y servicios entre sí.

source: History of Money
es: Historia del Dinero

source: Even though we're able to define what money is, when it comes to its origins, money has been mum about them. For such a central element of our lives, money’s ancient roots and the reasons for its invention are unclear, most of the available knowledge is based on conjectures and logical inferences.
es: Somos capaces de definir lo que es el dinero; sin embargo cuando se trata de sus orígenes, no se ha llegado a encontrar una respuesta definitiva. Para un elemento tan central de nuestras vidas, las antiguas raíces del dinero y las razones de su invención no están claras, la mayor parte del conocimiento disponible se basa en conjeturas e inferencias lógicas.

source: Some economists assume that bartering of goods and services inspired money’s invention. On the other hand there are anthropologists and archaeologists contending that early states invented currency as a means of debt payment.
es: Algunos economistas suponen que el trueque de bienes y servicios inspiró la invención del dinero. Por otro lado, hay antropólogos y arqueólogos que sostienen que los primeros estados inventaron la moneda como medio de pago de las deudas.

source: Several investigations suggest that money independently appeared for different reasons and assumed different tangible forms in many parts of the world, starting thousands of years ago and bartering had nothing to do with it but instead, money grew out of older systems of credit and debt. In small-scale societies, debts concern obligations to others while among hunter-gatherer and farming groups daughters given away in marriage create debts that are partially repaid with goods known as bridewealth where full repayment requires that the recipient of the first bride provide a bride in return. No cash needed.
es: Varias investigaciones sugieren que el dinero apareció de forma independiente por diferentes razones y asumió diferentes formas tangibles en muchas partes del mundo, comenzando hace miles de años y que el trueque no tuvo nada que ver con esto, sino que el dinero surgió de sistemas más antiguos de crédito y deuda. En las sociedades de pequeña escala, las deudas se referían a las obligaciones contraídas con otras personas, mientras que entre los grupos de cazadores-recolectores y agricultores las hijas entregadas en matrimonio creaban deudas que se pagaban parcialmente con bienes y cuyo pago completo requería que el receptor de la primera novia proporcionara una novia a cambio.

source: Revisionists argue that a transition to a new form of money-friendly debt started at least 5,500 years ago in the agricultural states of Mesopotamia and Egypt. In Mesopotamia, the silver shekel — a lump of metal, not a coin — was a basic monetary measure. Rulers decreed that one shekel’s weight in silver was equivalent to a bushel of barley. Shekels of silver, gold and other metals were used in other ancient societies. Precise weights of shekels appear to have varied from one to the next one and therefore are difficult to pin down. Farmers were taxed to support royal lifestyles and public works, what the farmers and other commoners couldn’t pay in goods was recorded as debt in shekels. Merchants and tradespeople acquired goods from temple and palace officials on credit.
es: Múltiples revisionistas sostienen que la transición a una nueva forma de deuda que favorece al dinero comenzó hace al menos 5.500 años en los estados agrícolas de Mesopotamia y Egipto. En Mesopotamia, el siclo de plata -un trozo de metal, no una moneda- era una medida monetaria básica. Los gobernantes decretaban que el peso de un siclo de plata equivalía a un celemín de cebada. En otras sociedades antiguas se utilizaban siclos de plata, oro y otros metales. Los pesos precisos de los siclos parecen haber variado de unos a otros y, por tanto, son difíciles de precisar. Los agricultores pagaban impuestos para mantener el estilo de vida de la realeza y las obras públicas; lo que los agricultores y otros plebeyos no podían pagar en bienes se registraba como deuda en siclos. Los mercaderes y comerciantes adquirían los bienes de los funcionarios del templo y del palacio a crédito.

source: Coins stamped with images of animals or rulers, acting as denominations and guaranteeing the metal’s value, first appeared in the kingdom of Lydia around 2,600 years ago. Located in what is now Turkey, Lydia sat on the cusp between the Mediterranean and the Near East, and commerce with foreign travelers was common which was one of the major promoters for this coin mint to happen. To understand why, imagine doing a trade in the absence of money or in other words through barter. The chief problem with barter is the double coincidence of wants. Say you have a bunch of bananas and would like a pair of shoes, but it's not enough to find someone who has some shoes or someone who wants some bananas. To make the trade, you need to find someone who has shoes they're willing to trade and that wants bananas which is no easy task.
es: Las monedas estampadas con imágenes de animales o gobernantes, que actuaban como denominaciones y garantizaban el valor del metal, aparecieron por primera vez en el reino de Lidia hace unos 2.600 años. Situada en lo que hoy es Turquía, Lidia se encontraba en la cúspide entre el Mediterráneo y Oriente Próximo, y el comercio con viajeros extranjeros era habitual, lo cual fue uno de los principales promotores de que se acuñara esta moneda. Para entender el porqué, imaginemos que se realiza un comercio en ausencia de dinero o, en otras palabras, a través del trueque. El principal problema del trueque es que se requiere un doble coincidencia de necesidades; supongamos que tienes un racimo de plátanos y quieres un par de zapatos, pero no basta con encontrar a alguien que tenga unos zapatos o a alguien que quiera unos plátanos. Para hacer el trueque, hay que encontrar a alguien que tenga zapatos que esté dispuesto a intercambiar y que quiera plátanos, lo cual no es tarea fácil.

source: With a common currency, the task becomes easier: You just sell your bananas to someone in exchange for money, with which you then buy shoes from someone else. And if, as in Lydia, you have foreigners from whom you'd like to buy or to whom you'd like to sell, having a common medium of exchange is obviously valuable. That is, money is especially useful when dealing with people you don't know and may never see again.
es: Con una moneda común, la tarea se hace más fácil: Simplemente vendes tus plátanos a alguien a cambio de dinero, con el que luego compras zapatos a alguien más. Y si, como en Lidia, hay extranjeros a los que quieres comprar o a los que quieres vender, tener un medio de cambio en común es obviamente valioso. Es decir, el dinero es especialmente útil cuando se trata de personas que no conoces y que quizá no vuelvas a ver.

source: The Lydian system's breakthrough was the standardized metal coin. Made of a gold-silver alloy called electrum, one coin was exactly like another—unlike, say, cattle. Also unlike cattle, the coins didn't age or die or otherwise change over time. And they were much easier to carry around. Other kingdoms followed Lydia's example, and coins became ubiquitous throughout the Mediterranean, with kingdoms stamping their insignia on the coins they minted. This had a dual effect: it facilitated the flow of trade, and it established the authority of the state.
es: Una gran innovación en el avance del reino del Lidia fue la moneda metálica estandarizada. Fabricada con una aleación de oro y plata llamada electrum, una moneda era exactamente igual a otra, a diferencia, por ejemplo, del ganado. A diferencia del ganado, las monedas no envejecían, ni morían, ni cambiaban con el tiempo y además eran mucho más fáciles de transportar. Otros reinos siguieron el ejemplo de Lidia, y las monedas se hicieron presentes en todo el Mediterráneo, con reinos que estampaban su insignia en las monedas que acuñaban. Esto tenía un efecto doble: facilitaba el flujo comercial y establecía la autoridad del estado.

source: The spread of money throughout the Mediterranean didn't mean that it was universally used; soon after Lydia, cities and states in Greece, Persia, India and China began to strike their own coins, but even then most people were still subsistence farmers and existed largely outside the money economy. But as money became more common, it encouraged the spread of markets. Once a small part of the economy is taken over by markets and money, they tend to colonize the rest of the economy, gradually forcing out barter, feudalism, and other economic arrangements. This happens mostly because money makes market transactions so much easier and also because using money seems to redefine what people value, pushing them to view things in economic, rather than social, terms.
es: La difusión de la moneda por el Mediterráneo no significó su uso universal; poco después de Lidia, las ciudades y los estados de Grecia, Persia, India y China empezaron a acuñar sus propias monedas, pero incluso entonces la mayoría de la gente seguía siendo agricultora de subsistencia y vivía en gran medida al margen de la economía monetaria. Pero a medida que el dinero se hizo más común, fomentó la expansión de los mercados. Una vez que los mercados y el dinero se apoderan de una pequeña parte de la economía, tienden a colonizar el resto de la economía, forzando gradualmente el trueque, el feudalismo y otros acuerdos económicos. Esto sucede sobre todo porque el dinero facilita mucho las transacciones de mercado y también porque el uso del dinero parece redefinir lo que la gente valora, empujándola a ver las cosas en términos económicos, en lugar de sociales.

source: Governments were quick to embrace hard currency because it facilitated the collection of taxes and the building of military forces, coins funded armies and wars of conquest. In the process, coins became legal tender for all sorts of transactions. Marketplaces were a result of this system, not its cause, revisionists argue.
es: Los gobiernos se apresuraron en adoptar las monedas metálicas porque facilitaban la recaudación de impuestos y la creación de fuerzas militares ya estas financiaban los ejércitos y las guerras de conquista. En el proceso, las monedas se convirtieron en moneda de curso legal para todo tipo de transacciones. Múltiples revisionistas sostienen que los mercados fueron un resultado de este sistema, no su causa.

source: Once the Chinese had started making comparatively inexpensive paper from natural fibers, and discovered block-printing, paper currency came into use in the country. The first known use of paper currency in China is reported from the Tang dynasty and despite the fact that scarce information remains about this early system of paper currency there's evidence that these were certificates issued by the Tang government to pay local merchants in distants parts of the empire. By using certificates, the government could avoid having to transport metal money far away. Each certificate had a certain amount of money stated on it and was redeemable for metal cash on demand in the Chinese capital. Most merchants never went through the trouble of going to the capital to get cash for their certificate, instead the certificates were used as money locally, since they were transfereable. The view of money as commodity began to shift only with the widespread adoption of paper currency.
es: Una vez que los chinos empezaron a fabricar papel comparativamente barato a partir de fibras naturales y descubrieron la impresión de bloque, el papel moneda empezó a utilizarse en el país. El primer uso conocido del papel moneda en China se remonta a la dinastía Tang y, a pesar de la escasa información que se conserva sobre este primer sistema de papel moneda, hay pruebas de que se trataba de certificados emitidos por el gobierno Tang para pagar a los comerciantes locales en partes distantes del imperio. Mediante el uso de certificados, el gobierno podía evitar tener que transportar monedas metálicas a lugares lejanos. Cada certificado tenía una cantidad de monedas metálicas determinada y era canjeable por las monedas a petición en la capital china. La mayoría de los comerciantes nunca se tomaban la molestia de ir a la capital para obtener monedas metálicas por su certificado, sino que los certificados se utilizaban como dinero a nivel local, ya que eran transferibles. La visión del dinero como mercancía sólo empezó a cambiar con la adopción generalizada del papel moneda.

source: Compared to traditional money made from precious metals, paper currency was easier to transport, and the use of paper currency also freed up metal that could be put to other use. In 1821, the Bank of England adopted the gold standard, promising to redeem its notes for gold upon request. As other countries followed suit, the gold standard became the general rule for developed economies. The discovery of major new gold fields over the course of the 19th century ensured that the money supply kept growing.
es: En comparación con las monedas metálicas hechas de metales preciosos, el papel moneda era más fácil de transportar, y el uso del papel moneda también liberaba metal que podía destinarse a otros usos. En 1821, el Banco de Inglaterra adoptó el estándar oro, prometiendo canjear sus billetes por oro si se le solicitaba. Cuando otros países siguieron su ejemplo, el patrón oro se convirtió en la norma general de las economías desarrolladas. El descubrimiento de nuevos e importantes yacimientos de oro a lo largo del siglo XIX hizo que el suministro de monedas siguiera creciendo.

source: The gold standard, as it was intended to do, brought stability to prices and was enormously beneficial to property holders and lenders. However, it also brought deflation—that is, prices generally fell—because as countries, populations and economies grew, their governments had no easy way to increase the money supply short of mining more gold, and so money in effect became more scarce. Deflation was hard on farmers and borrowers, who longed for a little inflation to help them with their debts; when money gradually loses some of its value, so, too, do people's debts.
es: El estándar oro, como se pretendía, aportó estabilidad a los precios y fue enormemente beneficioso para los propietarios y prestamistas. Sin embargo, también trajo consigo la deflación -es decir, los precios cayeron en general- porque a medida que los países, las poblaciones y las economías crecían, sus gobiernos no tenían una forma fácil de aumentar la oferta monetaria si no era extrayendo más oro, por lo que el dinero en efecto se volvió más escaso. La deflación fue dura para los agricultores y los prestatarios, que anhelaban un poco de inflación para ayudarles con sus deudas; cuando el dinero pierde gradualmente parte de su valor, también lo hacen las deudas de la gente.

source: What finally derailed the gold standard was World War I. Since governments needed more money for their militaries than they had in gold, and so they simply began printing it. And though many countries tried to return to the gold standard after the war, the Great Depression consequences made it end for good. Because of this currencies today are “fiat" currencies, meaning they're backed by the authority of the issuing government, and nothing more.
es: Lo que finalmente acabó con el patrón oro fue la Primera Guerra Mundial. Como los gobiernos necesitaban más dinero para sus ejércitos que el que tenían en oro, simplemente empezaron a imprimirlo. Y aunque muchos países intentaron volver al patrón oro después de la guerra, las consecuencias de la Gran Depresión hicieron que se acabara definitivamente. Por ello, las monedas actuales son monedas fiduciarias, lo que significa que están respaldadas por la autoridad del gobierno emisor, y nada más.

source: In the United States, for example, that means the government accepts only dollars as payment for taxes and requires its creditors to accept dollars in payment for debts. But if people were to lose faith in the dollar and stop accepting it in everyday transactions, it would eventually become worthless. The reliance on fiat money, we're told, gives too much power to the government, which can recklessly print as much money as it wants. Yet the truth is that this has always been possible. Even with the gold standard, governments revalued their currencies from time to time, in effect dictating a new price for gold, or they ignored the standard when it proved too limiting, as during the First World War. What's more, the notion that gold is somehow more “real" than paper is, well, a mirage. Gold is valuable because we've collectively decided that it's valuable and that we'll accept goods and services in exchange for it. And that's no different, ultimately, from our collective decision that colorful rectangles of paper are valuable and that we'll accept goods and services in exchange for them.
es: En Estados Unidos, por ejemplo, eso significa que el gobierno sólo acepta dólares para el pago de impuestos y exige a sus acreedores que acepten dólares para el pago de deudas. Pero si la gente perdiera la fe en el dólar y dejara de aceptarlo en las transacciones cotidianas, acabaría por perder su valor. La dependencia del dinero fiduciario otorga demasiado poder al gobierno, que puede imprimir imprudentemente todo el dinero que quiera. Pero la verdad es que esto siempre ha sido posible. Incluso con el patrón oro, los gobiernos revalorizaban sus monedas cuando era necesario, dictando de hecho un nuevo precio para el oro, o ignoraban el patrón cuando resultaba demasiado limitante, como durante la Primera Guerra Mundial. Además, la idea de que el oro es de alguna manera más eal que el papel es, bueno, un espejismo. El oro es valioso porque hemos decidido colectivamente que lo es y que aceptaremos bienes y servicios a cambio de él. Y eso no es diferente, en última instancia, de nuestra decisión colectiva de que los rectángulos de papel de colores son valiosos y que aceptaremos bienes y servicios a cambio de ellos.

source: Difference Between Money and Currency
es: Diferencia entre Dinero y Moneda

source: While most of the time, the terms "money" and "currency" are used interchangeably, there are some suggestions that these terms are not identical terms; these suggest that money is inherently an intangible concept, while currency is the physical or tangible manifestation of the intangible concept of money. By extension, according to this suggestions, money cannot be touched or smelled. Currency is the coin, note, or object that is presented as the physical form of money. The basic form of money is numbers; today some of the basic forms of currency are paper notes, coins, or plastic cards.
es: Aunque la mayoría de las veces los términos dinero y moneda se utilizan indistintamente, hay algunas sugerencias de que estos términos no son idénticos; éstas sugieren que el dinero es inherentemente un concepto intangible, mientras que la moneda es la manifestación física (tangible) del concepto intangible de dinero. Por extensión, según estas sugerencias, el dinero no se puede tocar ni oler. La moneda suele presentarse en formas metálicas redondas conocidas igualmente como monedas, o en forma de piezas de papel, llamadas billetes o papel moneda. La forma básica del dinero son los números; algunas de las formas básicas de moneda actualmente son los billetes de papel, las monedas y las tarjetas de plástico.

source: The powerful combination of computers and telecommunications, of smartphones and social media, of cryptography and virtual economies makes it seem like it's a possibility to create a cashless society. What matters most about money is not what it is, but what it does. After all, people will use the currencies that lubricate commerce, allow people to exchange goods and services, and thus encourage people to work and create. Money, whether it's represented by a metal coin, a shell or a piece of paper, doesn't always have value. Its value depends on the importance that people place on it—as a store of value, a unit of account, and a medium of exchange. Money is valuable merely because everyone knows that it will be accepted as a form of payment. However, throughout history, both the usage and the form of money have evolved.
es: La poderosa combinación de computadoras y telecomunicaciones, de teléfonos inteligentes y medios sociales, de criptografía y economías virtuales hace que parezca posible crear una sociedad sin dinero en efectivo (monedas metálicas ni papel moneda). Lo más relevante del dinero no es su representación, sino el efecto que tiene. Al fin y al cabo, las personas utilizan monedas que lubrican el comercio, permiten el intercambio de bienes y servicios y, por lo tanto promueven el trabajo y la creación. El dinero, ya sea representado por una moneda de metal, una concha o un trozo de papel, no siempre tiene valor. Su valor depende de la importancia que le atribuyan las personas: como depósito del valor, unidad de medida y medio de intercambio. El dinero tiene valor simplemente porque todo el mundo sabe que será aceptado como forma de pago. Sin embargo, a lo largo de la historia, tanto el uso como la forma del dinero han evolucionado.

source: Definition of Cryptocurrencies
es: Definición de Criptomonedas

source: Cryptocurrency is a digital or virtual form of currency; meaning it's a representations of value, that uses cryptography to secure and verify transactions as well as to control the creation of new units.
es: La criptomoneda es una forma de moneda digital o virtual; lo que significa que es una representación de valor, que utiliza criptografía para asegurar y verificar transacciones, así como para controlar la creación de nuevas unidades.
