Repository: Decentral-America/docs
Catalog: docs/locales/*/LC_MESSAGES/01_introduction.po
Languages: es

source: Cryptocurrencies operate on systems that allow for secure online transactions to take place without the need for any central banks or intermediaries. Instead, transactions are recorded on a decentralized and distributed public ledger (DLT) called a blockchain, which is maintained by a network of computers around the world that record all transactions in a secure and transparent manner.
es: Las criptomonedas operan en sistemas que permiten que se realicen transacciones en línea seguras sin la necesidad de bancos centrales o intermediarios. En cambio, las transacciones se registran en un libro público descentralizado y distribuido (DLT) llamado blockchain, que es mantenido por una red de computadoras en todo el mundo que registra todas las transacciones de manera segura y transparente.

source: Definition of Blockchain Technology
es: Definición de la Tecnología Blockchain

source: Blockchain technology is crucial to cryptocurrencies as it allows transactions to be processed and authenticated without any central authority. Instead of relying on a single, centralized authority to manage and store the data, blockchains rely on a network of computers to validate and record transactions, which makes them more secure and resistant to tampering or hacking. A blockchain offers a commonly agreed record of truth to multiple, mutually distrusting participants in an economic system since it keeps track of cryptocurrency transactions which are grouped into blocks. Each block is cryptographically linked to the previous one so as new blocks are added the older blocks become more difficult to modify. New blocks are replicated across all copies of the blockchain within the network, and any conflicts are resolved automatically using established rules.
es: La tecnología Blockchain es crucial para las criptomonedas, ya que permite que las transacciones se procesen y autentiquen sin ninguna autoridad central. En lugar de depender de una única autoridad centralizada para administrar y almacenar los datos, las cadenas de bloques se basan en una red de computadoras para validar y registrar las transacciones, lo que las hace más seguras y resistentes a la manipulación o la piratería. Una cadena de bloques ofrece un registro de la verdad comúnmente acordado a múltiples participantes en un sistema económico que desconfían mutuamente, ya que realiza un seguimiento de las transacciones de criptomonedas que se agrupan en bloques. Cada bloque está vinculado criptográficamente al anterior, por lo que a medida que se agregan nuevos bloques, los bloques más antiguos se vuelven más difíciles de modificar. Los nuevos bloques se replican en todas las copias de la cadena de bloques dentro de la red y cualquier conflicto se resuelve automáticamente utilizando las reglas establecidas.

source: A blockchain is spread across nodes usually in different locations. This is one of the key ideas about blockchain, and gives it its unique decentralized features. Because of this, anyone can submit information to be stored onto a blockchain and therefore it is important that there are processes in place that can ensure everyone agrees on what information to add and what to discard. Different networks use different methods but this procesess together are what's called a consensus protocol and they are essentially the rules by which a network operates.
es: Una cadena de bloques está esparcida entre nodos situados normalmente en diferentes lugares. Esta es una de las ideas clave de la cadena de bloques, y le otorga sus características únicas de descentralización. Por ello, cualquiera puede enviar información para ser almacenada en una cadena de bloques y, por lo tanto, es importante que existan procesos que garanticen que todo el mundo se ponga de acuerdo sobre qué información añadir y qué información desechar Diferentes redes utilizan diferentes métodos, pero estos procesos juntos son lo que se conoce como un protocolo de consenso y son esencialmente las reglas mediante las cuales se rige el funcionamiento de la red.

source: Definition of Consensus Protocol
es: Definición de Protocolo de Consenso

source: Consensus is a pervasive problem in many areas of human endeavor; consensus is the process of agreeing to one of several alternates proposed by a number of agents. Consensus can be defined as an agreement, protocols are rules which describe how an activity should be performed. Simply put, consensus protocols could be viewed as “agreement rules”.
es: El consenso es un problema dominante en muchos ámbitos del quehacer humano; el consenso es el proceso de acordar en una de varias alternativas propuestas por varios agentes. El consenso puede definirse como un acuerdo, los protocolos son reglas que describen cómo debe realizarse una actividad. En pocas palabras, los protocolos de consenso pueden verse como las eglas del acuerdo.

source: A consensus protocol (also known as consensus mechanism or consensus algorithm) is used to achieve the necessary agreement on a single data value or a single state of the distributed ledger at any given time. It provides a method of review and confirmation of what data should be added to a blockchain's record. Because blockchain networks typically don't have a centralized authority dictating who is right or wrong, nodes on a blockchain all must agree on the state of the network, following the predefined rules, or protocol.
es: Un protocolo de consenso (también conocido como mecanismo de consenso o algoritmo de consenso) se utiliza para lograr el acuerdo necesario sobre un único valor de datos o un único estado de la cadena de bloques en un momento dado. Proporciona un método de revisión y confirmación acerca de cuales datos que deben añadirse al registro de una cadena de bloques. Debido a que no existe una autoridad centralizada que dicte quién tiene razón o no, todos los nodos participantes deben llegar a un acuerdo sobre el estado de la red, siguiendo las reglas predefinidas o protocolo.

source: Current State of Blockchain Technology
es: Estado Actual de la Tecnología Blockchain

source: The Bitcoin blockchain was first introduced in 2008 through a white paper by its pseudonymous creator Satoshi Nakamoto as a peer-to-peer electronic cash system that allows users to send payments directly to each other using Bitcoin (BTC), the blockchain's native currency, without the need for intermediaries such as financial institutions. The first Bitcoin transaction took place in January 2009, when Satoshi Nakamoto sent 10 Bitcoins to the first person who downloaded the software. The first commercial transaction using Bitcoin took place in 2010, when a programmer named Laszlo Hanyecz ordered two pizzas by paying 10,000 Bitcoins to an intermediary.
es: La cadena de bloques de Bitcoin se introdujo por primera vez en 2008 a través de un libro blanco de su creador seudónimo Satoshi Nakamoto como un sistema de efectivo electrónico entre pares que permite a los usuarios enviar pagos directamente entre sí utilizando Bitcoin (BTC), la moneda nativa de la cadena de bloques, sin la necesidad de intermediarios como las instituciones financieras. La primera transacción de Bitcoin tuvo lugar en enero de 2009, cuando Satoshi Nakamoto envió 10 Bitcoins a la primera persona que descargó el software. La primera transacción comercial con Bitcoin tuvo lugar en 2010, cuando un programador llamado Laszlo Hanyecz pidió dos pizzas pagando 10.000 Bitcoins a un intermediario.

source: Bitcoin uses a proof of work (PoW) consensus protocol, in which miners compete to solve complex mathematical equations using their computing power. The first miner who succeeds in solving the cryptographic puzzle adds the latest block of transactions to the blockchain and receives rewards in the form of newly minted coins and transaction fees. This process is energy-intensive and was designed to be difficult on purpose to "prove" that participants have done the "work" and are eligible to add a new block to the blockchain.
es: Bitcoin utiliza un protocolo de consenso de prueba de trabajo (PoW), en el que los mineros compiten para resolver ecuaciones matemáticas complejas utilizando su potencia informática. El primer minero que logra resolver el rompecabezas criptográfico agrega el último bloque de transacciones a la cadena de bloques y recibe recompensas en forma de monedas recién acuñadas y tarifas de transacción. Este proceso consume mucha energía y fue diseñado para ser difícil a propósito para "probar" que los participantes han hecho el "trabajo" y son elegibles para agregar un nuevo bloque a la cadena de bloques.

source: The scripting language used in Bitcoin transactions is called Script. It is used almost exclusively to define how outputs can be spent and is responsible for enforcing the rules that govern Bitcoin transactions. In other words, Script determines who the BTC was sent to, how much was sent, and under what conditions it can be spent.
es: El lenguaje de secuencias de comandos utilizado en las transacciones de Bitcoin se llama Script. Se utiliza casi exclusivamente para definir cómo se pueden gastar los productos y es responsable de hacer cumplir las reglas que rigen las transacciones de Bitcoin. En otras palabras, Script determina a quién se envió el BTC, cuánto se envió y en qué condiciones se puede gastar.

source: Ethereum is a decentralized blockchain platform that revolutionized the way applications are built and executed. Founded in 2015 by co-founder Vitalik Buterin, who published its white paper in 2013, Ethereum offers a range of features that go beyond those of Bitcoin, including the possibility to create new cryptocurrencies and the ability to execute smart contracts, which are self-executing agreements encoded onto the blockchain, with the terms of the agreement between buyer and seller being directly written into lines of code without the need for intermediaries all while enforcing the negotiation or performance of the contract automatically. By enabling the execution of smart contracts, Ethereum opens up the possibility of creating decentralized applications (DApps), which operate transparently and independently without any central authority.
es: Ethereum es una plataforma blockchain descentralizada que revolucionó la forma en que se crean y ejecutan las aplicaciones. Fundada en 2015 por el cofundador Vitalik Buterin, quien publicó su libro blanco en 2013, Ethereum ofrece una gama de funciones que van más allá de las de Bitcoin, incluida la posibilidad de crear nuevas criptomonedas y la capacidad de ejecutar contratos inteligentes, que son autónomos. ejecutar acuerdos codificados en la cadena de bloques, con los términos del acuerdo entre el comprador y el vendedor escritos directamente en líneas de código sin la necesidad de intermediarios, todo mientras se hace cumplir la negociación o el cumplimiento del contrato automáticamente. Al permitir la ejecución de contratos inteligentes, Ethereum abre la posibilidad de crear aplicaciones descentralizadas (DApps), que operan de forma transparente e independiente sin ninguna autoridad central.

source: Like Bitcoin, Ethereum initially used a proof-of-work (PoW) consensus protocol, similar to Bitcoin, but it has undergone a major upgrade that moved it to a proof-of-stake (PoS) consensus protocol. Unlike Proof of Work (PoW) consensus models, where miners' ability to validate block transactions is based on their hardware's computing power, PoS models assign the task of validating new blocks based on the size of the node's stake, with larger stakes having a higher likelihood of producing the next block. The PoS system aims to provide a more energy-efficient alternative to PoW while still maintaining the security of the blockchain. This upgrade on the concensus protocol aims to increase efficiency, security, and reduce environmental impact by eliminating the need for the intensive computational power that PoW requires.
es: Al igual que Bitcoin, Ethereum inicialmente usó un protocolo de consenso de prueba de trabajo (PoW), similar a Bitcoin, pero se sometió a una actualización importante que lo movió a un protocolo de consenso de prueba de participación (PoS). A diferencia de los modelos de consenso de Prueba de trabajo (PoW), en los que la capacidad de los mineros para validar transacciones de bloques se basa en la potencia informática de su hardware, los modelos PoS asignan la tarea de validar nuevos bloques en función del tamaño de la participación del nodo, y las participaciones más grandes tienen una mayor participación. probabilidad de producir el siguiente bloque. El sistema PoS tiene como objetivo proporcionar una alternativa más eficiente energéticamente a PoW mientras mantiene la seguridad de la cadena de bloques. Esta actualización del protocolo de consenso tiene como objetivo aumentar la eficiencia, la seguridad y reducir el impacto ambiental al eliminar la necesidad de la potencia computacional intensiva que requiere PoW.

source: The blockchain's native currency is called Ether or ETH. Ether is used mainly for two purposes—it is traded as a digital currency on exchanges in the same fashion as other cryptocurrencies, and it is used on the Ethereum network to run applications. Therefore all decentralized applications built on Ethereum allow Ether and other crypto assets to be used in a plethora of different ways including as collateral for loans or be lent out to borrowers to earn interest. Collateral refers to assets pledged as security for repayment of a loan.
es: La moneda nativa de la cadena de bloques se llama Ether o ETH. El Ether se utiliza principalmente para dos propósitos: se negocia como criptomoneda en los intercambios de la misma manera que otras criptomonedas, y se utiliza en la red Ethereum para ejecutar aplicaciones. Por lo tanto, todas las aplicaciones descentralizadas construidas sobre Ethereum permiten que el Ether y otras criptomonedas sean utilizadas en una gran variedad de formas diferentes, incluyendo por ejemplo como garantía para los préstamos o pueden ser prestados a los prestatarios para ganar intereses. La garantía se refiere a las criptomonedas ofrecidas como seguridad de que será pagado el préstamo.

source: Ethereum offers multiple languages for programmers to develop smart contracts. The two most active and maintained languages are:
es: Ethereum ofrece múltiples lenguajes para que los programadores desarrollen contratos inteligentes. Los dos lenguajes más activos y mantenidos son:

source: DecentralChain is a cutting-edge, secure and efficient blockchain ecosystem empowering smart contract creation, decentralized application (DApps) development and a thriving decentralized finance (DeFi) community. It utilizes a consensus protocol called Leased Proof of Stake (LPoS) which aims to improve upon traditional Proof of Stake (PoS) by allowing users to lease their stakes to other users, which increases the latter's ability to produce new blocks. In return, the lender receives a percentage of the transaction fees earned by the validator. This leasing mechanism aims to address the possible centralization problem in traditional PoS models where a few large stakeholders control a significant portion of the network, and the decision-making power is concentrated in the hands of a small group of individuals or entities while at the same time allowing all users to earn rewards, extending the ability to participate in the network to not only minority stakeholders but also users who just want to lease their stakes to other users.
es: DecentralChain es un ecosistema de cadena de bloques de vanguardia, seguro y eficiente que permite la creación de contratos inteligentes, el desarrollo de aplicaciones descentralizadas (DApps) y una próspera comunidad de finanzas descentralizadas (DeFi). Utiliza un protocolo de consenso llamado Leased Proof of Stake (LPoS) que tiene como objetivo mejorar la Prueba de participación tradicional (PoS) al permitir a los usuarios arrendar sus participaciones a otros usuarios, lo que aumenta la capacidad de este último para producir nuevos bloques. A cambio, el prestamista recibe un porcentaje de las tarifas de transacción ganadas por el validador. Este mecanismo de arrendamiento tiene como objetivo abordar el posible problema de centralización en los modelos de PoS tradicionales, donde unas pocas partes interesadas importantes controlan una parte significativa de la red y el poder de toma de decisiones se concentra en manos de un pequeño grupo de personas o entidades mientras que al mismo tiempo tiempo que permite a todos los usuarios ganar recompensas, extendiendo la capacidad de participar en la red no solo a las partes interesadas minoritarias sino también a los usuarios que solo desean arrendar sus participaciones a otros usuarios.

source: DecentralChain offers a unique approach to decentralized application development by avoiding high gas fees for all transactions. The blockchain's native language, called Ride, is a non-Turing-complete language, which helps keep the system secure and predictable. Ride allows for the creation of smart contracts, which are self-executing agreements written in code that run without a central entity behind them. This provides a platform for decentralized applications (DApps), which are applications that work without a central authority. DecentralChain's use of Ride and LPoS helps to ensure the stability and security of the network, making it an attractive option for decentralized application development.
es: DecentralChain ofrece un enfoque único para el desarrollo de aplicaciones descentralizadas al evitar altas tarifas de gas para todas las transacciones. El lenguaje nativo de blockchain, llamado Ride, es un lenguaje no completo de Turing, lo que ayuda a mantener el sistema seguro y predecible. Ride permite la creación de contratos inteligentes, que son acuerdos autoejecutables escritos en código que se ejecutan sin una entidad central detrás de ellos. Esto proporciona una plataforma para aplicaciones descentralizadas (DApps), que son aplicaciones que funcionan sin una autoridad central. El uso de Ride y LPoS por parte de DecentralChain ayuda a garantizar la estabilidad y la seguridad de la red, lo que la convierte en una opción atractiva para el desarrollo de aplicaciones descentralizadas.

source: DecentralChain Ecosystem
es: Ecosistema DecentralChain

source: The DecentralChain ecosystem enables secure communication and interoperability between different blockchain networks. The ecosystem uses protocols to facilitate the transfer of assets and information between blockchain networks, as well as incentivize sustainability by reducing carbon emissions per transaction and generating carbon credits. Additionally, the ecosystem encourages carbon sequestration, where the sequestered carbon is tokenized and can be traded on a blockchain platform. There is also a decentralized wallet and exchange built on the DecentralChain network that offers various benefits, such as fast execution rates, multi-chain capability, low fees, and interoperability.
es: El ecosistema DecentralChain permite la comunicación segura y la interoperabilidad entre diferentes redes de blockchain. El ecosistema utiliza protocolos para facilitar la transferencia de activos e información entre redes blockchain, así como incentivar la sostenibilidad al reducir las emisiones de carbono por transacción y generar créditos de carbono. Además, el ecosistema fomenta el secuestro de carbono, donde el carbono secuestrado se tokeniza y se puede comercializar en una plataforma de cadena de bloques. También hay una billetera descentralizada y un intercambio construido en la red DecentralChain que ofrece varios beneficios, como tasas de ejecución rápidas, capacidad de múltiples cadenas, tarifas bajas e interoperabilidad.

source: Inter-Chain Gateway Protocol
es: Protocolo de Puerta de Enlace entre Cadenas

source: The DecentralChain Inter-Chain Gateway is a blockchain mechanism designed to enable secure communication and interoperability between different blockchain networks. This is achieved by creating a decentralized network of nodes that utilize smart contract technology to validate and process transactions between different blockchains.
es: El protocolo de puerta de enlace entre cadenas de DecentralChain es un mecanismo de cadena de bloques diseñado para permitir la comunicación segura y la interoperabilidad entre diferentes redes de cadena de bloques. Esto se logra mediante la creación de una red descentralizada de nodos que utilizan tecnología de contrato inteligente para validar y procesar transacciones entre diferentes cadenas de bloques.

source: One major use case of the gateway is the ability to transfer assets between different blockchain networks. For example, if you hold Bitcoin but want to use it on another blockchain network, such as DecentralChain, the gateway can allow you to transfer your Bitcoin to the DecentralChain network, where it is converted into a form that is compatible with the DecentralChain blockchain.
es: Un caso de uso importante de la puerta de enlace es la capacidad de transferir activos entre diferentes redes de blockchain. Por ejemplo, si tiene Bitcoin pero desea usarlo en otra red de cadena de bloques, como DecentralChain, la puerta de enlace puede permitirle transferir su Bitcoin a la red DecentralChain, donde se convierte en una forma compatible con la cadena de bloques DecentralChain.

source: In addition, the gateway facilitates the sharing of information between different blockchain networks. By creating a decentralized oracle network, smart contracts on different blockchain networks can access and utilize external data, enabling the creation of decentralized applications that use data from multiple sources and blockchain networks.
es: Además, la puerta de enlace facilita el intercambio de información entre diferentes redes de blockchain. Al crear una red Oracle descentralizada, los contratos inteligentes en diferentes redes de cadenas de bloques pueden acceder y utilizar datos externos, lo que permite la creación de aplicaciones descentralizadas que usan datos de múltiples fuentes y redes de cadenas de bloques.

source: To ensure the network's security, the gateway uses smart contract technology with predefined rules and conditions that are automatically executed when specific conditions are met. These conditions include input validation and access controls to ensure that only authorized parties can access and utilize the network's information.
es: Para garantizar la seguridad de la red, la puerta de enlace utiliza tecnología de contrato inteligente con reglas y condiciones predefinidas que se ejecutan automáticamente cuando se cumplen condiciones específicas. Estas condiciones incluyen validación de entrada y controles de acceso para garantizar que solo las partes autorizadas puedan acceder y utilizar la información de la red.

source: Proof of Incentivized Sustainability Protocol
es: Protocolo de Prueba de Sostenibilidad Incentivada
