Repository: Decentral-America/docs
Catalog: docs/locales/*/LC_MESSAGES/01_introduction.po
Languages: es

source: Moreover, the education and awareness initiatives and partnerships with schools and non-profit organizations planned by CR Coin will help raise awareness about the importance of preserving the environment and promoting sustainable practices. By combining technology, community engagement and education, CR Coin aims to be a driving force for sustainable development and environmental conservation in Costa Rica.
es: Además, las iniciativas de educación y concientización y las asociaciones con escuelas y organizaciones sin fines de lucro planificadas por CR Coin ayudarán a crear conciencia sobre la importancia de preservar el medio ambiente y promover prácticas sostenibles. Al combinar tecnología, participación comunitaria y educación, CR Coin pretende ser una fuerza impulsora para el desarrollo sostenible y la conservación del medio ambiente en Costa Rica.

source: Native Swap
es: Intercambio Nativo

source: DecentralChain is an innovative blockchain platform that offers a wide range of features to its users, one of which is the upcoming DecentralChain native swap. A swap is a way for users to exchange one cryptocurrency for another, without the need for a centralized intermediary. In this essay, we will delve into how the DecentralChain native swap is expected to work, and explain how users will be able to use it to swap their DecentralCoin for other cryptocurrencies.
es: DecentralChain es una innovadora plataforma de cadena de bloques que ofrece una amplia gama de características a sus usuarios, una de las cuales es el próximo intercambio nativo de DecentralChain. Un intercambio es una forma en que los usuarios intercambian una criptomoneda por otra, sin la necesidad de un intermediario centralizado. En este ensayo, profundizaremos en cómo se espera que funcione el intercambio nativo de DecentralChain y explicaremos cómo los usuarios podrán usarlo para intercambiar su DecentralCoin por otras criptomonedas.

source: A swap is essentially a smart contract that facilitates the exchange of one cryptocurrency for another. When a user initiates a swap, their cryptocurrency is locked into the smart contract, and they receive the equivalent amount of the other cryptocurrency in return. The smart contract then releases the locked up cryptocurrency to the other user. This process happens on-chain, meaning that the swap is settled on the blockchain, and the transaction is recorded on the blockchain's ledger.
es: Un intercambio es esencialmente un contrato inteligente que facilita el intercambio de una criptomoneda por otra. Cuando un usuario inicia un intercambio, su criptomoneda se bloquea en el contrato inteligente y recibe a cambio la cantidad equivalente de la otra criptomoneda. El contrato inteligente luego libera la criptomoneda bloqueada al otro usuario. Este proceso ocurre en la cadena, lo que significa que el intercambio se liquida en la cadena de bloques y la transacción se registra en el libro mayor de la cadena de bloques.

source: The DecentralChain native swap is expected to be powered by an Automated Market Maker (AMM) algorithm. This algorithm will calculate the price of the coin based on the token supply and the liquidity in the swap. The price will be calculated using the constant product formula.
es: Se espera que el intercambio nativo de DecentralChain funcione con un algoritmo Automated Market Maker (AMM). Este algoritmo calculará el precio de la moneda en función del suministro de tokens y la liquidez en el intercambio. El precio se calculará utilizando la fórmula del producto constante.

source: A swap platform can be thought of as a liquidity pool where users can deposit their tokens, and then use those tokens to swap for other tokens on the platform. As more users deposit tokens into the pool, the pool's liquidity increases, making it more attractive for users to swap their tokens on the platform.
es: Se puede pensar en una plataforma de intercambio como un grupo de liquidez donde los usuarios pueden depositar sus tokens y luego usar esos tokens para intercambiarlos por otros tokens en la plataforma. A medida que más usuarios depositan tokens en el grupo, la liquidez del grupo aumenta, lo que hace que sea más atractivo para los usuarios intercambiar sus tokens en la plataforma.

source: The DecentralChain native swap is expected to offer users a secure, efficient, and decentralized way to swap their cryptocurrencies. By eliminating the need for centralized intermediaries, users will be able to exchange their cryptocurrencies without relying on third parties, which can be slow, expensive, and risky. With the upcoming launch of the DecentralChain native swap, users will be able to experience the future of crypto swapping firsthand.
es: Se espera que el intercambio nativo de DecentralChain ofrezca a los usuarios una forma segura, eficiente y descentralizada de intercambiar sus criptomonedas. Al eliminar la necesidad de intermediarios centralizados, los usuarios podrán intercambiar sus criptomonedas sin depender de terceros, lo que puede ser lento, costoso y riesgoso. Con el próximo lanzamiento del intercambio nativo de DecentralChain, los usuarios podrán experimentar el futuro del intercambio de criptomonedas de primera mano.
