Repository: Decentral-America/docs
Catalog: docs/locales/*/LC_MESSAGES/01_introduction.po
Languages: es

source: As society becomes increasingly aware of the impact of climate change, businesses and individuals are looking for ways to reduce their carbon footprint. In the realm of blockchain technology, the high energy consumption and resulting carbon emissions of Bitcoin transactions are particularly problematic. However, the DecentralChain blockchain presents a solution to this problem through the use of its proof of incentivized sustainability protocol.
es: A medida que la sociedad se vuelve cada vez más consciente del impacto del cambio climático, las empresas y las personas buscan formas de reducir su huella de carbono. En el ámbito de la tecnología blockchain, el alto consumo de energía y las emisiones de carbono resultantes de las transacciones de Bitcoin son particularmente problemáticos. Sin embargo, la cadena de bloques DecentralChain presenta una solución a este problema mediante el uso de su protocolo de prueba de sostenibilidad incentivada.

source: The traditional Bitcoin blockchain consumes a significant amount of energy for each transaction, releasing large amounts of carbon emissions into the atmosphere. In contrast, the DecentralChain blockchain utilizes a proof of stake protocol which is more energy efficient, resulting in significantly lower carbon emissions per transaction.
es: La cadena de bloques tradicional de Bitcoin consume una cantidad significativa de energía para cada transacción, liberando grandes cantidades de emisiones de carbono a la atmósfera. Por el contrario, la cadena de bloques DecentralChain utiliza un protocolo de prueba de participación que es más eficiente energéticamente, lo que resulta en emisiones de carbono significativamente más bajas por transacción.

source: The DecentralChain blockchain generates carbon credits through the proof of incentivized sustainability protocol. Every Bitcoin transaction on the DecentralChain blockchain creates new carbon credits, which can be sold or used to offset the carbon emissions of other activities. DecentralChain shares a percentage of these carbon credits as incentives to node owners who host their nodes on eco-friendly servers.
es: La cadena de bloques DecentralChain genera créditos de carbono a través de la prueba del protocolo de sostenibilidad incentivada. Cada transacción de Bitcoin en la cadena de bloques DecentralChain crea nuevos créditos de carbono, que pueden venderse o usarse para compensar las emisiones de carbono de otras actividades. DecentralChain comparte un porcentaje de estos créditos de carbono como incentivos para los propietarios de nodos que alojan sus nodos en servidores ecológicos.

source: The equation to calculate the carbon emissions of the Bitcoin blockchain is:
es: La ecuación para calcular las emisiones de carbono de la cadena de bloques de Bitcoin es:

source: Carbon Emissions = Electricity used (kWh) x Carbon Intensity (gCO2/kWh)
es: Emisiones de carbono = Electricidad utilizada (kWh) x Intensidad de carbono (gCO2/kWh)

source: Using this equation, the carbon emissions of the Bitcoin blockchain can be compared to a proof of stake blockchain protocol like DecentralChain. The difference in carbon emissions between the two can then be used to generate carbon credits, creating a new market for businesses and individuals to offset their carbon emissions and invest in a sustainable future.
es: Usando esta ecuación, las emisiones de carbono de la cadena de bloques de Bitcoin se pueden comparar con un protocolo de cadena de bloques de prueba de participación como DecentralChain. La diferencia en las emisiones de carbono entre los dos se puede usar para generar créditos de carbono, creando un nuevo mercado para que las empresas y las personas compensen sus emisiones de carbono e inviertan en un futuro sostenible.

source: According to a study by the World Bank, carbon credits can yield a return of up to 7.2 percent annually over a 15-year period. This makes them an attractive investment for individuals and companies alike.
es: Según un estudio del Banco Mundial, los créditos de carbono pueden generar un rendimiento de hasta el 7,2 por ciento anual durante un período de 15 años. Esto los convierte en una inversión atractiva tanto para particulares como para empresas.

source: The DecentralChain blockchain not only provides a more sustainable alternative to traditional Bitcoin transactions but also creates new opportunities for businesses and individuals to invest in a sustainable future. By incentivizing sustainable practices through the proof of incentivized sustainability protocol and the hosting of nodes on eco-friendly servers, DecentralChain is paving the way for a greener, more sustainable future.
es: La cadena de bloques DecentralChain no solo proporciona una alternativa más sostenible a las transacciones tradicionales de Bitcoin, sino que también crea nuevas oportunidades para que las empresas y las personas inviertan en un futuro sostenible. Al incentivar las prácticas sostenibles a través de la prueba del protocolo de sostenibilidad incentivado y el alojamiento de nodos en servidores ecológicos, DecentralChain allana el camino para un futuro más verde y sostenible.

source: Carbon Sequestration
es: Secuestro de Carbono

source: Carbon sequestration, the process of capturing and storing carbon dioxide (CO2) to reduce its concentration in the atmosphere, is a critical strategy in mitigating the effects of climate change. Through the use of blockchain technology, carbon sequestration can be further incentivized, creating a new market for carbon credits.
es: El secuestro de carbono, el proceso de capturar y almacenar dióxido de carbono (CO2) para reducir su concentración en la atmósfera, es una estrategia fundamental para mitigar los efectos del cambio climático. Mediante el uso de la tecnología blockchain, se puede incentivar aún más el secuestro de carbono, creando un nuevo mercado para los créditos de carbono.

source: One of the ways to achieve carbon sequestration is by buying property in Costa Rica and tokenizing the sequestered carbon in the form of a digital token that can be traded on a blockchain platform. The Costa Rican government's initiative of National Forest Financing Fund (FONAFIFO) provides a financial incentive for private landowners to reforest and conserve their land, while also allowing them to receive payments for the carbon sequestered on their property in the form of carbon credits. By tokenizing these carbon credits on a blockchain platform, the carbon sequestration process can be further incentivized, creating a new market for carbon credits and a carbon credit-backed crypto-asset.
es: Una de las formas de lograr el secuestro de carbono es comprando propiedades en Costa Rica y tokenizando el carbono secuestrado en forma de token digital que se puede comercializar en una plataforma de cadena de bloques. La iniciativa del gobierno costarricense del Fondo Nacional de Financiamiento Forestal (FONAFIFO) brinda un incentivo financiero para que los propietarios privados reforesten y conserven sus tierras, al mismo tiempo que les permite recibir pagos por el carbono secuestrado en su propiedad en forma de créditos de carbono. Al tokenizar estos créditos de carbono en una plataforma blockchain, el proceso de secuestro de carbono puede incentivarse aún más, creando un nuevo mercado para los créditos de carbono y un criptoactivo respaldado por créditos de carbono.

source: The tokenization of carbon credits on a blockchain platform not only increases transparency and traceability in the carbon market, but it also provides a new way for people to invest in the conservation of natural areas while obtaining the economic benefit of the carbon credits. This creates a win-win situation, in which the carbon sequestration is incentivized, and the conservation of natural areas is supported.
es: La tokenización de créditos de carbono en una plataforma blockchain no solo aumenta la transparencia y la trazabilidad en el mercado de carbono, sino que también brinda una nueva forma para que las personas inviertan en la conservación de áreas naturales mientras obtienen el beneficio económico de los créditos de carbono. Esto crea una situación de ganar-ganar, en la que se incentiva la captura de carbono y se apoya la conservación de las áreas naturales.

source: The tokenization of carbon credits on a blockchain platform creates a new market for carbon credits and enables the creation of a carbon credit-backed crypto-asset. This approach can increase transparency and traceability in the carbon market, making it easier to track and verify the carbon credits being traded. Moreover, it provides a new way for people to invest in the conservation of natural areas, while also obtaining the economic benefit of the carbon credits. The Costa Rican government's initiative of National Forest Financing Fund (FONAFIFO) has set the base for this process, and with more involvement of the private sector, decentralized finance, and blockchain technology, this approach can be a step towards a sustainable future where everyone can participate in the conservation and mitigation of climate change.
es: La tokenización de créditos de carbono en una plataforma blockchain crea un nuevo mercado para créditos de carbono y permite la creación de un criptoactivo respaldado por créditos de carbono. Este enfoque puede aumentar la transparencia y la trazabilidad en el mercado de carbono, lo que facilita el seguimiento y la verificación de los créditos de carbono que se comercializan. Además, proporciona una nueva forma para que las personas inviertan en la conservación de áreas naturales, al mismo tiempo que obtienen el beneficio económico de los créditos de carbono. La iniciativa del gobierno costarricense del Fondo Nacional de Financiamiento Forestal (FONAFIFO) ha sentado las bases para este proceso, y con una mayor participación del sector privado, las finanzas descentralizadas y la tecnología blockchain, este enfoque puede ser un paso hacia un futuro sostenible donde todos puedan participar en la conservación y mitigación del cambio climático.

source: Wallet and Exchange
es: Billetera e Intercambio

source: `Decentral.Exchange <https://decentral.exchange/>`_ is an all-in-one platform that combines the features of a wallet, decentralized exchange, and cryptocurrency management tool into a single, seamless platform. Built on the DecentralChain blockchain, this platform offers numerous benefits to its users, including fast execution rates, multi-chain capability, low fees, and interoperability.
es: `Decentral.Exchange <https://decentral.exchange/>`_ es una plataforma todo en uno que combina las características de una billetera, un intercambio descentralizado y una herramienta de administración de criptomonedas en una sola plataforma sin problemas. Construida sobre la cadena de bloques DecentralChain, esta plataforma ofrece numerosos beneficios a sus usuarios, que incluyen tasas de ejecución rápidas, capacidad de cadena múltiple, tarifas bajas e interoperabilidad.

source: One of the most significant advantages of decentralized exchanges is that they are not controlled by any central authority, giving users complete control over their assets. Unlike centralized exchanges, there is no risk of funds being frozen or confiscated by a centralized entity. With Decentral.Exchange, users can also enjoy enhanced security, as their private keys are stored locally on their device, reducing the risk of cybercrime. Decentralized exchanges also provide access to a wider range of assets, thanks to the absence of restrictions on the number of tokens that can be traded. Decentral.Exchange takes this further with its multi-chain capability, allowing users to trade tokens across different blockchains seamlessly. Decentral.Exchange's interoperability enables users to trade tokens across various chains and different decentralized exchanges, making it possible to access a broader range of assets effortlessly.
es: Una de las ventajas más significativas de los intercambios descentralizados es que no están controlados por ninguna autoridad central, lo que brinda a los usuarios un control total sobre sus activos. A diferencia de los intercambios centralizados, no hay riesgo de que una entidad centralizada congele o confisque los fondos. Con Decentral.Exchange, los usuarios también pueden disfrutar de una seguridad mejorada, ya que sus claves privadas se almacenan localmente en su dispositivo, lo que reduce el riesgo de ciberdelincuencia. Los intercambios descentralizados también brindan acceso a una gama más amplia de activos, gracias a la ausencia de restricciones en la cantidad de tokens que se pueden intercambiar. Decentral.Exchange lleva esto más allá con su capacidad de múltiples cadenas, lo que permite a los usuarios intercambiar tokens en diferentes cadenas de bloques sin problemas. La interoperabilidad de Decentral.Exchange permite a los usuarios intercambiar tokens en varias cadenas y diferentes intercambios descentralizados, lo que hace posible acceder a una gama más amplia de activos sin esfuerzo.

source: One of the key selling points of Decentral.Exchange is its low fees, which sets it apart from traditional centralized exchanges that often charge exorbitant fees. The absence of intermediaries means that users can keep more of their profits, making trading more accessible to everyone. In the DecentralChain ecosystem, having a native decentralized exchange is essential, as it facilitates easy buying and selling of DecentralChain tokens within the ecosystem. Additionally, project participants can create their tokens and trade them on the exchange. Decentral.Exchange also enables users to send and receive coins without the need for a centralized intermediary.
es: Uno de los puntos clave de venta de Decentral.Exchange son sus bajas tarifas, lo que lo diferencia de los intercambios centralizados tradicionales que a menudo cobran tarifas exorbitantes. La ausencia de intermediarios significa que los usuarios pueden conservar una mayor parte de sus ganancias, lo que hace que el comercio sea más accesible para todos. En el ecosistema DecentralChain, tener un intercambio descentralizado nativo es esencial, ya que facilita la compra y venta de tokens DecentralChain dentro del ecosistema. Además, los participantes del proyecto pueden crear sus tokens e intercambiarlos en el intercambio. Decentral.Exchange también permite a los usuarios enviar y recibir monedas sin necesidad de un intermediario centralizado.

source: Decentral.Exchange is at the forefront of the future of crypto trading, providing users with a wide range of benefits that centralized exchanges cannot match. With its native blockchain, DecentralChain, Decentral.Exchange is ideally positioned to revolutionize the crypto industry and redefine the way we trade cryptocurrencies.
es: Decentral.Exchange está a la vanguardia del futuro del comercio de criptomonedas, brindando a los usuarios una amplia gama de beneficios que los intercambios centralizados no pueden igualar. Con su cadena de bloques nativa, DecentralChain, Decentral.Exchange está en una posición ideal para revolucionar la industria de las criptomonedas y redefinir la forma en que comerciamos con criptomonedas.

source: Blockchain Explorer
es: Explorador Blockchain

source: `DecentralScan.com <https://decentralscan.com/>`_ is the official block explorer of the DecentralChain blockchain. It is a powerful tool that allows users to view, track, and analyze transactions on the DecentralChain blockchain. The block explorer provides a user-friendly interface that simplifies the navigation of the complex data stored on the blockchain.
es: `DecentralScan.com <https://decentralscan.com/>`_ es el explorador de bloques oficial de la cadena de bloques DecentralChain. Es una herramienta poderosa que permite a los usuarios ver, rastrear y analizar transacciones en la cadena de bloques DecentralChain. El explorador de bloques proporciona una interfaz fácil de usar que simplifica la navegación de los datos complejos almacenados en la cadena de bloques.

source: One of the key benefits of DecentralScan.com is its ability to provide transparency to the DecentralChain ecosystem. It enables users to view all the transactions that have occurred on the blockchain in real-time, including the number of DecentralCoins (DCC) transferred, the addresses involved in the transaction, and the transaction timestamp. This makes it easy to track the movement of DCC and understand how the ecosystem is being used.
es: Uno de los beneficios clave de DecentralScan.com es su capacidad para brindar transparencia al ecosistema DecentralChain. Permite a los usuarios ver todas las transacciones que se han producido en la cadena de bloques en tiempo real, incluida la cantidad de DecentralCoins (DCC) transferidas, las direcciones involucradas en la transacción y la marca de tiempo de la transacción. Esto facilita el seguimiento del movimiento de DCC y la comprensión de cómo se utiliza el ecosistema.

source: The block explorer is also valuable in its ability to provide detailed information about the nodes in the network. Users can view the current number of nodes, their geographical distribution, and information about each node, such as its uptime and the number of blocks it has mined. This information is essential for the DecentralChain ecosystem, as it allows users to view the distribution of the network and understand the ecosystem's health.
es: El explorador de bloques también es valioso por su capacidad para proporcionar información detallada sobre los nodos de la red. Los usuarios pueden ver la cantidad actual de nodos, su distribución geográfica e información sobre cada nodo, como su tiempo de actividad y la cantidad de bloques que ha extraído. Esta información es esencial para el ecosistema DecentralChain, ya que permite a los usuarios ver la distribución de la red y comprender la salud del ecosistema.

source: In addition to tracking transactions and nodes, the block explorer also offers users a detailed view of the smart contract deployment on the blockchain. This is particularly useful for developers and businesses building on the DecentralChain blockchain, as it enables them to view and analyze deployed smart contracts, making it easier to identify bugs or potential vulnerabilities in the contract code.
es: Además de rastrear transacciones y nodos, el explorador de bloques también ofrece a los usuarios una vista detallada de la implementación del contrato inteligente en la cadena de bloques. Esto es particularmente útil para los desarrolladores y las empresas que se basan en la cadena de bloques DecentralChain, ya que les permite ver y analizar los contratos inteligentes implementados, lo que facilita la identificación de errores o posibles vulnerabilidades en el código del contrato.

source: Furthermore, the block explorer plays a vital role in ensuring the security of the DecentralChain ecosystem. By providing detailed information about transactions and nodes, it makes it easier for users to identify suspicious activity or potential security threats. The block explorer can also be used to track the movement of coins that have been stolen or lost, making it easier to recover them.
es: Además, el explorador de bloques juega un papel vital para garantizar la seguridad del ecosistema DecentralChain. Al proporcionar información detallada sobre transacciones y nodos, facilita a los usuarios identificar actividades sospechosas o posibles amenazas a la seguridad. El explorador de bloques también se puede utilizar para rastrear el movimiento de monedas robadas o perdidas, lo que facilita su recuperación.

source: CR Coin is a social currency proposed for Costa Rica, designed to provide a secure, efficient and environmentally-friendly medium of exchange for its citizens. The currency is built on the DecentralChain blockchain, a specialized platform for social currencies that ensures maximum security and scalability. It also incorporates carbon negative technology, which aims to minimize the environmental impact of blockchain-based transactions.
es: CR Coin es una moneda social propuesta para Costa Rica, diseñada para proporcionar un medio de intercambio seguro, eficiente y respetuoso con el medio ambiente para sus ciudadanos. La moneda se basa en la cadena de bloques DecentralChain, una plataforma especializada para monedas sociales que garantiza la máxima seguridad y escalabilidad. También incorpora tecnología de carbono negativo, cuyo objetivo es minimizar el impacto ambiental de las transacciones basadas en blockchain.

source: By introducing CR Coin, Costa Rica's economy can enjoy the advantages of blockchain technology, such as transparency, low transaction costs, and secure transactions. Currently, cash, bank transfers and online payment systems are the most commonly used methods for payments in Costa Rica, but these traditional forms of money and payment systems have limitations and vulnerabilities, including fraud and high costs.
es: Al introducir CR Coin, la economía de Costa Rica puede disfrutar de las ventajas de la tecnología blockchain, como la transparencia, los bajos costos de transacción y las transacciones seguras. Actualmente, el efectivo, las transferencias bancarias y los sistemas de pago en línea son los métodos de pago más utilizados en Costa Rica, pero estas formas tradicionales de dinero y sistemas de pago tienen limitaciones y vulnerabilidades, incluido el fraude y los altos costos.

source: The launch of CR Coin is planned to involve a comprehensive marketing strategy, the establishment of a network of merchants and exchanges that accept CR Coin, and measures to ensure the security, stability and reliability of the currency. It is hoped that the introduction of CR Coin will not only provide a new medium of exchange for citizens but also create new opportunities for businesses, entrepreneurs and investors. CR Coin aims to revolutionize the way payments are made in Costa Rica, promoting sustainable development and environmental conservation with the potential to contribute to the country's goal of becoming a carbon-neutral economy that could have significant benefits for Costa Rica and its citizens.
es: Se planea que el lanzamiento de CR Coin involucre una estrategia de marketing integral, el establecimiento de una red de comerciantes e intercambios que acepten CR Coin, y medidas para garantizar la seguridad, estabilidad y confiabilidad de la moneda. Se espera que la introducción de CR Coin no solo proporcione un nuevo medio de intercambio para los ciudadanos, sino que también cree nuevas oportunidades para empresas, empresarios e inversores. CR Coin tiene como objetivo revolucionar la forma en que se realizan los pagos en Costa Rica, promoviendo el desarrollo sostenible y la conservación del medio ambiente con el potencial de contribuir al objetivo del país de convertirse en una economía neutral en carbono que podría tener beneficios significativos para Costa Rica y sus ciudadanos.
