Repository: Decentral-America/docs
Catalog: docs/locales/*/LC_MESSAGES/02_decentralchain.po
Languages: es

source: See order binary format
es: Ver orden en formato binario

source: Deal price
es: Precio de oferta

source: Price for the amount asset (base currency) nominated in the price asset (quote currency).
es: Precio por el activo de cantidad (moneda base) nominado en el activo de precio (moneda de cotización).

source: Amount of the amount asset (base currency) that the buyer received from the seller.
es: Importe de la cantidad de activo (moneda base) que el comprador recibió del vendedor.

source: Buy matcher fee
es: Tarifa del emparejador para compra

source: Sell matcher fee
es: Tarifa del emparejador para venta

source: The fields :math:`1`, :math:`2`, :math:`3`, :math:`4.1`, :math:`4.2`, :math:`4.3`, :math:`5.1`, :math:`5.2`, :math:`5.3`, :math:`6`, :math:`6.6`, :math:`7`, :math:`8`, :math:`9`, :math:`10` and :math:`11` are the transaction body bytes.
es: Los campos :math:`1`, :math:`2`, :math:`3`, :math:`4.1`, :math:`4.2`, :math:`4.3`, :math:`5.1` , :matemáticas:`5.2`, :matemáticas:`5.3`, :matemáticas:`6`, :matemáticas:`6.6`, :matemáticas:`7`, :matemáticas:`8`, :matemáticas:`9`, :math:`10` y :math:`11` son los bytes del cuerpo de la transacción.

source: Transaction version 1 can accept orders of version 1 only.
es: La versión 1 de la transacción solo puede aceptar pedidos de la versión 1.

source: Exchange Transaction Binary Format Version 1
es: Formato Binario de Transacción para Intercambio Versión 1

source: The fields :math:`1`, :math:`2`, :math:`3`, :math:`4`, :math:`5`, :math:`6`, :math:`7`, :math:`8`, :math:`9`, :math:`10` and :math:`11` are the transaction body bytes.
es: Los campos :math:`1`, :math:`2`, :math:`3`, :math:`4`, :math:`5`, :math:`6`, :math:`7` , :math:`8`, :math:`9`, :math:`10` y :math:`11` son los bytes del cuerpo de la transacción.

source: Genesis Transaction Binary Format
es: Formato Binario de Transacción Génesis

source: Learn more about :ref:`genesis transaction <02_decentralchain/03_transaction:Genesis Transaction>`.
es: Obtenga más información sobre la :ref:`transacción génesis <02_decentralchain/03_transaction:Genesis Transaction>`.

source: Address of the recipient
es: Dirección del destinatario

source: Amount of :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` that will be transferred to the account
es: Cantidad de :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` que se transferirá a la cuenta

source: Invoke Script Transaction Binary Format
es: Formato Binario de Transacción para Invocar Scripts

source: Learn more about :ref:`invoke script transaction <02_decentralchain/03_transaction:Invoke Script Transaction>`.
es: Obtenga más información sobre la :ref:`transacción para asignar scripts de activos <02_decentralchain/03_transaction:Invoke Script Transaction>`.

source: Invoke Script Transaction Binary Format Version 2
es: Formato Binario de Transacción para Invocar Scripts Versión 2

source: dApp account public key hash (a component of an address, see the Address binary format article).
es: Hash de clave pública de la cuenta dApp (un componente de una dirección, consulte el artículo sobre el formato binario de la dirección).

source: dApp alias.
es: alias de dApp.

source: Function name and arguments. Binary format of function call is the same as in version 1.
es: Nombre de la función y argumentos. El formato binario de la llamada de función es el mismo que en la versión 1.

source: :math:`32` bytes for asset. :math:`0` for :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`.
es: :math:`32` bytes para activo. :math:`0` para :ref:`DecentralCoins <02_decentralchain/02_token(activo):DecentralCoin>`.

source: ID of token in payment.
es: ID del token en pago.

source: Amount of token in payment, specified in the atomic units.
es: Monto de token en pago, especificado en las unidades atómicas.

source: The maximum size of d_app + function_call + payments is :math:`5120` bytes.
es: El tamaño máximo de d_app + function_call + pagos es :math:`5120` bytes.

source: Invoke Script Transaction Binary Format Version 1
es: Formato Binario de Transacción para Invocar Scripts Versión 1

source: Value must be :math:`16`.
es: El valor debe ser :math:`16`.

source: Address or alias
es: Dirección o alias

source: See Address Binary Format, Alias Binary Format
es: Consulte Formato binario de dirección, Formato binario de alias

source: If the first byte of the field is :math:`1`, then it is followed by address. S in this case equals :math:`26`. If the first byte of the field is :math:`2`, then it is followed by alias. In this case :math:`8 <= S <= 34`.
es: Si el primer byte del campo es :math:`1`, le sigue la dirección. S en este caso es igual a :math:`26`. Si el primer byte del campo es :math:`2`, le sigue el alias. En este caso :math:`8 <= S <= 34`.

source: Function presence flag
es: Bandera de presencia de función

source: :math:`0` — the default function of the dApp is invoked. :math:`1` — function from the current transaction should be invoked in the dApp.
es: :math:`0` — se invoca la función predeterminada de la dApp. :math:`1` — La función de la transacción actual debe invocarse en la dApp.

source: Function call ID
es: ID de llamada de función

source: Constant. The value must be :math:`9`.
es: Constante. El valor debe ser :math:`9`.

source: Function type ID
es: ID de tipo de función

source: Constant. The value must be :math:`1`.
es: Constante. El valor debe ser :math:`1`.

source: Function name length
es: Longitud del nombre de la función

source: Function name
es: Nombre de la función

source: function
es: función

source: Up to :math:`255`
es: Hasta :math:`255`

source: Amount of arguments of the function
es: Cantidad de argumentos de la función

source: ID of argument 1 type
es: ID del tipo de argumento 1

source: :math:`0` — argument type is long. :math:`1` — argument type is an array of bytes. :math:`2` — argument type is a string. :math:`6` — argument type is logical True. :math:`7` — argument type is logical False. :math:`11` – argument type is list.
es: :math:`0` — el tipo de argumento es largo. :math:`1` — el tipo de argumento es una matriz de bytes. :math:`2` — el tipo de argumento es una cadena. :math:`6` — el tipo de argumento es lógico True. :math:`7` — el tipo de argumento es lógico Falso. :math:`11` – el tipo de argumento es lista.

source: Argument 1
es: Argumento 1

source: Options are: 1) :ref:`Long <02_decentralchain/09_protocol:Blockchain Data Types>`. 2) Array[:ref:`Byte <02_decentralchain/09_protocol:Blockchain Data Types>`]. 3) :ref:`String <02_decentralchain/09_protocol:Blockchain Data Types>`. 4) Logical True. 5) Logical False. 6) List.
es: Las opciones son: 1) :ref:`Long <02_decentralchain/09_protocol:Blockchain Data Types>`. 2) Array[:ref:`Byte <02_decentralchain/09_protocol:Blockchain Data Types>`]. 3) :ref:`String <02_decentralchain/09_protocol:Blockchain Data Types>`. 4) Verdadero Lógico . 5) Falso Lógico. 6) Lista.

source: :math:`S = 8`, if argument type is long. If the argument type is an array of bytes, string, or list, the field size is limited only by the total transaction size. If the type is list, then 1) its length must not exceed :math:`1000` elements. 2) amount of its elements represents first :math:`4` bytes of the current field. 3) each list element is serialized similarly to the function argument: the element type ID takes first place followed by the element's value. :math:`S = 0`, if argument type is logical True or False.
es: :math:`S = 8`, si el tipo de argumento es largo. Si el tipo de argumento es una matriz de bytes, una cadena o una lista, el tamaño del campo solo está limitado por el tamaño total de la transacción. Si el tipo es lista, entonces 1) su longitud no debe exceder :math:`1000` elementos. 2) la cantidad de sus elementos representa los primeros :math:`4` bytes del campo actual. 3) cada elemento de la lista se serializa de manera similar al argumento de la función: el ID del tipo de elemento ocupa el primer lugar, seguido del valor del elemento. :math:`S = 0`, si el tipo de argumento es lógico Verdadero o Falso.

source: ID of argument 2 type
es: ID del tipo de argumento 2

source: Argument 2
es: Argumento 2

source: ID of argument N type
es: ID del tipo de argumento N

source: 0 — argument type is long. 1 — argument type is an array of bytes. 2 — argument type is a string. 6 — argument type is logical True. 7 — argument type is logical False. 11 – argument type is list.
es: 0: el tipo de argumento es largo. 1: el tipo de argumento es una matriz de bytes. 2: el tipo de argumento es una cadena. 6 — el tipo de argumento es lógico Verdadero. 7 — el tipo de argumento es lógico Falso. 11 – el tipo de argumento es lista.

source: Argument N
es: Argumento N

source: Amount of payments
es: Cantidad de pagos

source: Payment 1 length
es: Pago 1 longitud

source: Amount of token in payment 1
es: Cantidad de token en pago 1

source: Flag of payment 1 token
es: Bandera de pago 1 token

source: :math:`0` — :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`. :math:`1` — other token.
es: :math:`0` — :ref:`DecentralCoins <02_decentralchain/02_token(activo):DecentralCoin>`. :math:`1` — otro token.

source: ID of payment 1 token
es: ID de token de pago 1

source: Field is applicable if the token is not :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`.
es: El campo es aplicable si el token no es :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`.

source: Payment N length
es: Pago N longitud

source: Amount of token in payment N
es: Cantidad de token en pago N

source: Flag of payment N token
es: Bandera de token de pago N

source: ID of payment N token
es: ID del token de pago N

source: Flag of fee token
es: Indicador de token de tarifa

source: Fee token ID
es: ID de token de tarifa

source: :math:`S = 0`, if token is :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`. :math:`S = 32`, if it is other token.
es: :math:`S = 0`, si el token es :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`. :math:`S = 32`, si es otro token.

source: The maximum number of payments is :math:`10`. The maximum size of transaction including proofs is :math:`5120` bytes.
es: El número máximo de pagos es :math:`10`. El tamaño máximo de transacción, incluidas las pruebas, es :math:`5120` bytes.

source: Issue Transaction Binary Format
es: Formato Binario de Transacción para Emisión

source: Learn more about :ref:`issue transaction <02_decentralchain/03_transaction:Issue Transaction>`.
es: Obtenga más información sobre la :ref:`transacción para emisión <02_decentralchain/03_transaction:Issue Transaction>`.

source: Issue Transaction Binary Format Version 3
es: Formato Binario de Transacción para Emisión Versión 3

source: From :math:`4` to :math:`16` bytes
es: De :math:`4` a :math:`16` bytes

source: Token name.
es: Nombre del token.

source: From :math:`0` to :math:`1000` bytes
es: De :math:`0` a :math:`1000` bytes

source: Token description.
es: Descripción del token.

source: Amount of token to issue, specified in the minimum fraction (“cents”).
es: Cantidad de token a emitir, especificada en la fracción mínima (“centavos”).

source: Number of decimal places.
es: Número de lugares decimales.

source: Up to :math:`8192` bytes
es: Hasta :math:`8192` bytes

source: :ref:`Asset script <03_ride-language/04_script-types:Asset Script>`.
es: :ref:`Script de activo <03_ride-language/04_script-types:Asset Script>`.

source: Issue Transaction Binary Format Version 2
es: Formato Binario de Transacción para Emisión Versión 2

source: Value must be :math:`3`.
es: El valor debe ser :math:`3`.

source: :ref:`Token <02_decentralchain/02_token(asset):Token (Asset)>` name length
es: Longitud de nombre del :ref:`Token <02_decentralchain/02_token(activo):Token (Activo)>`

source: Token name
es: Nombre del Activo

source: From :math:`4` to :math:`16`
es: De :math:`4` a :math:`16`

source: Token description length
es: Longitud de la descripción del token

source: Token description
es: Descripción del activo

source: From :math:`0` to :math:`1000`
es: De :math:`0` a :math:`1000`

source: Amount of the token that will be issued
es: Importe del token que se emitirá

source: Number of decimal places of the token
es: Número de decimales del token

source: Reissue flag
es: Bandera de reemisión

source: If the value is :math:`0`, then token reissue is not possible. If the value is :math:`1`, then token reissue is possible.
es: Si el valor es :math:`0`, no es posible volver a emitir el token. Si el valor es :math:`1`, es posible volver a emitir el token.

source: Script existence flag
es: Bandera de existencia de secuencia de comandos

source: If the value is :math:`0`, then the token does not have a script. If the value is :math:`1`, then the token has a script.
es: Si el valor es :math:`0`, entonces el token no tiene un script. Si el valor es :math:`1`, entonces el token tiene un script.

source: Script length in bytes
es: Longitud del script en bytes

source: :math:`S = 0` if the value of the script existence flag field is :math:`0`. :math:`S = 2` if the value of the script existence flag field is 1.
es: :math:`S = 0` si el valor del campo indicador de existencia del script es :math:`0`. :math:`S = 2` si el valor del campo indicador de existencia del script es 1.

source: :ref:`Asset script <03_ride-language/04_script-types:Asset Script>`
es: :ref:`Script de activo <03_ride-language/04_script-types:Asset Script>`

source: :math:`S = 0` if the value of the script existence flag field is :math:`0`. :math:`0 < S ≤ 8192`, if the value of the script existence flag field is 1.
es: :math:`S = 0` si el valor del campo indicador de existencia del script es :math:`0`. :math:`0 < S ≤ 8192`, si el valor del campo indicador de existencia del script es 1.

source: If the array is empty, then :math:`S = 3`. If the array is not empty, then :math:`S = 3 + 2 × N + 64 × N`, where :math:`N` is the number of proofs in the array. The maximum number of proofs in the array is :math:`82`. The size of each proof is :math:`64` bytes.
es: Si la matriz está vacía, entonces :math:`S = 3`. Si la matriz no está vacía, entonces :math:`S = 3 + 2 × N + 64 × N`, donde :math:`N` es el número de pruebas en la matriz. El número máximo de pruebas en la matriz es :math:`82`. El tamaño de cada prueba es :math:`64` bytes.

source: The fields :math:`2`, :math:`3`, :math:`4`, :math:`5`, :math:`6.1`, :math:`6.2`, :math:`7.1`, :math:`7.2`, :math:`8`, :math:`9`, :math:`10`, :math:`11`, :math:`12`, :math:`13.1`, :math:`13.2` and :math:`13.3` are the transaction body bytes.
es: Los campos :math:`2`, :math:`3`, :math:`4`, :math:`5`, :math:`6.1`, :math:`6.2`, :math:`7.1` , :matemáticas:`7.2`, :matemáticas:`8`, :matemáticas:`9`, :matemáticas:`10`, :matemáticas:`11`, :matemáticas:`12`, :matemáticas:`13.1`, :math:`13.2` y :math:`13.3` son los bytes del cuerpo de la transacción.

source: Issue Transaction Binary Format Version 1
es: Formato Binario de Transacción para Emisión Versión 1

source: This field duplicates field 1.
es: Este campo duplica el campo 1.

source: The fields :math:`3`, :math:`4`, :math:`5.1`, :math:`5.2`, :math:`6.1`, :math:`6.2`, :math:`7`, :math:`8`, :math:`9`, :math:`10` and :math:`11` are the transaction body bytes.
es: Los campos :math:`3`, :math:`4`, :math:`5.1`, :math:`5.2`, :math:`6.1`, :math:`6.2`, :math:`7` , :math:`8`, :math:`9`, :math:`10` y :math:`11` son los bytes del cuerpo de la transacción.

source: Lease Cancel Transaction Binary Format
es: Formato Binario de Transacción para Cancelar Arrendamiento

source: Learn more about :ref:`lease cancel transaction <02_decentralchain/03_transaction:Lease Cancel Transaction>`
es: Obtenga más información sobre la :ref:`transacción para cancelar arrendamiento <02_decentralchain/03_transaction:Lease Cancel Transaction>`

source: Lease Cancel Transaction Binary Format Version 3
es: Formato Binario de Transacción para Cancelar Arrendamiento Versión 3

source: Lease ID.
es: Identificación de Arrendamiento.

source: Lease Cancel Transaction Binary Format Version 2
es: Formato Binario de Transacción para Cancelar Arrendamiento Versión 2

source: Value must be :math:`9`.
es: El valor debe ser :math:`9`.

source: Lease ID
es: ID de Arrendamiento

source: The fields :math:`2`, :math:`3`, :math:`4`, :math:`5`, :math:`6`, :math:`7`, and :math:`8` are the transaction body bytes.
es: Los campos :math:`2`, :math:`3`, :math:`4`, :math:`5`, :math:`6`, :math:`7` y :math:`8 ` son los bytes del cuerpo de la transacción.

source: Lease Cancel Transaction Binary Format Version 1
es: Formato Binario de Transacción para Cancelar Arrendamiento Versión 1

source: The fields :math:`1`, :math:`2`, :math:`3`, :math:`4`, and :math:`5` are the transaction body bytes.
es: Los campos :math:`1`, :math:`2`, :math:`3`, :math:`4` y :math:`5` son los bytes del cuerpo de la transacción.

source: Lease Transaction Binary Format
es: Formato Binario de Transacción para Arrendamiento

source: Learn more about :ref:`lease transaction <02_decentralchain/03_transaction:Lease Transaction>`.
es: Obtenga más información sobre la :ref:`transacción para arrendamiento <02_decentralchain/03_transaction:Lease Transaction>`.

source: Lease Transaction Binary Format Version 3
es: Formato Binario de Transacción para Arrendamiento Versión 3

source: Recipient's account public key hash (a component of an :ref:`address <02_decentralchain/01_account:Address>`, see the :ref:`address binary format <02_decentralchain/10_binary-format:Address Binary Format>` article).
es: Hash de clave pública de la cuenta del destinatario (un componente de una :ref:`dirección <02_decentralchain/01_account:Address>`, consulte el :ref:`formato binario de dirección <02_decentralchain/10_binary-format:Address Binary Format>`).

source: Recipient's :ref:`alias <02_decentralchain/01_account:Alias>`.
es: :ref:`Alias <02_decentralchain/01_account:Alias>` del destinatario.

source: Amount of :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` to lease (that is, amount of Decentralites multiplied by :math:`10^{8}`).
es: Cantidad de :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` para arrendar (es decir, la cantidad de Decentralitos multiplicada por :math:`10^{8}`).

source: Lease Transaction Binary Format Version 2
es: Formato Binario de Transacción para Arrendamiento Versión 2

source: Value must be :math:`8`.
es: El valor debe ser :math:`8`.

source: Reserved field
es: Campo reservado

source: Value must be equal to :math:`0`.
es: El valor debe ser igual a :math:`0`.

source: :ref:`address <02_decentralchain/01_account:Address>` or :ref:`alias <02_decentralchain/01_account:Alias>` of the recipient
es: :ref:`dirección <02_decentralchain/01_account:Address>` o :ref:`alias <02_decentralchain/01_account:Alias>` del destinatario

source: See :ref:`address binary format <02_decentralchain/10_binary-format:Address Binary Format>`, :ref:`alias binary format <02_decentralchain/10_binary-format:Alias Binary Format>`
es: Consulte :ref:`formato binario de dirección <02_decentralchain/10_binary-format:Address Binary Format>`, :ref:`formato binario del alias <02_decentralchain/10_binary-format:Alias Binary Format>`

source: Amount of :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` that will be leased to the account
es: Cantidad de :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` que se arrendarán a la cuenta

source: Lease Transaction Binary Format Version 1
es: Formato Binario de Transacción para Arrendamiento Versión 1

source: Mass Transfer Transaction Binary Format
es: Formato Binario de Transacción para Transferencia Masiva

source: Learn more about :ref:`mass transfer transaction <02_decentralchain/03_transaction:Mass Transfer Transaction>`.
es: Obtenga más información sobre la :ref:`transacción para transferencia masiva <02_decentralchain/03_transaction:Mass Transfer Transaction>`.

source: Mass Transaction Binary Format Version 2
es: Formato Binario de Transacción para Transferencia Masiva Versión 2

source: ID of token to transfer.
es: ID del token a transferir.

source: Recipient's account public key hash (a component of an address, see the :ref:`address binary format <02_decentralchain/10_binary-format:Address Binary Format>` article).
es: Hash de clave pública de la cuenta del destinatario (un componente de una dirección, consulte el :ref:`formato binario de dirección <02_decentralchain/10_binary-format:Address Binary Format>`).

source: Amount of token to transfer, specified in the minimum fraction (“cents”).
es: Cantidad de token a transferir, especificada en la fracción mínima (“centavos”).

source: Up to :math:`140` bytes
es: Hasta :math:`140` bytes

source: Arbitrary data (typically a comment to transfer).
es: Datos arbitrarios (típicamente un comentario para transferir).

source: The maximim number of transfers is :math:`100`.
es: El número máximo de transferencias es :math:`100`.

source: Mass Transaction Binary Format Version 1
es: Formato Binario de Transacción para Transferencia Masiva Versión 1

source: Value must be :math:`11`.
es: El valor debe ser :math:`11`.

source: Flag DecentralCoins/token
es: Marcar DecentralCoins/token

source: Value is :math:`0` for transferring DecentralCoins. Value is :math:`1` for transferring other tokens.
es: El valor es :math:`0` para transferir DecentralCoins. El valor es :math:`1` para transferir otros tokens.

source: :math:`S = 0` if the value of the flag DecentralCoins/token field is :math:`0`. :math:`S = 32` if the value of the flag DecentralCoins/token field is :math:`1`.
es: :math:`S = 0` si el valor de la bandera DecentralCoins/token field es :math:`0`. :math:`S = 32` si el valor de la bandera DecentralCoins/token field es :math:`1`.

source: Number of transfers
es: Número de transferencias

source: Amount of tokens in the transfer 1
es: Cantidad de tokens en la transferencia 1

source: Address or alias of the recipient
es: Dirección o alias del destinatario

source: Amount of tokens in the transfer 2
es: Cantidad de tokens en la transferencia 2

source: Amount of tokens in the transferN
es: Cantidad de tokens en la transferenciaN

source: Attachment length
es: Longitud del archivo adjunto

source: Attachment
es: Adjunto

source: Arbitrary data attached to the transaction.
es: Datos arbitrarios adjuntos a la transacción.

source: The fields :math:`1`, :math:`2`, :math:`3`, :math:`4.1`, :math:`4.2`, :math:`5.1`, :math:`5.2`, :math:`5.3`, :math:`5.4`, :math:`5.5`, :math:`5.[2 × N]`, :math:`5.[2 × N + 1]`, :math:`6`, :math:`7`, :math:`8.1` and :math:`8.2` are the transaction body bytes.
es: Los campos :math:`1`, :math:`2`, :math:`3`, :math:`4.1`, :math:`4.2`, :math:`5.1`, :math:`5.2` , :math:`5.3`, :math:`5.4`, :math:`5.5`, :math:`5.[2 × N]`, :math:`5.[2 × N + 1]`, :math:`6`, :math:`7`, :math:`8.1` y :math:`8.2` son los bytes del cuerpo de la transacción.

source: Reissue Transaction Binary Format
es: Formato Binario de Transacción para Reemisión Versión 3

source: Learn more about :ref:`reissue transaction <02_decentralchain/03_transaction:Reissue Transaction>`.
es: Obtenga más información sobre la :ref:`transacción para reemisión <02_decentralchain/03_transaction:Reissue Transaction>`.

source: Reissue Transaction Binary Format Version 3
es: Formato Binario de Transacción para Reemisión Versión 3

source: ID of token to reissue.
es: ID del token para volver a emitir.

source: Amount of token to reissue, specified in the minimum fraction (“cents”).
es: Cantidad de token a reemitir, especificada en la fracción mínima (“centavos”).

source: Reissue Transaction Binary Format Version 2
es: Formato Binario de Transacción para Reemisión Versión 2
