Repository: Decentral-America/docs
Catalog: docs/locales/*/LC_MESSAGES/02_decentralchain.po
Languages: es

source: Indicates the transaction version is 2 or higher. Value must be :math:`0`.
es: Indica que la versión de la transacción es 2 o superior. El valor debe ser :math:`0`.

source: Value must be :math:`5`.
es: El valor debe ser :math:`5`.

source: Amount of token that will be reissued
es: Cantidad de token que se volverá a emitir

source: The fields :math:`2`, :math:`3`, :math:`4`, :math:`5`, :math:`6`, :math:`7`, :math:`8`, :math:`9` and :math:`10` are the transaction body bytes.
es: Los campos :math:`2`, :math:`3`, :math:`4`, :math:`5`, :math:`6`, :math:`7`, :math:`8` , :math:`9` y :math:`10` son los bytes del cuerpo de la transacción.

source: Reissue Transaction Binary Format Version 1
es: Formato Binario de Transacción para Reemisión Versión 1

source: This field duplicates field :math:`1`.
es: Este campo duplica el campo :math:`1`.

source: The fields :math:`3`, :math:`4`, :math:`5`, :math:`6`, :math:`7`, :math:`8` and :math:`9` are the transaction body bytes.
es: Los campos :math:`3`, :math:`4`, :math:`5`, :math:`6`, :math:`7`, :math:`8` y :math:`9` son los bytes del cuerpo de la transacción.

source: Set Asset Script Transaction Binary Format
es: Formato Binario de Transacción para Asignar Scripts de Activos

source: Learn more about :ref:`set asset script transaction <02_decentralchain/03_transaction:Set Asset Script Transaction>`.
es: Obtenga más información sobre la :ref:`transacción para asignar scripts de activos <02_decentralchain/03_transaction:Set Asset Script Transaction>`.

source: Set Asset Script Transaction Binary Format Version 2
es: Formato Binario de Transacción para Asignar Scripts de Activos Versión 2

source: ID of asset.
es: ID del activo.

source: Set Asset Script Transaction Binary Format Version 1
es: Formato Binario de Transacción para Asignar Scripts de Activos Versión 1

source: Value must be :math:`15`.
es: El valor debe ser :math:`15`.

source: Token ID to which the asset script is attached
es: ID de token al que se adjunta el script de activo

source: Script size in bytes
es: Tamaño del script en bytes

source: :math:`S = 0` if the value of the script existence flag field is :math:`0`. :math:`S = 2` if the value of the script existence flag field is :math:`1`.
es: :math:`S = 0` si el valor del campo indicador de existencia del script es :math:`0`. :math:`S = 2` si el valor del campo indicador de existencia del script es :math:`1`.

source: :math:`S = 0` if the value of the script existence flag field is :math:`0`. :math:`0 < S ≤ 8192`, if the value of the script existence flag field is :math:`1`.
es: :math:`S = 0` si el valor del campo indicador de existencia del script es :math:`0`. :math:`0 < S ≤ 8192`, si el valor del campo indicador de existencia del script es :math:`1`.

source: The fields :math:`2`, :math:`3`, :math:`4`, :math:`5`, :math:`6`, :math:`7`, :math:`8`, :math:`9.1`, :math:`9.2` and :math:`9.3` are the transaction body bytes.
es: Los campos :math:`2`, :math:`3`, :math:`4`, :math:`5`, :math:`6`, :math:`7`, :math:`8` , :math:`9.1`, :math:`9.2` y :math:`9.3` son los bytes del cuerpo de la transacción.

source: Set Script Transaction Binary Format
es: Formato Binario de Transacción para Asignar Scripts

source: Learn more about :ref:`set script transaction <02_decentralchain/03_transaction:Set Script Transaction>`.
es: Obtenga más información sobre la :ref:`transacción para asignar scripts <02_decentralchain/03_transaction:Set Script Transaction>`.

source: Set Script Transaction Binary Format Version 2
es: Formato Binario de Transacción para Asignar Scripts Versión 2

source: Up to :math:`32,768` bytes
es: Hasta :math:`32,768` bytes

source: :ref:`Account script <03_ride-language/04_script-types:Account Script>` or :ref:`dApp script <03_ride-language/04_script-types:dApp Script>`.
es: :ref:`Script de cuenta <03_ride-language/04_script-types:Account Script>` or :ref:`script de dApp <03_ride-language/04_script-types:dApp Script>`.

source: Set Script Transaction Binary Format Version 1
es: Formato Binario de Transacción para Asignar Scripts Versión 1

source: Value must be :math:`13`.
es: El valor debe ser :math:`13`.

source: If the value is :math:`0`, then the token does not have a script. If the value is :math:`1,` then the token has a script.
es: Si el valor es :math:`0`, entonces el token no tiene un script. Si el valor es :math:`1,` entonces el token tiene un script.

source: Script length
es: Longitud del script

source: :math:`S = 0` if the value of the script existence flag field is :math:`0`. :math:`0 < S ≤ 32,768`, if the value of the script existence flag field is :math:`1`.
es: :math:`S = 0` si el valor del campo indicador de existencia del script es :math:`0`. :math:`0 < S ≤ 32,768`, si el valor del campo de indicador de existencia del script es :math:`1`.

source: Sponsor Fee Transaction Binary Format
es: Formato Binario de Transacción para Patrocinar Tarifas

source: Learn more about :ref:`sponsor fee transaction <02_decentralchain/03_transaction:Sponsor Fee Transaction>`.
es: Obtenga más información sobre la :ref:`transacción para patrocinar tarifas <02_decentralchain/03_transaction:Sponsor Fee Transaction>`.

source: Sponsor Fee Transaction Binary Format Version 2
es: Formato Binario de Transacción para Patrocinar Tarifas Versión 2

source: Amount of asset that is equivalent to :math:`0.001` DecentralCoins (:math:`100 000` Decentralites), specified in the minimum fraction (“cents”) of asset. See the :ref:`sponsored fee <02_decentralchain/03_transaction:Sponsored Fees>` article.
es: Cantidad de activo que es equivalente a :math:`0.001` DecentralCoins (:math:`100 000` Decentralitos), especificado en la fracción mínima ("centavos") de activo. Consulte el artículo :ref:`tarifa patrocinada <02_decentralchain/03_transaction:Sponsored Fees>`.

source: Sponsor Fee Transaction Binary Format Version 1
es: Formato Binario de Transacción para Patrocinar Tarifas Versión 1

source: Value must be :math:`14`.
es: El valor debe ser :math:`14`.

source: This field duplicates field :math:`2`.
es: Este campo duplica el campo :math:`2`.

source: This field duplicates field :math:`3`.
es: Este campo duplica el campo :math:`3`.

source: Minimal sponsored asset fee
es: Tarifa mínima de activos patrocinados

source: Amount of sponsored asset that is equivalent to :math:`0.001` DecentralCoins (:math:`100,000` Decentralites).
es: Cantidad de activo patrocinado que equivale a :math:`0.001` DecentralCoins (:math:`100,000` Decentralitos).

source: The fields :math:`4`, :math:`5`, :math:`6`, :math:`7`, :math:`8`, :math:`9` and :math:`10` are the transaction body bytes.
es: Los campos :math:`4`, :math:`5`, :math:`6`, :math:`7`, :math:`8`, :math:`9` y :math:`10` son los bytes del cuerpo de la transacción.

source: Transfer Transaction Binary Format
es: Formato Binario de Transacción para Transferencia

source: Learn more about :ref:`transfer transaction <02_decentralchain/03_transaction:Transfer Transaction>`.
es: Obtenga más información sobre la :ref:`transacción para transferencia <02_decentralchain/03_transaction:Exchange Transaction>`.

source: Transfer Transaction Binary Format Version 3
es: Formato Binario de Transacción para Transferencia Versión 3

source: Transfer Transaction Binary Format Version 2
es: Formato Binario de Transacción para Transferencia Versión 2

source: Value must be :math:`4`.
es: El valor debe ser :math:`4`.

source: Transferring token type flag
es: Transfiriendo marca de tipo de token

source: Value is :math:`0` for transferring DecentralCoins. Value is :math:`1` for transferring other token.
es: El valor es :math:`0` para transferir DecentralCoins. El valor es :math:`1` para transferir otro token.

source: Transferring token ID
es: Transfiriendo ID de token

source: math:`S = 0` if the value of the flag 5.1 is :math:`0`. :math:`S = 32` if the value of the flag 5.1 is :math:`1`.
es: math:`S = 0` si el valor de la bandera 5.1 es :math:`0`. :math:`S = 32` si el valor de la bandera 5.1 es :math:`1`.

source: Fee token type flag
es: Indicador de tipo de token de tarifa

source: Value is 0 for fee in DecentralCoins. Value is :math:`1` for fee in other token.
es: El valor es 0 para la tarifa en DecentralCoins. El valor es :math:`1` para la tarifa en otro token.

source: Token to pay the fee. :math:`S = 0` if the value of the flag 6.1 is :math:`0`. :math:`S = 32` if the value of the flag 6.1 field is :math:`1`.
es: Ficha para pagar la cuota. :math:`S = 0` si el valor de la bandera 6.1 es :math:`0`. :math:`S = 32` si el valor del campo indicador 6.1 es :math:`1`.

source: Amount of token in the transfer
es: Cantidad de token en la transferencia

source: If the first byte of the field is :math:`1`, then it is followed by address. S in this case equals :math:`26`. If the first byte of the field is :math:`2`, then it is followed by alias. In this case :math:`8 <= S <= 34`
es: Si el primer byte del campo es :math:`1`, le sigue la dirección. S en este caso es igual a :math:`26`. Si el primer byte del campo es :math:`2`, le sigue el alias. En este caso :math:`8 <= S <= 34`

source: If the array is empty, then :math:`S = 3`. If the array is not empty, then :math:`S = 3 + 2 × N + 64 × N`, where N is the number of proofs in the array. The maximum number of proofs in the array is :math:`8`. The size of each proof is :math:`64` bytes.
es: Si la matriz está vacía, entonces :math:`S = 3`. Si la matriz no está vacía, entonces :math:`S = 3 + 2 × N + 64 × N`, donde N es el número de pruebas en la matriz. El número máximo de pruebas en la matriz es :math:`8`. El tamaño de cada prueba es :math:`64` bytes.

source: Transfer Transaction Binary Format Version 1
es: Formato Binario de Transacción para Transferencia Versión 2

source: Value is :math:`0` for transferring DecentralCoins. Value is 1 for transferring other token.
es: El valor es :math:`0` para transferir DecentralCoins. El valor es 1 para transferir otro token.

source: :math:`S = 0` if the value of the flag 5.1 is :math:`0`. :math:`S = 32` if the value of the flag 5.1 is :math:`1`.
es: :math:`S = 0` si el valor de la bandera 5.1 es :math:`0`. :math:`S = 32` si el valor de la bandera 5.1 es :math:`1`.

source: Value is :math:`0` for fee in DecentralCoins. Value is :math:`1` for fee in other token.
es: El valor es :math:`0` para la tarifa en DecentralCoins. El valor es :math:`1` para la tarifa en otro token.

source: Token to pay the fee. :math:`S = 0` if the value of the flag 6.1 is 0. :math:`S = 32` if the value of the flag 6.1 field is :math:`1`.
es: Ficha para pagar la cuota. :math:`S = 0` si el valor de la bandera 6.1 es 0. :math:`S = 32` si el valor del campo de la bandera 6.1 es :math:`1`.

source: Up to :math:`140` bytes.
es: Hasta :math:`140` bytes.

source: Update Asset Info Transaction Binary Format
es: Formato Binario de Transacción para Actualizar Información de Activos

source: Learn more about :ref:`update asset info transaction <02_decentralchain/03_transaction:Update Asset Info Transaction>`.
es: Obtenga más información sobre la :ref:`transacción para actualizar información de activos <02_decentralchain/03_transaction:Update Asset Info Transaction>`.

source: Update Asset Info Transaction Binary Format Version 1
es: Formato Binario de Transacción para Actualizar Información de Activos Versión 1

source: Token ID.
es: Identificación de Token.

source: Transaction Proofs Binary Format
es: Formato Binario de Pruebas de Transacciones

source: Size in bytes
es: Tamaño en bytes

source: Proofs version
es: Versión de Pruebas

source: Value is 1.
es: El valor es 1.

source: Proofs count
es: Contador de pruebas

source: Proof 1 length
es: Prueba 1 longitud

source: Value is 64.
es: El valor es 64.

source: Proofs 1
es: Pruebas 1

source: Proof 2 length
es: Prueba 2 longitud

source: Proof 2
es: Prueba 2

source: The maximum number of proofs is :math:`8`.
es: El número máximo de demostraciones es :math:`8`.

source: DecentralChain is an open blockchain protocol and development toolset for Web 3.0 applications and decentralized solutions.
es: DecentralChain es un protocolo abierto de cadena de bloques y un conjunto de herramientas de desarrollo para aplicaciones Web 3.0 y soluciones descentralizadas.
