Repository: Decentral-America/docs
Catalog: docs/locales/*/LC_MESSAGES/02_decentralchain.po
Languages: es

source: :ref:`Burn transaction binary format <02_decentralchain/10_binary-format:Burn Transaction Binary Format>`
es: :ref:`Formato binario de transacción para quemado <02_decentralchain/10_binary-format:Burn Transaction Binary Format>`

source: :ref:`Create alias transaction binary format <02_decentralchain/10_binary-format:Create Alias Transaction Binary Format>`
es: :ref:`Formato binario de transacción para crear alias <02_decentralchain/10_binary-format:Create Alias Transaction Binary Format>`

source: :ref:`Data transaction binary format <02_decentralchain/10_binary-format:Data Transaction Binary Format>`
es: :ref:`Formato binario de transacción para datos <02_decentralchain/10_binary-format:Data Transaction Binary Format>`

source: :ref:`Exchange transaction binary format <02_decentralchain/10_binary-format:Exchange Transaction Binary Format>`
es: :ref:`Formato binario de transacción para intercambio <02_decentralchain/10_binary-format:Exchange Transaction Binary Format>`

source: :ref:`Genesis transaction binary format <02_decentralchain/10_binary-format:Genesis Transaction Binary Format>`
es: :ref:`Formato binario de transacción génesis <02_decentralchain/10_binary-format:Genesis Transaction Binary Format>`

source: :ref:`Invoke script transaction binary format <02_decentralchain/10_binary-format:Invoke Script Transaction Binary Format>`
es: :ref:`Formato binario de transacción para invocar scripts <02_decentralchain/10_binary-format:Invoke Script Transaction Binary Format>`

source: :ref:`Issue transaction binary format <02_decentralchain/10_binary-format:Issue Transaction Binary Format>`
es: :ref:`Formato binario de transacción para emisión <02_decentralchain/10_binary-format:Issue Transaction Binary Format>`

source: :ref:`Lease cancel transaction binary format <02_decentralchain/10_binary-format:Lease Cancel Transaction Binary Format>`
es: :ref:`Formato binario de transacción para cancelar arrendamiento <02_decentralchain/10_binary-format:Lease Cancel Transaction Binary Format>`

source: :ref:`Lease transaction binary format <02_decentralchain/10_binary-format:Lease Transaction Binary Format>`
es: :ref:`Formato binario de transacción para arrendamiento <02_decentralchain/10_binary-format:Lease Transaction Binary Format>`

source: :ref:`Mass transfer transaction binary format <02_decentralchain/10_binary-format:Mass Transfer Transaction Binary Format>`
es: :ref:`Formato binario de transacción para transferencia masiva <02_decentralchain/10_binary-format:Mass Transfer Transaction Binary Format>`

source: :ref:`Reissue transaction binary format <02_decentralchain/10_binary-format:Reissue Transaction Binary Format>`
es: :ref:`Formato binario de transacción para reemisión <02_decentralchain/10_binary-format:Reissue Transaction Binary Format>`

source: :ref:`Set asset script transaction binary format <02_decentralchain/10_binary-format:Set Asset Script Transaction Binary Format>`
es: :ref:`Formato binario de transacción para asignar scripts de activos <02_decentralchain/10_binary-format:Set Asset Script Transaction Binary Format>`

source: :ref:`Set script transaction binary format <02_decentralchain/10_binary-format:Set Script Transaction Binary Format>`
es: :ref:`Formato binario de transacción para asignar scripts <02_decentralchain/10_binary-format:Set Script Transaction Binary Format>`

source: :ref:`Sponsor fee transaction binary format <02_decentralchain/10_binary-format:Sponsor Fee Transaction Binary Format>`
es: :ref:`Formato binario de transacción para patrocinar tarifas <02_decentralchain/10_binary-format:Sponsor Fee Transaction Binary Format>`

source: :ref:`Transfer transaction binary format <02_decentralchain/10_binary-format:Transfer Transaction Binary Format>`
es: :ref:`Formato binario de transacción para transferencia <02_decentralchain/10_binary-format:Transfer Transaction Binary Format>`

source: :ref:`Transaction proofs binary format <02_decentralchain/10_binary-format:Transaction Proofs Binary Format>`
es: :ref:`Formato binario de pruebas de transacción <02_decentralchain/10_binary-format:Transaction Proofs Binary Format>`

source: Address Binary Format
es: Formato Binario de Dirección

source: Learn more about :ref:`address <02_decentralchain/01_account:Address>`.
es: Obtenga más información sobre las :ref:`direcciones <02_decentralchain/01_account:Address>`.

source: Field order number
es: Número de orden de campo

source: Field type
es: Tipo de campo

source: Field size in bytes
es: Tamaño del campo en bytes

source: Comments
es: Comentarios

source: Entity type
es: Tipo de entidad

source: Value must be :math:`1`.
es: El valor debe ser :math:`1`.

source: :math:`87` — for Mainnet. :math:`84` — for Testnet. :math:`83` — for Stagenet.
es: :math:`87` — para Mainnet. :math:`84` — para Testnet. :math:`83` — para Stagenet.

source: Account public key hash
es: Hash de llave pública de cuenta

source: First :math:`20` bytes of the result of the Keccak256 (Blake2b256 (publicKey)) hashing function. Here publicKey is the array of bytes of the account public key.
es: Primeros :math:`20` bytes del resultado de la función hash Keccak256 (Blake2b256 (publicKey)). Aquí publicKey es la matriz de bytes de la clave pública de la cuenta.

source: Checksum
es: Suma de Verificación

source: First :math:`4` bytes of the result of the Keccak256 (Blake2b256 (data)) hashing function. Here data is the array of bytes of three fields put together: 1) Entity type. 2) Chain ID. 3) Account public key hash.
es: Primero :math:`4` bytes del resultado de la función hash Keccak256 (Blake2b256 (datos)). Aquí data es la matriz de bytes de tres campos juntos: 1) Tipo de entidad. 2) Identificación de la cadena. 3) Hash de clave pública de la cuenta.

source: Alias Binary Format
es: Formato Binario del Alias

source: Learn more about :ref:`alias <02_decentralchain/01_account:Alias>`.
es: Obtenga más información sobre los :ref:`alias <02_decentralchain/01_account:Alias>`.

source: Value must be :math:`2`.
es: El valor debe ser :math:`2`.

source: Number of characters in the alias
es: Número de caracteres en el alias

source: From :math:`4` to :math:`30`.
es: De :math:`4` a :math:`30`.

source: Block Binary Format
es: Formato Binario del Bloque

source: Learn more about :ref:`block <02_decentralchain/04_block:Block>`.
es: Obtenga más información sobre los :ref:`bloques <02_decentralchain/04_block:Block>`.

source: Blocks are stored on the blockchain in a binary format (byte representation). :ref:`Node extensions <documentation:placeholder>` such as :ref:`gRPC server <documentation:placeholder>` can work directly with data in binary format.
es: Los bloques se almacenan en la cadena de bloques en formato binario (representación de bytes). :ref:`Las extensiones de nodo <documentation:placeholder>` como :ref:`servidor gRPC <documentation:placeholder>` pueden trabajar directamente con datos en formato binario.

source: :strong:`Version 5`
es: :strong:`Versión 5`

source: Block Binary Format Version 5
es: Formato Binario del Bloque Versión 5

source: BLAKE2b-256 hash of the previous block header.
es: BLAKE2b-256 hash del encabezado del bloque anterior.

source: :ref:`Base target <02_decentralchain/04_block:Base Target>`: а variable that is used in the block generation algorithm.
es: :ref:`Objetivo base <02_decentralchain/04_block:Base Target>`: una variable que se utiliza en el algoritmo de generación de bloques.

source: ":ref:`Generation signature <02_decentralchain/04_block:Block Generation>`: а variable that is used in the block generation algorithm (:math:`32` bytes)."
es: ":ref:`Generation signature <02_decentralchain/04_block:Block Generation>`: una variable que se utiliza en el algoritmo de generación de bloques (:math:`32` bytes)."

source: List of features for which the block generator votes. See the :ref:`features <documentation:placeholder>`.
es: Lista de funciones por las que vota el generador de bloques. Consulte las :ref:`características <documentation:placeholder>`.

source: :ref:`Block timestamp <02_decentralchain/04_block:Block Timestamp>`: Unix time in milliseconds.
es: :ref:`Marca de tiempo del bloque <02_decentralchain/04_block:Block Timestamp>`: Tiempo Unix en milisegundos.

source: Block version: :math:`5`.
es: Versión de bloque: :math:`5`.

source: :ref:`Block generation reward <02_decentralchain/05_node:Block Reward>` for which the block generator votes. :math:`-1` means that block generator votes for the current reward size.
es: :ref:`Recompensa de generación de bloques <02_decentralchain/05_node:Block Reward>` por la que vota el generador de bloques. :math:`-1` significa que el generador de bloques vota por el tamaño de recompensa actual.

source: :ref:`Transactions Root Hash <02_decentralchain/04_block:Transactions Root Hash>` (:math:`32` bytes).
es: :ref:`Hash raíz de transacciones <02_decentralchain/04_block:Transactions Root Hash>` (:math:`32` bytes).

source: :ref:`Block header signature <02_decentralchain/04_block:Block Signature>` (:math:`64` bytes).
es: :ref:`Firma del encabezado del bloque <02_decentralchain/04_block:Block Signature>` (:math:`64` bytes).

source: For each transaction: 1) Body bytes: up to :math:`165,487` bytes. 2) Proofs: up to :math:`531` bytes. See the :ref:`transaction binary format <02_decentralchain/10_binary-format:Transaction Binary Format>` article for details.
es: Para cada transacción: 1) Bytes del cuerpo: hasta :math:`165,487` bytes. 2) Pruebas: hasta :math:`531` bytes. Consulte el artículo sobre el :ref:`formato binario de transacción <02_decentralchain/10_binary-format:Transaction Binary Format>` para obtener más detalles.

source: :strong:`Version 4`
es: :strong:`Versión 4`

source: Block Binary Format Version 4
es: Formato Binario del Bloque Versión 4

source: Block version
es: Versión de bloque

source: The value must be :math:`4`.
es: El valor debe ser :math:`4`.

source: :ref:`Block timestamp <02_decentralchain/04_block:Block Timestamp>`
es: :ref:`Marca de tiempo del bloque <02_decentralchain/04_block:Block Timestamp>`

source: Unix time in milliseconds.
es: Tiempo Unix en milisegundos.

source: :ref:`Signature <02_decentralchain/04_block:Block Signature>` of the previous block
es: :ref:`Firma <02_decentralchain/04_block:Block Signature>` del bloque anterior

source: :ref:`Base target <02_decentralchain/04_block:Base Target>`
es: :ref:`Objetivo base <02_decentralchain/04_block:Base Target>`

source: :ref:`Generation signature <02_decentralchain/04_block:Block Generation>`
es: :ref:`Firma de generación <02_decentralchain/04_block:Block Generation>`

source: Number of transactions in the block
es: Número de transacciones en el bloque

source: Transaction 1
es: Transacción 1

source: Body bytes: up to :math:`165,996` bytes. Proofs: up to :math:`531` bytes.
es: Bytes del cuerpo: hasta :math:`165,996` bytes. Pruebas: hasta :math:`531` bytes.

source: Bytes of the 1st transaction in binary format.
es: Bytes de la primera transacción en formato binario.

source: Transaction 2
es: Transacción 2

source: Bytes of the 2nd transaction in binary format.
es: Bytes de la 2da transacción en formato binario.

source: Transaction N
es: Transacción N

source: Bytes of the Nth transaction in binary format.
es: Bytes de la N-ésima transacción en formato binario.

source: Number of features for which the block generator votes
es: Número de funciones por las que vota el generador de bloques

source: Feature 1
es: Característica 1

source: Feature M
es: Característica M

source: :ref:`Block generation reward <02_decentralchain/05_node:Block Reward>` for which the block generator votes
es: :ref:`Recompensa de generación de bloques <02_decentralchain/05_node:Block Reward>` por la que vota el generador de bloques

source: :math:`-1` means that block generator votes for the current reward size.
es: :math:`-1` significa que el generador de bloques vota por el tamaño de recompensa actual.

source: Block generator’s account public key
es: Llave pública de la cuenta del generador de bloques

source: :ref:`Block signature <02_decentralchain/04_block:Block Signature>`
es: :ref:`Firma de Bloque <02_decentralchain/04_block:Block Signature>`

source: :strong:`Version 3`
es: :strong:`Versión 3`

source: Block Binary Format Version 3
es: Formato Binario del Bloque Versión 3

source: Network Message Binary Format
es: Formato Binario del Mensaje de Red

source: Block Message Binary Format
es: Formato Binario del Mensaje del Bloque

source: Block message is a reply to GetBlock message.
es: El mensaje del bloque es una respuesta al mensaje de GetBlock.

source: Length in Bytes
es: Longitud en bytes

source: Packet length (BigEndian)
es: Longitud del paquete (BigEndian)

source: Magic Bytes
es: Bytes Mágicos

source: Content ID (0x17)
es: ID de contenido (0x17)

source: Payload length
es: Longitud de la carga útil

source: Payload checksum
es: Suma de comprobación de carga útil

source: Block bytes (N)
es: Bytes de bloque (N)

source: Checkpoint Message Binary Format
es: Formato Binario del Mensaje del Checkpoint

source: Content ID (0x64)
es: ID de contenido (0x64)

source: Checkpoint items count (N)
es: Checkpoint contador de items (N)

source: Checkpoint #1 height
es: Checkpoint #1 altura

source: Checkpoint #1 signature
es: Checkpoint #1 firma

source: Checkpoint #N height
es: Checkpoint #N altura

source: Checkpoint #N signature
es: Checkpoint #N firma

source: Get Block Message Binary Format
es: Formato Binario del Mensaje al Obtener Bloque

source: Content ID (0x16)
es: ID de contenido (0x16)

source: Block ID
es: ID de Bloque

source: Get Peers Message Binary Format
es: Formato Binario del Mensaje al Obtener Pares

source: Get peers message is sent when one sending node wants to know about other nodes on the network.
es: Obtener mensaje de pares se envía cuando un nodo emisor quiere saber acerca de otros nodos en la red.

source: Content ID (0x01)
es: ID de contenido (0x01)

source: Get Signatures Message Binary Format
es: Formato Binario del Mensaje al Obtener Firma

source: Content ID (0x14)
es: ID de contenido (0x14)

source: Block IDs count (N)
es: Recuento de ID de bloque (N)

source: Block #1 ID
es: Bloque #1 ID

source: Block #N ID
es: Bloque #N ID

source: Handshake Message Binary Format
es: Formato Binario del Mensaje de Enlace

source: Handshake is used to start communication between two nodes.
es: El protocolo de enlace se utiliza para iniciar la comunicación entre dos nodos.

source: Application name length (N)
es: Longitud del nombre de la aplicación (N)

source: Application name (UTF-8 encoded bytes)
es: Nombre de la aplicación (bytes codificados en UTF-8)

source: Application version major
es: Versión principal de la aplicación

source: Application version minor
es: Versión menor de la aplicación

source: Application version patch
es: Parche de versión de la aplicación

source: Node name length (M)
es: Longitud del nombre del nodo (M)

source: Node name (UTF-8 encoded bytes)
es: Nombre de nodo (bytes codificados en UTF-8)

source: Node nonce
es: Nonce de nodo

source: Declared address length (K) or :math:`0` if no declared address was set
es: Longitud de la dirección declarada (K) o :math:`0` si no se configuró ninguna dirección declarada

source: Declared address bytes (if length is not :math:`0`)
es: Bytes de dirección declarados (si la longitud no es :math:`0`)

source: Peers Message Binary Format
es: Formato Binario del Mensaje de Pares

source: Peers message is a response to get peers message.
es: El mensaje de los compañeros es una respuesta para obtener el mensaje de los compañeros.

source: Content ID (0x02)
es: ID de contenido (0x02)

source: Peers count (N)
es: Recuento de compañeros (N)

source: Peer #1 IP address
es: Par #1 dirección IP

source: Peer #1 port
es: Par #1 puerto

source: Peer #N IP address
es: Par #N dirección IP

source: Peer #N port
es: Par #N puerto

source: Score Message Binary Format
es: Formato Binario del Mensaje de Puntaje

source: Content ID (0x18)
es: ID de contenido (0x18)

source: Score (N bytes)
es: Puntuación (N bytes)

source: Signatures Message Binary Format
es: Formato Binario del Mensaje de Firmas

source: Content ID (0x15)
es: ID de contenido (0x15)

source: Block signatures count (N)
es: Recuento de firmas en bloques (N)

source: Block #1 signature
es: Firma n.º 1 del bloque

source: Block #N signature
es: Firma #N del bloque

source: Transaction Message Binary Format
es: Formato Binario del Mensaje de Transacción

source: Content ID (0x19)
es: ID de contenido (0x19)

source: Transaction (N bytes)
es: Transacción (N bytes)

source: Learn more about :ref:`order <02_decentralchain/06_order:Order>`.
es: Obtenga más información sobre :ref:`órdenes <02_decentralchain/06_order:Order>`.

source: An exchange transaction of version 3 can accept orders of versions 1–4.
es: Una transacción para intercambio de la versión 3 puede aceptar pedidos de las versiones 1–4.

source: An exchange transaction of version 2 can accept orders of versions 1–3.
es: Una transacción para intercambio de la versión 2 puede aceptar pedidos de las versiones 1–3.

source: An exchange transaction of version 1 can accept orders of version 1 only.
es: Una transacción para intercambio de la versión 1 solo puede aceptar pedidos de la versión 1.

source: Order Binary Format Version 4
es: Formato Binario de Orden Versión 4

source: Size
es: Tamaño

source: Public key of the order sender.
es: Llave pública del remitente de la orden.

source: Public key of matcher.
es: Llave pública del emparejador.

source: :math:`32` bytes for asset. :math:`0` for DecentralCoins.
es: :math:`32` bytes para activo. :math:`0` para DecentralCoins.

source: ID of the amount asset.
es: ID del activo de cantidad.

source: ID of the price asset.
es: ID del activo de precio.

source: Order type: buy or sell.
es: Tipo de orden: compra o venta.

source: Amount of the amount asset, specified in the minimum fraction (“cent”) of asset.
es: Importe del monto del activo, especificado en la fracción mínima (“centavo”) del activo.

source: Price for the amount asset nominated in the price asset, multiplied by :math:`108`.
es: Precio por el monto del activo nominado en el precio del activo, multiplicado por :math:`108`.

source: Order timestamp: Unix time in milliseconds.
es: Marca de tiempo de la orden: tiempo Unix en milisegundos.

source: expiration
es: vencimiento

source: Unix time in milliseconds when the order will be expired.
es: Tiempo Unix en milisegundos cuando la orden caducará.

source: Matcher fee token ID.
es: ID de token de tarifa del emparejador.

source: Matcher fee
es: Tarifa del emparejador

source: Order version: 4.
es: Versión de la orden: 4.

source: Each proof up to :math:`64` bytes, up to :math:`8` proofs.
es: Cada prueba hasta :math:`64` bytes, hasta :math:`8` pruebas.

source: Order proofs that are used to check the validity of the order.
es: Comprobantes de pedido que se utilizan para comprobar la validez del pedido.

source: Order Binary Format Version 3
es: Formato Binario de Orden Versión 3

source: JSON field name
es: Nombre de campo JSON

source: Length in bytes
es: Longitud en bytes

source: :ref:`Order <02_decentralchain/06_order:Order>` binary format version number
es: Número de versión del ormato binario de :ref:`orden <02_decentralchain/06_order:Order>`

source: Must be :math:`3`.
es: Debe ser :math:`3`.

source: Order sender public key
es: Llave pública del remitente del pedido

source: Matcher public key
es: Llave pública del emparejador

source: Asset B (amount asset) flag
es: Indicador de activo B (cantidad de activo)

source: If token is DecentralCoins, then value is :math:`0`, else :math:`1`.
es: Si el token es DecentralCoins, entonces el valor es :math:`0`, de lo contrario :math:`1`.

source: Asset B (amount Asset) ID
es: Id. de activo B (cantidad de activo)

source: If token is not DecentralCoins, then :math:`S = 32`, else the field should be absent.
es: Si el token no es DecentralCoins, entonces :math:`S = 32`, de lo contrario, el campo debería estar ausente.

source: Asset A (price asset) flag
es: Indicador de activo A (activo de precio)

source: Asset A (price asset) ID
es: ID de activo A (activo de precio)

source: Order type
es: Tipo de orden

source: If order is for buying, then value is :math:`0`, if order is for selling, then value is :math:`1`.
es: Si el pedido es para comprar, entonces el valor es :math:`0`, si el pedido es para vender, entonces el valor es :math:`1`.

source: Amount of asset B (amount asset), which the order sender offers for one price asset(asset A)
es: Cantidad del activo B (cantidad de activo), que el emisor de la orden ofrece por un precio de activo (activo A)

source: Bytes in big-endian notation.
es: Bytes en notación big-endian.

source: Amount of asset B (price asset), which the order sender wants to buy or send depending on order type
es: Importe del activo B (activo de precio), que el emisor de la orden quiere comprar o enviar según el tipo de orden

source: Amount of milliseconds from the beginning of Unix epoch till the moment of validation of order by matcher
es: Cantidad de milisegundos desde el comienzo del Unix epoch hasta el momento de la validación del pedido por parte del emparejador

source: Amount of milliseconds from the beginning of Unix epoch till the unfulfilled order cancellation
es: Cantidad de milisegundos desde el comienzo de la Unix epoch hasta la cancelación del pedido incumplido

source: Matcher fee token flag
es: Bandera de token de tarifa del emparejador

source: If token is DecentralCoins, then value is :math:`0`, else :math:`1`
es: Si el token es DecentralCoins, entonces el valor es :math:`0`, si no :math:`1`

source: Matcher fee token
es: Token de tarifa del emparejador

source: If token is not DecentralCoins, then :math:`F = 32`, else the field should be absent.
es: Si el token no es DecentralCoins, entonces :math:`F = 32`, de lo contrario, el campo debería estar ausente.

source: Proofs
es: Pruebas

source: Array[Proof]
es: Matriz[Prueba]

source: If the array is empty, then :math:`S = 3`. If the array is not empty, then :math:`S = 3 + 2 × N + (P_{1} + P_{2} + ... + P_{n})`, where :math:`N` is amount of proofs in the array, :math:`P_{n}` — size N-th proof in bytes. Maximum amount of proofs in the array is :math:`8`. Maximum length of each proof is :math:`64` bytes.
es: Si la matriz está vacía, entonces :math:`S = 3`. Si la matriz no está vacía, entonces :math:`S = 3 + 2 × N + (P_{1} + P_{2} + ... + P_{n})`, donde :math:`N` es cantidad de pruebas en la matriz, :math:`P_{n}` — tamaño N-ésima prueba en bytes. La cantidad máxima de pruebas en la matriz es :math:`8`. La longitud máxima de cada prueba es :math:`64` bytes.

source: JSON Representation of Order Version 3
es: Representación JSON de Orden Versión 3

source: :strong:`Version 2`
es: :strong:`Versión 2`

source: Order Binary Format Version 2
es: Formato Binario de Orden Versión 2

source: Version
es: Versión

source: :ref:`Byte <02_decentralchain/09_protocol:Blockchain Data Types>` (constant, value = :math:`2`)
es: :ref:`Byte <02_decentralchain/09_protocol:Blockchain Data Types>` (constante, valor = :math:`2`)

source: Matcher's public key
es: Llave pública del emparejador

source: Amount asset flag (:math:`1` - asset, :math:`0` - DecentralCoins)
es: Indicador de activo de cantidad (:math:`1` - activo, :math:`0` - DecentralCoins)

source: Amount asset
es: Activo de cantidad

source: :math:`32` or :math:`0` (depends on the byte in 4.1).
es: :math:`32` o :math:`0` (depende del byte en 4.1).

source: Price asset flag (:math:`1` - asset, :math:`1` - DecentralCoins)
es: Indicador de activo de precio (:math:`1` - activo, :math:`1` - DecentralCoins)

source: Price asset
es: Precio activo
