Repository: Decentral-America/docs
Catalog: docs/locales/*/LC_MESSAGES/02_decentralchain.po
Languages: es

source: Leased tokens remain locked on the sender's account with the full control of their owner. The sender can cancel the lease at any time by the :ref:`lease cancel transaction <02_decentralchain/03_transaction:Lease Cancel Transaction>`.
es: Los tokens arrendados permanecen bloqueados en la cuenta del remitente con el control total de su propietario. El remitente puede cancelar el arrendamiento en cualquier momento mediante la :ref:`transacción para cancelar arrendamiento <02_decentralchain/03_transaction:Lease Cancel Transaction>`.

source: The :ref:`minimum fee <02_decentralchain/03_transaction:Minimum Fee>` for a lease transaction is :math:`0.001` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`.
es: La :ref:`tarifa mínima <02_decentralchain/03_transaction:Minimum Fee>` en una transacción para arrendamiento es :math:`0.001` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`.

source: Lease Transaction JSON Representation
es: Representación JSON de Transacción para Arrendamiento

source: Amount of :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` to lease.
es: Cantidad de :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` para arrendar.

source: Recipient address base58 encoded or recipient alias.
es: Dirección del destinatario codificada en base58 o alias del destinatario.

source: Lease status: 1) active: lease is active. 2) canceled: lease is cancelled, see :ref:`lease cancel transaction <02_decentralchain/03_transaction:Lease Cancel Transaction>`.
es: Estado de arrendamiento: 1) activo: el arrendamiento está activo. 2) cancelado: el contrato de arrendamiento está cancelado, consulte la :ref:`transacción para cancelar arrendamiento <02_decentralchain/03_transaction:Lease Cancel Transaction>`.

source: The status field does not need to be filled when sending a transaction, and it is not stored on the blockchain. The node calculates these fields when providing transaction data via the REST API.
es: No es necesario completar el campo de estado al enviar una transacción y no se almacena en la cadena de bloques. El nodo calcula estos campos cuando proporciona datos de transacciones a través de la API REST.

source: See the :ref:`lease transaction binary format <02_decentralchain/10_binary-format:Lease Transaction Binary Format>`.
es: Consulte el :ref:`formato binario de transacción para arrendamiento <02_decentralchain/10_binary-format:Lease Transaction Binary Format>`.

source: Lease Cancel Transaction
es: Transacción para Cancelar Arrendamiento

source: Lease cancel transaction cancels the leasing. See the :ref:`lease transaction <02_decentralchain/03_transaction:Lease Transaction>` article.
es: La transacción para cancelar arrendamiento cancela el arrendamiento. Consulte el artículo :ref:`transacción para arrendamiento <02_decentralchain/03_transaction:Lease Transaction>`.

source: The :ref:`minimum fee <02_decentralchain/03_transaction:Minimum Fee>` for a lease cancel transaction is :math:`0.001` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`.
es: La :ref:`tarifa mínima <02_decentralchain/03_transaction:Minimum Fee>` en una transacción para cancelar arrendamiento es :math:`0.001` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`.

source: Lease Cancel Transaction JSON Representation
es: Representación JSON de Transacción para Cancelar Arrendamiento

source: Lease transaction ID.
es: ID de transacción para arrendamiento.

source: Parameters of canceled lease.
es: Parámetros de arrendamiento cancelado.

source: The lease structure does not need to be filled when sending a transaction, and it is not stored on the blockchain. The node returns this structure when providing transaction data via the REST API.
es: No es necesario completar la estructura de arrendamiento al enviar una transacción, y no se almacena en la cadena de bloques. El nodo devuelve esta estructura cuando proporciona datos de transacciones a través de la API REST.

source: See the :ref:`lease cancel transaction binary format <02_decentralchain/10_binary-format:Lease Cancel Transaction Binary Format>`.
es: Consulte el :ref:`formato binario de transacción para cancelar arrendamiento <02_decentralchain/10_binary-format:Lease Cancel Transaction Binary Format>`.

source: Sponsor Fee Transaction
es: Transacción para Patrocinar Tarifas

source: Sponsor fee transaction enables or disables sponsorship. Sponsorship allows any user to pay a fee in the sponsored asset (instead of DecentralCoins) for invoke script transactions and transfer transactions. :ref:`More about sponsorship <02_decentralchain/03_transaction:Sponsored Fees>`.
es: La transacción de la tarifa del patrocinador habilita o deshabilita el patrocinio. El patrocinio permite que cualquier usuario pague una tarifa en el activo patrocinado (en lugar de DecentralCoins) en transacciones para invocar scripts y transacciones para transferencia. :ref:`Más sobre el patrocinio <02_decentralchain/03_transaction:Sponsored Fees>`.

source: Only the asset issuer can set up sponsorship. Smart asset cannot be a sponsored asset.
es: Solo el emisor del activo puede configurar el patrocinio. El activo inteligente no puede ser un activo patrocinado.

source: The :ref:`minimum fee <02_decentralchain/03_transaction:Minimum Fee>` for the sponsor fee transaction is :math:`0.001` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`.
es: La :ref:`tarifa mínima <02_decentralchain/03_transaction:Minimum Fee>` en una transacción para patrocinar tarifas es :math:`0.001` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`.

source: Sponsor Fee Transaction JSON Representation
es: Representación JSON de Transacción para Patrocinar Tarifas

source: Amount of asset that is equivalent to :math:`0.001` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` (:math:`100,000` Decentralites): an integer value specified in the minimum fraction (“cents”) of asset. null – disable sponsorship.
es: Cantidad de activo que es equivalente a :math:`0.001` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` (:math:`100,000` Decentralitos): un valor entero especificado en la fracción mínima ("centavos”) del activo. nulo: deshabilitar el patrocinio.

source: See the :ref:`sponsor fee transaction binary format <02_decentralchain/10_binary-format:Sponsor Fee Transaction Binary Format>`.
es: Consulte el :ref:`formato binario de transacción para patrocinar tarifas <02_decentralchain/10_binary-format:Sponsor Fee Transaction Binary Format>`.

source: Genesis
es: Génesis

source: :ref:`Genesis transaction <02_decentralchain/03_transaction:Genesis Transaction>`
es: :ref:`Transacción Génesis <02_decentralchain/03_transaction:Genesis Transaction>`

source: Accrues :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` to an account upon the initial distribution during the creation of the blockchain.
es: Acumula :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` en una cuenta tras la distribución inicial durante la creación de la cadena de bloques.

source: Genesis Transaction
es: Transacción Génesis

source: Genesis transaction accrues :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` to account upon the initial distribution of DecentralCoins during the creation of the blockchain. The first block of the blockchain, the genesis block, consists of genesis transactions.
es: La transacción de génesis acumula :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` para dar cuenta de la distribución inicial de DecentralCoins durante la creación de la cadena de bloques. El primer bloque de la cadena de bloques, el bloque de génesis, consta de transacciones génesis.

source: See the :ref:`genesis transaction binary format <02_decentralchain/10_binary-format:Genesis Transaction Binary Format>`.
es: Consulte el :ref:`formato binario de transacción génesis <02_decentralchain/10_binary-format:Genesis Transaction Binary Format>`.

source: Transaction Validation
es: Validación de Transacciones

source: A DecentralChain node validates each transaction in the following cases:
es: Un nodo DecentralChain valida cada transacción en los siguientes casos:

source: The node receives the transaction via the broadcast endpoint of :ref:`Node extensions <documentation:placeholder>` or :ref:`gRPC server <documentation:placeholder>`.
es: El nodo recibe la transacción a través del punto final de difusión de :ref:`Node extensions <documentation:placeholder>` o :ref:`gRPC server <documentation:placeholder>`.

source: The node receives the transaction from another node of the blockchain network using the binary protocol.
es: El nodo recibe la transacción de otro nodo de la red blockchain utilizando el protocolo binario.

source: The block generator adds the transaction to a block.
es: El generador de bloques agrega la transacción a un bloque.

source: The node receives a block (or microblock) from another node in the network.
es: El nodo recibe un bloque (o microbloque) de otro nodo de la red.

source: Full transaction validation includes the following checks:
es: La validación completa de la transacción incluye las siguientes comprobaciones:

source: Transaction fields check including:
es: Verificación de campos de transacción que incluye:

source: Timestamp check: the transaction timestamp should be not more than :math:`2` hours ago or :math:`1.5` hours ahead from the current block timestamp.
es: Verificación de la marca de tiempo: la marca de tiempo de la transacción no debe ser más de :math:`2` horas o :math:`1.5` horas antes de la marca de tiempo del bloque actual.

source: Transaction version check: all the features required to support this version should be activated.
es: Comprobación de la versión de la transacción: todas las funciones necesarias para admitir esta versión deben estar activadas.

source: Transaction type check: all the features required to support this type should be activated.
es: Comprobación del tipo de transacción: todas las funciones necesarias para admitir este tipo deben estar activadas.

source: Check of token amounts: the values must be non-negative.
es: Verificación de montos de tokens: los valores deben ser no negativos.

source: Check different fields depending on the transaction type.
es: Consulta diferentes campos según el tipo de transacción.

source: Sender's balance check.
es: Consulta de saldo del remitente.

source: The sender should have enough funds to pay the fee. If a sponsored asset is used for the fee, the sponsor's balance is also checked.
es: El remitente debe tener fondos suficientes para pagar la tarifa. Si se utiliza un activo patrocinado para la tarifa, también se verifica el saldo del patrocinador.

source: Depending on the type of transaction, the sender should have enough assets for transfer or for payments attached to the :ref:`invoke script transactions <02_decentralchain/03_transaction:Invoke Script Transaction>`. Order senders in the :ref:`exchange transaction <02_decentralchain/03_transaction:Exchange Transaction>` should have enough funds to exchange.
es: Según el tipo de transacción, el remitente debe tener suficientes activos para la transferencia o para los pagos adjuntos a la :ref:`transacción para invocar scripts <02_decentralchain/03_transaction:Invoke Script Transaction>`. Los remitentes de pedidos en la :ref:`transacción para intercambio <02_decentralchain/03_transaction:Exchange Transaction>` deben tener fondos suficientes para intercambiar.

source: The sender's signature verification
es: La verificación de la firma del remitente

source: For ordinary accounts (without script).
es: Para cuentas ordinarias (sin guión).

source: For account script execution if the sender is a :ref:`smart account <02_decentralchain/01_account:dApp and Smart Account>`.
es: Para la ejecución del script de cuenta si el remitente es una :ref:`cuenta inteligente <02_decentralchain/01_account:dApp and Smart Account>`.

source: For verifier function execution if the sender is :ref:`dApp <02_decentralchain/01_account:dApp and Smart Account>`.
es: Para la ejecución de la función de verificación si el remitente es una :ref:`dApp <02_decentralchain/01_account:dApp and Smart Account>`.

source: A similar check is performed for orders in an :ref:`exchange transaction <02_decentralchain/03_transaction:Exchange Transaction>`.
es: Se realiza una verificación similar para los pedidos en una :ref:`transacción para intercambio <02_decentralchain/03_transaction:Exchange Transaction>`.

source: For the invoke script transaction:
es: Para la transacción para invocar scripts

source: Calculation of the result of dApp callable function.
es: Cálculo del resultado de la función invocable de dApp.

source: dApp balance check: dApp account should have enough funds for :ref:`dApp script actions <03_ride-language/05_structures:Script Actions>`.
es: Comprobación del saldo de dApp: la cuenta de dApp debe tener fondos suficientes para :ref:`acciones de script de dApp <03_ride-language/05_structures:Script Actions>`.

source: Check that the transaction fee is not less than the :ref:`minimum fee <02_decentralchain/03_transaction:Minimum Fee>` based on script actions.
es: Verifique que la tarifa de transacción no sea inferior a la :ref:`tarifa mínima <02_decentralchain/03_transaction:Minimum Fee>` según las acciones del script.

source: Execution of asset scripts if the transaction uses :ref:`smart assets <02_decentralchain/02_token(asset):Smart Asset>`, including scripts of assets used in dApp script actions.
es: Ejecución de scripts de activos si la transacción utiliza :ref:`activos inteligentes <02_decentralchain/02_token(asset):Smart Asset>`, incluidos los scripts de activos utilizados en acciones de scripts de una dApp.

source: When receiving the transaction via the broadcast endpoint, or adding a transaction to a block, or receiving a block over the network, the node performs full validation of the transaction. When receiving an invoke script transaction over the network, the node performs calculations of the callable function (check 4.1) up to the :ref:`threshold for saving unsuccessful transactions <03_ride-language/07_dapp-to-app-invocation:Limitations>`.
es: Al recibir la transacción a través del punto final de transmisión, agregar una transacción a un bloque o recibir un bloque a través de la red, el nodo realiza una validación completa de la transacción. Al recibir una transacción de script de invocación a través de la red, el nodo realiza cálculos de la función invocable (consulte 4.1) hasta el :ref:`umbral para guardar transacciones fallidas <03_ride-language/07_dapp-to-app-invocation:Limitations>` .

source: Validation Result
es: Resultado de la Validación

source: When the transaction is received via broadcast or over the network:
es: Cuando la transacción se recibe por transmisión o por la red:

source: If one of the checks fails, the transaction is discarded.
es: Si una de las comprobaciones falla, la transacción se descarta.

source: If all the checks passed, the transaction is added to the UTX pool, which is the list of transactions waiting to be added to the block.
es: Si se aprobaron todas las comprobaciones, la transacción se agrega al grupo UTX, que es la lista de transacciones que esperan ser agregadas al bloque.

source: When adding the transaction to the block, the result of validation depends on the transaction type.
es: Al agregar la transacción al bloque, el resultado de la validación depende del tipo de transacción.

source: If one of the checks 1–3 failed, the transaction is discarded.
es: Si una de las comprobaciones 1 a 3 falla, la transacción se descarta.

source: If checks 1–3 passed, and the calculation of the result of the dApp callable function (check 4.1) failed with an error or :ref:`throwing an exception <03_ride-language/01_syntax-basics:Exceptions>` before the :ref:`complexity <03_ride-language/07_dapp-to-app-invocation:Script Complexity>` of performed calculations exceeded the :ref:`threshold for saving failed transactions <03_ride-language/07_dapp-to-app-invocation:Limitations>`, the transaction is also discarded.
es: Si se pasaron las comprobaciones 1 a 3 y el cálculo del resultado de la función invocable de dApp (comprobación 4.1) falló con un error o :ref:`lanzando una excepción <03_ride-language/01_syntax-basics:Exceptions>` antes de la :ref :`complejidad <03_ride-language/07_dapp-to-app-invocation:Script Complexity>` de los cálculos realizados supere el :ref:`umbral para guardar transacciones fallidas <03_ride-language/07_dapp-to-app-invocation:Limitations>` , la transacción también se descarta.

source: If checks 1–3 passed but checks 4–5 failed and besides the result of the callable function is calculated successfully or the complexity exceeded the threshold, the transaction is saved on the blockchain but marked as failed: "applicationStatus": "script_execution_failed". The sender is charged the transaction fee. The transaction doesn't entail any other changes to the state of the blockchain.
es: Si se aprobaron las comprobaciones 1 a 3 pero fallaron las comprobaciones 4 a 5 y, además, el resultado de la función invocable se calcula correctamente o la complejidad superó el umbral, la transacción se guarda en la cadena de bloques pero se marca como fallida: "applicationStatus": "script_execution_failed". Al remitente se le cobra la tarifa de transacción. La transacción no implica ningún otro cambio en el estado de la cadena de bloques.

source: If all checks passed, the transaction is saved on the blockchain as successful: "applicationStatus": "succeeded" and the sender is charged the fee.
es: Si se aprobaron todas las comprobaciones, la transacción se guarda en la cadena de bloques como exitosa: "applicationStatus": "succeeded" y se le cobra la tarifa al remitente.

source: For the exchange transaction:
es: Para la transacción para intercambio:

source: If checks 1–3 passed but check 5 failed, the transaction is saved on the blockchain but marked as failed: "applicationStatus": "script_execution_failed". The sender of the transaction (matcher) is charged the transaction fee. The transaction doesn't entail any other changes in balances, in particular, the order senders don't pay the matcher fee.
es: Si se pasaron las comprobaciones 1 a 3 pero la comprobación 5 falló, la transacción se guarda en la cadena de bloques pero se marca como fallida: "applicationStatus": "script_execution_failed". Al remitente de la transacción (emparejador) se le cobra la tarifa de transacción. La transacción no implica ningún otro cambio en los saldos, en particular, los remitentes de la orden no pagan la tarifa del emparejador.

source: If all checks passed, the transaction is saved on the blockchain as successful: "applicationStatus": "succeeded". The matcher is charged the transaction fee as well as the order senders are charged the matcher fee.
es: Si se aprobaron todas las comprobaciones, la transacción se guarda en la cadena de bloques como exitosa: "applicationStatus": "succeeded". Al emparejador se le cobra la tarifa de transacción, así como a los remitentes de pedidos se les cobra la tarifa del emparejador.

source: For the other transactions:
es: Para las demás transacciones:

source: If all checks passed, the transaction is saved on the blockchain as successful and the sender is charged the fee.
es: Si se aprueban todos los controles, la transacción se guarda en la cadena de bloques como exitosa y se le cobra la tarifa al remitente.

source: Block
es: Bloque

source: A block is a link in the chain of the blockchain. Block contains transactions. A block has its height.
es: Un bloque es un eslabón en la cadena de la cadena de bloques. El bloque contiene transacciones. Un bloque tiene su altura.

source: The maximum block size is :math:`1` MB. The maximum total complexity of scripts in transactions of the block is :math:`2,500,000`. The complexity of all executed scripts is taken into account: dApp scripts, account scripts, and asset scripts.
es: El tamaño máximo de bloque es :math:`1` MB. La máxima complejidad total de scripts en transacciones del bloque es :math:`2,500,000`. Se tiene en cuenta la complejidad de todos los scripts ejecutados: scripts de dApp, scripts de cuentas y scripts de activos.

source: Block Generation
es: Generación de Bloques

source: A block generation is a creation of a new :ref:`block <02_decentralchain/04_block:Block>` on the blockchain. Blocks are generated by :ref:`generating nodes <02_decentralchain/05_node:Generating Node>` according to :ref:`FPoS algorithm <02_decentralchain/09_protocol:Fair Proof of Stake>` and the :ref:`DecentralChain-M5 protocol <02_decentralchain/09_protocol:DecentralChain-M5 Protocol>`. The block generator signs the block headers only. The block headers contain the merkle root hash of the block transactions. This makes it possible to verify the block headers apart from transactions and to provide evidence of the presence of transactions in the block without the presence of all transactions. See details in the :ref:`transactions root hash <02_decentralchain/04_block:Transactions Root Hash>` article.
es: Una generación de bloques es la creación de un nuevo :ref:`bloque <02_decentralchain/04_block:Block>` en la cadena de bloques. Los bloques son generados por :ref:`nodos generadores <02_decentralchain/05_node:Generating Node>` según el :ref:`algoritmo FPoS <02_decentralchain/09_protocol:Fair Proof of Stake>` y el :ref:`protocolo DecentralChain-M5 <02_decentralchain/09_protocol:DecentralChain-M5 Protocol>`. El generador de bloques solo firma los encabezados de los bloques. Los encabezados de bloque contienen el hash raíz de Merkle de las transacciones de bloque. Esto hace posible verificar los encabezados de bloque además de las transacciones y proporcionar evidencia de la presencia de transacciones en el bloque sin la presencia de todas las transacciones. Consulte los detalles en el artículo sobre :ref:`hash raíz de transacciones <02_decentralchain/04_block:Transactions Root Hash>`.

source: Base Target
es: Objetivo Base

source: The base target is the variable in the average block generation time formula that adjusts :ref:`block generation <02_decentralchain/04_block:Block Generation>` time to :math:`60` seconds.
es: El objetivo base es la variable en la fórmula de tiempo promedio de generación de bloques que ajusta el tiempo de :ref:`generación de bloques <02_decentralchain/04_block:Block Generation>` a :math:`60` segundos.

source: Generation Signature
es: Firma de Generación

source: Generation signature is the variable in the average block generation time formula. It is used to check whether the current :ref:`generating node <02_decentralchain/05_node:Generating Node>` is eligible to generate the next block. The generation signature is calculated using VRF (verifiable random function with short proofs and keys) — a pseudo-random function that uses a message and the private key of an account to provide a non-interactively verifiable proof for the correctness of its output.
es: La firma de generación es la variable en la fórmula de tiempo promedio de generación de bloque. Se utiliza para verificar si el :ref:`nodo generador <02_decentralchain/05_node:Generating Node>` actual es elegible para generar el siguiente bloque. La firma de generación se calcula utilizando VRF (función aleatoria verificable con pruebas cortas y llaves), una función pseudoaleatoria que utiliza un mensaje y la clave privada de una cuenta para proporcionar una prueba verificable no interactiva de la exactitud de su salida.
