Repository: Decentral-America/docs
Catalog: docs/locales/*/LC_MESSAGES/02_decentralchain.po
Languages: es

source: DecentralChain addresses this issue by allowing the miner to continuously farm a block during the time of mining. This continuously increasing block is called liquid block, which becomes immutable when the next block referencing it is built and appended. A liquid block consists of a key block and chain of microblocks. The process of creating liquid block goes as follows:
es: DecentralChain aborda este problema al permitir que el minero cultive continuamente un bloque durante el tiempo de la minería. Este bloque que aumenta continuamente se denomina bloque líquido, que se vuelve inmutable cuando se construye y agrega el siguiente bloque que hace referencia a él. Un bloque líquido consta de un bloque clave y una cadena de microbloques. El proceso de creación de bloque líquido es el siguiente:

source: When a miner node observes it has the right to create a block, it creates and sends keyBlock, which is regularly just an empty block.
es: Cuando un nodo minero observa que tiene derecho a crear un bloque, crea y envía keyBlock, que normalmente es solo un bloque vacío.

source: After that, it creates and sends microblocks every :math:`3` seconds. Microblock is very similar to a regular block: it's a non-empty pack of transactions, which references its parent: previous microblock or key block.
es: Después de eso, crea y envía microbloques cada :math:`3` segundos. El microbloque es muy similar a un bloque regular: es un paquete de transacciones no vacío, que hace referencia a su padre: microbloque anterior o bloque clave.

source: Microblocks are continuously mined and propagated to the network until a new key block, referencing the current liquid block appears.
es: Los microbloques se extraen continuamente y se propagan a la red hasta que aparece un nuevo bloque clave, que hace referencia al bloque líquido actual.

source: Microblock Structure
es: Estructura de Microbloques

source: Transactions
es: Transacciones

source: Next miner can reference any of these ids in its keyBlock.
es: El próximo minero puede hacer referencia a cualquiera de estos identificadores en su keyBlock.

source: Economy
es: Economía

source: For a miner, it might seem a good idea to reference KEYBLOCK from previous example and pack all txs from microblocks to its own (micro)block(s). In order to make 'stealing' transactions less profitable than referencing the best-known version of liquid block(= the last known microblock), we change the mechanics of fees: After activating M5, miner will receive :math:`40\%` of fees from the block it creates and :math:`60\%` of fees from the block he references.
es: Para un minero, puede parecer una buena idea hacer referencia a KEYBLOCK del ejemplo anterior y empaquetar todos los txs de los microbloques en su propio (micro)bloque(s). Para hacer que las transacciones de "robo" sean menos rentables que hacer referencia a la versión más conocida de Liquid Block (= el último microbloque conocido), cambiamos la mecánica de las tarifas: después de activar M5, el minero recibirá :math:`40\% ` de tarifas del bloque que crea y :math:`60\%` de tarifas del bloque al que hace referencia.

source: Related Protocol Changes
es: Cambios de Protocolo Relacionados

source: A block can contain up to :math:`65535` transactions and doesn't require transaction sorting.
es: Un bloque puede contener hasta :math:`65535` transacciones y no requiere clasificación de transacciones.

source: By default miners will first create an empty key block. It's a regular block, propagated byBlockForgedmessage, but it now gets broadcasted if it's empty.
es: Por defecto, los mineros primero crearán un bloque de clave vacío. Es un bloque normal, propagado porBlockForgedmessage, pero ahora se transmite si está vacío.

source: Microblocks are propagated by broadcasting its header for every node which applied it (MicroBlockInv)MicroBlockInv contains a verifiable signature to prevent a node from being flooded. Microblock will be requested afterward via MicroBlockRequestand received back withinMicroBlockResponse.Microblocks will be re-requested from another node which has it if a node doesn't respond.
es: Los microbloques se propagan transmitiendo su encabezado para cada nodo que lo aplicó (MicroBlockInv) MicroBlockInv contiene una firma verificable para evitar que un nodo se inunde. El microbloque se solicitará posteriormente a través de MicroBlockRequest y se recibirá dentro de MicroBlockResponse. Los microbloques se volverán a solicitar desde otro nodo que lo tenga si un nodo no responde.

source: Configuration
es: Configuración

source: The following miner parameters can be tuned(though it's best not to change them in order to maximize final version of your liquid block in the resulting blockchain):
es: Se pueden ajustar los siguientes parámetros mineros (aunque es mejor no cambiarlos para maximizar la versión final de su bloque líquido en la cadena de bloques resultante):

source: KeyBlock size (maxTransactionsInKeyBlock, default = :math:`0`). If changed, it won't be rebroadcasted and the usual extension requesting mechanics will be used.
es: Tamaño de KeyBlock (maxTransactionsInKeyBlock, predeterminado = :math:`0`). Si se modifica, no se retransmitirá y se utilizará la mecánica habitual de solicitud de prórroga.

source: Microblock mining interval (microBlockInterval, default = :math:`3` s).
es: Intervalo de minería de microbloques (microBlockInterval, predeterminado = :math:`3` s).

source: Max amount of transactions per microblock (maxTransactionsInMicroBlock, default = :math:`200`).
es: Cantidad máxima de transacciones por microbloque (maxTransactionsInMicroBlock, predeterminado = :math:`200`).

source: Miner will try to reference the best-known microblock with at leastminMicroBlockAgeage(default = :math:`3` s). This is required in order for a miner to reference already-propagated block so its key block doesn't get orphaned.
es: Miner intentará hacer referencia al microbloque más conocido con al menos minMicroBlockAgeage (predeterminado = :math:`3` s). Esto es necesario para que un minero haga referencia a un bloque ya propagado para que su bloque clave no quede huérfano.

source: Microblock synchronization mechanism can be tuned with waitResponseTimeout(default = :math:`2` s), processedMicroBlocksCacheTimeout(default = :math:`10` s),invCacheTimeout(default = :math:`10` s) which are basically time of awaiting a microblock and times to cache a processed microblock ids and a list of nodes which have a microblock(by id).
es: El mecanismo de sincronización de microbloques se puede ajustar con waitResponseTimeout(predeterminado = :matemáticas:`2` s), procesadoMicroBlocksCacheTimeout(predeterminado = :matemáticas:`10` s), invCacheTimeout(predeterminado = :matemáticas:`10` s) que son básicamente el tiempo de en espera de un microbloque y tiempos para almacenar en caché las identificaciones de un microbloque procesado y una lista de nodos que tienen un microbloque (por identificación).

source: API changes
es: Cambios en la API

source: Upon applying every microblock, the last block gets changed, which means/blocks/lastand/blocks/at/...will reflect that.
es: Al aplicar cada microbloque, se cambia el último bloque, lo que significa que /blocks/laststand/blocks/at/... reflejará eso.

source: /peers/blacklistednow expose ban reason, one can clear a node's blacklist via/peers/clearblacklist
es: /peers/blacklistednow expone el motivo de la prohibición, uno puede borrar la lista negra de un nodo a través de/peers/clearblacklist

source: DecentralChain-M5 Protocol
es: Protocolo DecentralChain-M5

source: Scalability Limits and Challenges in Current Blockchain Systems
es: Límites de Escalabilidad y Desafíos en los Sistemas Blockchain Actuales

source: Problem Statement and Motivation
es: Declaración del Problema y Motivación

source: Blockchains protocols have some scalability limits and challenges that tradeoff between throughput and latency. The current blockchain technology is not fast enough and does not scale to include more transactions into the system so we have a performance challenge to be considered. There is a united agreement between miners, consumers, and developers with several perspectives that we need to deploy scalability measures, and there has been an ongoing argument on how to improve Bitcoin’s scalability. Current proposals have focused on how big to make the blocks and how to handle the block size increases in the future.
es: Los protocolos de cadenas de bloques tienen algunos límites de escalabilidad y desafíos que compensan el rendimiento y la latencia. La tecnología blockchain actual no es lo suficientemente rápida y no se escala para incluir más transacciones en el sistema, por lo que tenemos un desafío de rendimiento que considerar. Existe un acuerdo conjunto entre mineros, consumidores y desarrolladores con varias perspectivas de que necesitamos implementar medidas de escalabilidad, y ha habido un debate continuo sobre cómo mejorar la escalabilidad de Bitcoin. Las propuestas actuales se han centrado en el tamaño de los bloques y cómo manejar los aumentos de tamaño de los bloques en el futuro.

source: All proposals suffer from a major scalability bottleneck: No matter what block size is chosen, the blockchain system can at best reach a proper transaction throughput, increasing from ~ :math:`3` transactions per second to ~ :math:`7` transactions per second. This is so far from the :math:`30,000` transactions per second which are necessary to compete with the existing systems such as VISA transactions. The same major limitations apply to litecoin, Ethereum, and all other currencies that share Bitcoin’s blockchain protocol.
es: Todas las propuestas sufren un gran cuello de botella de escalabilidad: no importa qué tamaño de bloque se elija, el sistema de cadena de bloques puede, en el mejor de los casos, alcanzar un rendimiento de transacciones adecuado, aumentando de ~ :math:`3` transacciones por segundo a ~ :math:`7` transacciones por segundo. Esto está muy lejos de las :math:`30,000` transacciones por segundo que son necesarias para competir con los sistemas existentes como las transacciones VISA. Las mismas limitaciones principales se aplican a litecoin, Ethereum y todas las demás monedas que comparten el protocolo de cadena de bloques de Bitcoin.

source: DecentralChain-M5 will address the scalability bottleneck by making the network reach the highest throughput depending on the network conditions. It will not only enhance the transaction throughput, it will also reduce transaction latencies. So it will be possible to get an initial transaction confirmation in seconds rather than in minutes.
es: DecentralChain-M5 abordará el cuello de botella de escalabilidad al hacer que la red alcance el rendimiento más alto según las condiciones de la red. No solo mejorará el rendimiento de las transacciones, sino que también reducirá las latencias de las transacciones. Por lo tanto, será posible obtener una confirmación de transacción inicial en segundos en lugar de minutos.

source: Weaknesses of Current Proposals to Improve Scalability
es: Debilidades de las Propuestas Actuales para Mejorar la Escalabilidad

source: Blockchain Systems can process transactions and the maximum rate of these transactions is limited by the choice of two parameters: block size and block interval.
es: Los sistemas blockchain pueden procesar transacciones y la tasa máxima de estas transacciones está limitada por la elección de dos parámetros: tamaño de bloque e intervalo de bloque.

source: The block interval defines the average amount of time that passes between the creation of two blocks. By deciding to reduce the block interval to solve the latency limit, the system will have less security (increase forks probability) due to the reason of new miners for every second which will lead to instability where the blockchain is subject to reorganization and the system is in disagreement (Figure 1). If we reduce the time per block, then we will have a situation where a significant number of blocks are solved in less time than it takes to relay a solved block throughout the network. So there will be no way to know which block is the "real" one and which one is a "fork" because the transactions that appeared to have multiple confirmations suddenly have fewer confirmations (or possibly go back to being unconfirmed).
es: El intervalo de bloque define la cantidad promedio de tiempo que pasa entre la creación de dos bloques. Al decidir reducir el intervalo de bloque para resolver el límite de latencia, el sistema tendrá menos seguridad (aumentará la probabilidad de bifurcaciones) debido a la razón de que habrá nuevos mineros por cada segundo, lo que conducirá a una inestabilidad en la que la cadena de bloques está sujeta a reorganización y el sistema está en desacuerdo (Figura 1). Si reducimos el tiempo por bloque, tendremos una situación en la que se resolverá un número significativo de bloques en menos tiempo del que se tarda en transmitir un bloque resuelto a través de la red. Por lo tanto, no habrá forma de saber qué bloque es el eal\ y cuál es un \fork\ porque las transacciones que parecían tener múltiples confirmaciones de repente tienen menos confirmaciones (o posiblemente vuelven a estar sin confirmar).

source: Figure 1: Increasing block frequency with static block size will result in less security.
es: Figura 1: El aumento de la frecuencia de los bloques con un tamaño de bloque estático dará como resultado una menor seguridad.

source: The throughput of a system is bounded by the maximum block size (given a fixed block interval), as the maximum number of included transactions is directly dependent on the block size.
es: El rendimiento de un sistema está limitado por el tamaño máximo del bloque (dado un intervalo de bloque fijo), ya que el número máximo de transacciones incluidas depende directamente del tamaño del bloque.

source: Larger blocks do however cause slower propagation speeds, which causes more discarded blocks (orphaning risk). An unlimited blocksize could, for example, result in a DoS attack on the system by creating a block that takes a long time to validate. If the choice is to Increase block size in order to improve throughput, there will be Network spikes with longer time to propagate in the network (Figure 2).
es: Sin embargo, los bloques más grandes causan velocidades de propagación más lentas, lo que genera más bloques descartados (riesgo de huérfano). Un tamaño de bloque ilimitado podría, por ejemplo, dar lugar a un ataque DoS en el sistema al crear un bloque que tarda mucho tiempo en validarse. Si la opción es aumentar el tamaño del bloque para mejorar el rendimiento, habrá picos de red con más tiempo para propagarse en la red (Figura 2).

source: Figure 2: Increasing block size with Static block frequency will lead to more discarded blocks and network spikes.
es: Figura 2: aumentar el tamaño del bloque con la frecuencia de bloque estático dará lugar a más bloques descartados y picos de red.

source: Brief Summary of Bitcoin-M5
es: Breve Resumen de Bitcoin-M5

source: It is a next-generation blockchain protocol which is an alternative bitcoin scaling solution that does not involve increasing the size of blocks or decreasing the block time interval. This reduces the risk of forks amongst other advantages. Bitcoin-M5 describes that the basic tradeoffs in Bitcoin can be reduced with an alternative blockchain protocol, offering a consensus delay and bandwidth limited only by the Network Plane. The protocol splits time into time periods(epoch). In each time period, a particular leader is responsible for serializing transactions (Figure 3). The leaders take the rule of generating blocks:
es: Es un protocolo de cadena de bloques de nueva generación que es una solución alternativa de escalado de bitcoin que no implica aumentar el tamaño de los bloques ni disminuir el intervalo de tiempo del bloque. Esto reduce el riesgo de horquillas entre otras ventajas. Bitcoin-M5 describe que las compensaciones básicas en Bitcoin se pueden reducir con un protocolo de cadena de bloques alternativo, que ofrece un retraso de consenso y un ancho de banda limitado solo por el plano de la red. El protocolo divide el tiempo en períodos de tiempo (época). En cada período de tiempo, un líder en particular es responsable de serializar las transacciones (Figura 3). Los líderes toman la regla de generar bloques:

source: Key blocks for the election of a leader.
es: Bloques clave para la elección de un líder.

source: Micro blocks for ledger records.
es: Microbloques para registros contables.

source: Figure 3: Bitcoin-M5 time periods structure with serializing transactions.
es: Figura 3: estructura de períodos de tiempo de Bitcoin-M5 con transacciones serializadas.

source: DecentralChain-M5 Overlay
es: Marco DecentralChain-M5

source: DecentralChain-M5 is based on the bitcoin next generation protocol that serializes transactions and offers important improvements in the transaction latency(lower latency) and bandwidth(higher throughput) in comparison to Bitcoin without sacrificing other properties. DecentralChain approaches this scalability matter by providing the miner with the ability to farm a block during the time of mining in a continuous approach. This block continues increments called liquid blocks. This liquid block is unchangeable over time once the next block referencing is created and appended. This approach increases effective bandwidth and speed of block creation, which is described as being “especially significant for businesses” using the DecentralChain-M5 protocol since it allows for conducting micro-transactions - without any delays that are typical with traditional blockchain systems. Furthermore, it allows the blockchain to withstand high loads, such as distribution of tokens following crowdsales and airdrops of bonus tokens. The speed of processing trading transactions on the exchange gets increased as well.
es: DecentralChain-M5 se basa en el protocolo de próxima generación de bitcoin que serializa las transacciones y ofrece importantes mejoras en la latencia de la transacción (menor latencia) y el ancho de banda (mayor rendimiento) en comparación con Bitcoin sin sacrificar otras propiedades. DecentralChain aborda esta cuestión de escalabilidad al proporcionar al minero la capacidad de cultivar un bloque durante el tiempo de minería en un enfoque continuo. Este bloque continúa con incrementos llamados bloques líquidos. Este bloque líquido no se puede cambiar con el tiempo una vez que se crea y se agrega la siguiente referencia de bloque. Este enfoque aumenta el ancho de banda efectivo y la velocidad de creación de bloques, que se describe como "especialmente importante para las empresas" que utilizan el protocolo DecentralChain-M5, ya que permite realizar microtransacciones, sin los retrasos típicos de los sistemas de cadena de bloques tradicionales. Además, permite que la cadena de bloques soporte grandes cargas, como la distribución de tokens después de las ventas masivas y los lanzamientos aéreos de tokens de bonificación. La velocidad de procesamiento de transacciones comerciales en el intercambio también aumenta.

source: DecentralChain-M5 Operations
es: Operaciones DecentralChain-M5

source: The main and core idea of DecentralChain-M5 is to split the Liquid block into two types, Key blocks and Micro blocks. The process of creating liquid block works as follows:
es: La idea principal y central de DecentralChain-M5 es dividir el bloque Liquid en dos tipos, Key blocks y Microblocks. El proceso de creación de bloques líquidos funciona de la siguiente manera:

source: The miner node gets the permission to create a block.
es: El nodo minero obtiene el permiso para crear un bloque.

source: The miner node creates and sends the key block (which does not contain transactions).
es: El nodo minero crea y envía el bloque de claves (que no contiene transacciones).

source: The miner node creates and sends the micro blocks (which contain transactions just as in normal blocks with a reference to previous micro blocks or key blocks) with a mining time interval of three seconds.
es: El nodo minero crea y envía los microbloques (que contienen transacciones como en los bloques normales con referencia a microbloques o bloques clave anteriores) con un intervalo de tiempo de minería de tres segundos.

source: Miners will mine those micro blocks and propagate them directly to the network until the next new key block appears with a reference to the liquid block.
es: Los mineros extraerán esos microbloques y los propagarán directamente a la red hasta que aparezca el siguiente bloque clave nuevo con una referencia al bloque líquido.

source: All of the transactions are part of the same block and are contributed all together. In between blocks, the traditional Bitcoin system appears idle to an onlooker, as miners are working to discover the next block, but without apparent progress on the consensus front. In contradiction, in DecentralChain-M5, the key-blocks can be small because they need to contain only the coinbase transaction, which defines the public key that the miner will be using to sign microblocks. Because a key-block requires proof of stake, miners can not just produce one and expropriate the leadership at will. Following the key-block, the lead miner can quickly issue microblocks, simply by signing them with the private key corresponding to the public key named in the key-block’s coinbase (Figure 4).
es: Todas las transacciones son parte del mismo bloque y se aportan todas juntas. Entre bloques, el sistema tradicional de Bitcoin parece inactivo para un espectador, ya que los mineros están trabajando para descubrir el siguiente bloque, pero sin un progreso aparente en el frente del consenso. En contradicción, en DecentralChain-M5, los bloques de claves pueden ser pequeños porque necesitan contener solo la transacción coinbase, que define la clave pública que el minero usará para firmar microbloques. Debido a que un bloque clave requiere una prueba de participación, los mineros no pueden simplemente producir uno y expropiar el liderazgo a voluntad. Siguiendo el bloque de claves, el minero principal puede emitir rápidamente microbloques, simplemente firmándolos con la clave privada correspondiente a la clave pública nombrada en la base de monedas del bloque de claves (Figura 4).

source: Figure 4: Key-blocks and Micro-blocks signing process.
es: Figura 4: Proceso de firma de Key-blocks y Micro-blocks.

source: :strong:`Leader Blocks`
es: :strong:`Bloques líder`

source: They’re also called "Key Blocks", these blocks are generated with proof of stake but do not contain transactions. They serve as a leader election mechanism and contain a public key that identifies the chosen leader. Each block has a header that contains, among other fields, the unique reference of its predecessor which is a cryptographic hash of the predecessor header (either a key block or a microblock).
es: También se denominan "Bloques Clave", estos bloques se generan con prueba de participación pero no contienen transacciones. Sirven como mecanismo de elección de líder y contienen una clave pública que identifica al líder elegido. Cada bloque tiene un encabezado que contiene, entre otros campos, la referencia única de su predecesor, que es un hash criptográfico del encabezado anterior (ya sea un bloque clave o un microbloque).

source: :strong:`Micro Blocks`
es: :strong:`Micro Bloques`
