Repository: Decentral-America/docs
Catalog: docs/locales/*/LC_MESSAGES/02_decentralchain.po
Languages: es

source: Smart asset is a :ref:`token <02_decentralchain/02_token(asset):Token (Asset)>` that has an :ref:`asset script <03_ride-language/04_script-types:Asset Script>` assigned to it. By default, tokens on the DecentralChain blockchain are not smart contracts, and any transactions with them are allowed. The script endows a token with functionality that sets the rules for its circulation. Each transaction involving a smart asset is automatically checked against the conditions specified in the script. If the asset's script allows the transaction, it will be executed; if the script denies the transaction, it is either not put onto the blockchain at all or saved as failed (for details, see the :ref:`transaction validation <02_decentralchain/03_transaction:Transaction Validation>` article).
es: El activo inteligente es un :ref:`token <02_decentralchain/02_token(asset):Token (Asset)>` que tiene un :ref:`script de activo <03_ride-language/04_script-types:Asset Script>` asignado. De forma predeterminada, los tokens en la cadena de bloques DecentralChain no son contratos inteligentes y se permite cualquier transacción con ellos. El script dota a un token de una funcionalidad que establece las reglas para su circulación. Cada transacción que involucra un activo inteligente se verifica automáticamente con las condiciones especificadas en el script. Si el script de activo permite la transacción, se ejecutará; si el script niega la transacción, no se coloca en la cadena de bloques o se guarda como fallida (para obtener más detalles, consulte el artículo sobre :ref:`validación de transacción <02_decentralchain/03_transaction:Transaction Validation>`).

source: Using smart assets, you can implement various financial instruments on the blockchain (options, interval trading, taxation), game mechanics (allowing transactions only between characters with certain properties). Please note:
es: Usando activos inteligentes, puede implementar varios instrumentos financieros en la cadena de bloques (opciones, intercambio de intervalos, impuestos), mecánicas de juego (permitiendo transacciones solo entre personajes con ciertas propiedades). Tenga en cuenta:

source: If a token is issued without a script, then the script cannot be added later.
es: Si se emite un token sin una secuencia de comandos, entonces la secuencia de comandos no se puede agregar más tarde.

source: The script cannot be removed, so it is impossible to turn a smart asset into a regular one.
es: El script no se puede eliminar, por lo que es imposible convertir un activo inteligente en uno normal.

source: The asset script can be changed using the :ref:`set asset script transaction <02_decentralchain/03_transaction:Set Asset Script Transaction>`, unless prohibited by the asset script itself (as well as by the :ref:`dApp or account script <02_decentralchain/01_account:dApp and Smart Account>` assigned to the issuer account).
es: El script de activos se puede cambiar usando la :ref:`transacción para asignar scripts de activos <02_decentralchain/03_transaction:Set Asset Script Transaction>`, a menos que lo prohíba el propio script de activos (así como :ref:`dApp o script de cuenta < 02_decentralchain/01_account:dApp y Smart Account>` asignado a la cuenta del emisor).

source: The :ref:`minimum fee <02_decentralchain/03_transaction:Minimum Fee>` for transaction is increased by :math:`0.004` DecentralCoins for each smart asset involved, except for:
es: La :ref:`tarifa mínima <02_decentralchain/03_transaction:Minimum Fee>` por transacción se incrementa en :math:`0.004` DecentralCoins por cada activo inteligente involucrado, excepto por:

source: :ref:`Invoke script transactions <02_decentralchain/03_transaction:Invoke Script Transaction>`,
es: :ref:`Transacción para invocar scripts <02_decentralchain/03_transaction:Invoke Script Transaction>`,

source: Smart assets used as matcher fee in :ref:`exchange transaction <02_decentralchain/03_transaction:Exchange Transaction>`.
es: Activos inteligentes utilizados como tarifa del emparejador en :ref:`transacción para intercambio <02_decentralchain/03_transaction:Exchange Transaction>`.

source: Tokens of Other Blockchains
es: Tokens de Otras Blockchain

source: A token issued on another blockchain cannot be used directly on the DecentralChain blockchain. A new token representing the original one can be issued on the DecentralChain blockchain, and a gateway that pegs the two tokens :math:`1:1` can be deployed.
es: Un token emitido en otra cadena de bloques no se puede usar directamente en la cadena de bloques DecentralChain. Se puede emitir un nuevo token que represente al original en la cadena de bloques DecentralChain, y se puede implementar una puerta de enlace que vincula los dos tokens :math:`1:1`.

source: DecentralCoin is the native :ref:`token <02_decentralchain/02_token(asset):Token (Asset)>` of the DecentralChain blockchain. :ref:`Block generators <02_decentralchain/05_node:Generating Node>` receive :ref:`transaction fees <02_decentralchain/03_transaction:Transaction Fees>` and :ref:`block rewards <02_decentralchain/05_node:Block Reward>` in DecentralCoins, which encourages generators to maintain and develop the blockchain network infrastructure. The more DecentralCoins the generator holds (by ownership or lease), the greater its chance to add the next block is.
es: DecentralCoin es el :ref:`token nativo <02_decentralchain/02_token(asset):Token (Asset)>` de la cadena de bloques DecentralChain. :ref:`Los generadores de bloques <02_decentralchain/05_node:Generating Node>` reciben :ref:`tarifas de transacción <02_decentralchain/03_transaction:Transaction Fees>` y :ref:`recompensas por bloque <02_decentralchain/05_node:Block Reward>` en DecentralCoins, que alienta a los generadores a mantener y desarrollar la infraestructura de la red blockchain. Cuantas más DecentralCoins tenga el generador (por propiedad o arrendamiento), mayores serán sus posibilidades de agregar el siguiente bloque.

source: DecentralCoin Parameters
es: Parámetros de DecentralCoin

source: DecentralCoins are present on the blockchain since inception, there is no issue transaction for it, therefore the DecentralCoin token does not have an ID. The REST API uses null for DecentralCoins. The number of decimal places (decimals) for DecentralCoins is :math:`8`. The atomic unit called Decentralite is :math:`\frac{1}{100,000,000}` DecentralCoins.
es: Los DecentralCoins están presentes en la cadena de bloques desde su inicio, no existe una transacción de emisión para ellas, por lo tanto, el token de DecentralCoin no tiene una identificación. La API REST usa nulo para DecentralCoins. El número de lugares decimales (decimales) para DecentralCoins es :math:`8`. La unidad atómica llamada Decentralite es :math:`\frac{1}{100,000,000}` DecentralCoins.

source: Leasing
es: Arrendamiento

source: The owner of DecentralCoins can lease them via a :ref:`lease transaction <02_decentralchain/03_transaction:Lease Transaction>`. DecentralCoins received on lease are included in the :ref:`generating balance <02_decentralchain/01_account:Account Balance>`. Block generators send back different percentages as rewards to lessors. A lessor can cancel the lease at any time via a :ref:`lease cancel transaction <02_decentralchain/03_transaction:Lease Cancel Transaction>`. :ref:`More about leasing <02_decentralchain/05_node:Leased Proof of Stake>`.
es: El propietario de DecentralCoins puede arrendarlas a través de una :ref:`transacción para arrendamiento <02_decentralchain/03_transaction:Lease Transaction>`. Las DecentralCoins recibidas en arrendamiento se incluyen en el :ref:`saldo generador <02_decentralchain/01_account:Account Balance>`. Los generadores de bloques devuelven diferentes porcentajes como recompensa a los arrendadores. Un arrendador puede cancelar el arrendamiento en cualquier momento a través de una :ref:`transacción para cancelar arrendamiento <02_decentralchain/03_transaction:Lease Cancel Transaction>`. :ref:`Más información sobre el arrendamiento <02_decentralchain/05_node:Leased Proof of Stake>`.

source: How to Get DecentralCoin
es: Cómo Obtener DecentralCoin

source: You can buy DecentralCoins tokens at `Decentral.Exchange <https://decentral.exchange/>`_, or at one of the centralized exchanges. In addition, cryptocurrency gateways can be used to transfer external cryptocurrencies such as Bitcoin, Ethereum etc. from the external blockchain to the DecentralChain blockchain and vice versa. The gateway provides the user with the address on the external blockchain. After receiving a confirmation of transfer to this external address, the gateway transfers the corresponding asset (minus the fee) to the user's DecentralChain address.
es: Puede comprar tokens DecentralCoins en `Decentral.Exchange <https://decentral.exchange/>`_, o en uno de los intercambios centralizados. Además, las puertas de enlace de criptomonedas se pueden usar para transferir criptomonedas externas como Bitcoin, Ethereum, etc. desde la cadena de bloques externa a la cadena de bloques DecentralChain y viceversa. La puerta de enlace proporciona al usuario la dirección en la cadena de bloques externa. Después de recibir una confirmación de transferencia a esta dirección externa, la puerta de enlace transfiere el activo correspondiente (menos la tarifa) a la dirección DecentralChain del usuario.

source: Token Custom Parameters
es: Parámetros Personalizados de Token

source: Below is an example of JSON representation returned by the GET /assets/details/{assetId} method of :ref:`Node REST API <documentation:placeholder>`:
es: A continuación se muestra un ejemplo de representación JSON devuelta por el método GET /assets/details/{assetId} de :ref:`Node REST API <documentation:placeholder>`:

source: Field
es: Campo

source: Description
es: Descripción

source: Token ID: base58 encoded byte array. The token ID is calculated as a hash of the token parameters upon issue. See also the :ref:`token ID <02_decentralchain/02_token(asset):Token ID>` article.
es: ID de token: matriz de bytes codificados en base58. El identificador del token se calcula como un hash de los parámetros del token en el momento de la emisión. Consulte también el artículo sobre el :ref:`ID del token <02_decentralchain/02_token(asset):Token ID>`.

source: Blockchain height (the sequence number of the block) at which the token is issued.
es: Altura de la cadena de bloques (el número de secuencia del bloque) en la que se emite el token.

source: Token issue timestamp: Unix time in milliseconds.
es: Marca de tiempo de emisión del token: tiempo Unix en milisegundos.

source: :ref:`address <02_decentralchain/01_account:Address>` of issuer account: base58 encoded byte array.
es: :ref:`dirección <02_decentralchain/01_account:Address>` de la cuenta del emisor: matriz de bytes codificados en base58.

source: :ref:`Public key <02_decentralchain/01_account:Account Keys>` of issuer account: base58 encoded byte array.
es: :ref:`Llave pública <02_decentralchain/01_account:Account Keys>` de la cuenta del emisor: matriz de bytes codificada en base58.

source: Token name. From :math:`4` to :math:`16` bytes (:math:`1` character can take up to :math:`4` bytes).
es: Nombre del token. Desde :math:`4` hasta :math:`16` bytes (el carácter :math:`1` puede ocupar hasta :math:`4` bytes).

source: Token description. From :math:`0` to :math:`1000` bytes.
es: Descripción del token. Desde :math:`0` hasta :math:`1000` bytes.

source: Number of decimal places, from :math:`0` to :math:`8`.
es: Número de decimales, desde :math:`0` hasta :math:`8`.

source: Reissue availability flag.
es: Vuelva a emitir el indicador de disponibilidad.

source: Total supply of token on the blockchain specified in :ref:`atomic units <02_decentralchain/02_token(asset):Atomic Unit>`. From :math:`1` to :math:`9,223,372,036,854,775,807`. Total supply can change as a result of reissue or burning, see :ref:`token operations <02_decentralchain/02_token(asset):Token Operations>` below.
es: Suministro total de token en la cadena de bloques especificada en :ref:`unidades atómicas <02_decentralchain/02_token(asset):Atomic Unit>`. De :math:`1` a :math:`9,223,372,036,854,775,807`. El suministro total puede cambiar como resultado de la reemisión o la quema, consulte :ref:`operaciones de tokens <02_decentralchain/02_token(asset):Token Operations>` a continuación.

source: There being a script: true for smart asset, false for regular token. :ref:`More about smart assets <02_decentralchain/02_token(asset):Smart Asset>`.
es: Al haber un script: verdadero para activo inteligente, falso para token normal. :ref:`Más sobre activos inteligentes <02_decentralchain/02_token(asset):Smart Asset>`.

source: For sponsored asset only: an amount of asset that is equivalent to :math:`0.001` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`. :ref:`More about sponsorship <02_decentralchain/03_transaction:Sponsored Fees>`.
es: Solo para activos patrocinados: una cantidad de activos equivalente a :math:`0.001` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`. :ref:`Más sobre el patrocinio <02_decentralchain/03_transaction:Sponsored Fees>`.

source: ID of the :ref:`transaction <02_decentralchain/03_transaction:Transaction>` that issued the token: base58 encoded byte array.
es: ID de la :ref:`transacción <02_decentralchain/03_transaction:Transaction>` que emitió el token: matriz de bytes codificados en base58.

source: For :ref:`smart asset <02_decentralchain/02_token(asset):Smart Asset>` only: :ref:`asset script <03_ride-language/04_script-types:Asset Script>` and its attributes.
es: Solo para :ref:`activos inteligentes <02_decentralchain/02_token(asset):Smart Asset>`: :ref:`scripts de activos <03_ride-language/04_script-types:Asset Script>` y sus atributos.

source: Atomic Unit
es: Unidad Atómica

source: The amount of token is displayed differently in UIs and in the :ref:`JSON representation <02_decentralchain/03_transaction:JSON Representation>` used by the :ref:`Node REST API <documentation:placeholder>`. In API requests and responses, amount values are integers indicated in atomic units to avoid precision issues in floating-point calculations. An atomic unit is the minimum fraction (“cent”) of a token, it is equal to :math:`10^{-decimals}`. The amount of token in JSON is the real quantity multiplied by :math:`10^{decimals}`.
es: La cantidad de token se muestra de manera diferente en las interfaces de usuario y en la :ref:`Representación JSON <02_decentralchain/03_transaction:JSON Representation>` utilizada por :ref:`Node REST API <documentation:placeholder>`. En las solicitudes y respuestas de la API, los valores de cantidad son números enteros indicados en unidades atómicas para evitar problemas de precisión en los cálculos de punto flotante. Una unidad atómica es la fracción mínima ("centavo") de una ficha, es igual a :math:`10^{-decimals}`. La cantidad de token en JSON es la cantidad real multiplicada por :math:`10^{decimals}`.

source: For USD-N in the example above:
es: Para USD-N en el ejemplo anterior:

source: atomic unit is :math:`\frac{1}{1,000,000}` USD-N.
es: la unidad atómica es :math:`\frac{1}{1,000,000}` USD-N.

source: "quantity": :math:`999999999471258900` corresponds to :math:`999,999,999,471.258900` USD-N in UIs, "minSponsoredAssetFee": :math:`7420` corresponds to :math:`0.007420` USD-N.
es: \quantity\: :math:`999999999471258900` corresponde a :math:`999,999,999,471.258900` USD-N en IU, \minSponsoredAssetFee\: :math:`7420` corresponde a :math:`0.007420` USD-N.

source: Transaction
es: Transacción

source: Transaction Issue
es: Emisión de Transacción

source: How to Sign and Send Transactions
es: Cómo Firmar y Enviar Transacciones

source: In `Decentral.Exchange <https://decentral.exchange/>`_ you can create some types of transactions such as transfer, issue/reissue/burn, sponsor fee transaction, set asset script, create alias.
es: En `Decentral.Exchange <https://decentral.exchange/>`_ puede crear algunos tipos de transacciones como transferencia, emisión/reemisión/quemado, patrocinio de tarifas, asignar scripts, crear alias.

source: Via :ref:`Node REST API <documentation:placeholder>`:
es: A través de :ref:`Node REST API <documentation:placeholder>`:

source: The POST /transactions/broadcast method sends a signed transaction to a node;
es: El método POST /transactions/broadcast envía una transacción firmada a un nodo;

source: The POST /transactions/sign method generates transaction signature (but this method is only available to the node owner).
es: El método POST /transactions/sign genera la firma de la transacción (pero este método solo está disponible para el propietario del nodo).

source: Transaction Sender and Signature
es: Remitente de Transacción y Firma

source: Each transaction contains the public key of the sender’s account, on behalf of which the action is performed on the blockchain. :ref:`Smart accounts and dApps <02_decentralchain/01_account:dApp and Smart Account>` can set their own rules for outgoing transactions verification.
es: Cada transacción contiene la llave pública de la cuenta del remitente, en cuyo nombre se realiza la acción en la cadena de bloques. :ref:`Las cuentas inteligentes y dApps <02_decentralchain/01_account:dApp and Smart Account>` pueden establecer sus propias reglas para la verificación de transacciones salientes.

source: Transactions that are sent from an ordinary account (without script) must contain the sender's digital signature. The sender generates a signature using the account's private key. Along with the signature, the transaction contains the sender's public key, so the node (and anyone) can verify the integrity of the transaction data and the authenticity of the signature, that is, make sure that the signature of the transaction matches the public key.
es: Las transacciones que se envían desde una cuenta ordinaria (sin script) deben contener la firma digital del remitente. El remitente genera una firma utilizando la clave privada de la cuenta. Junto con la firma, la transacción contiene la clave pública del remitente, por lo que el nodo (y cualquiera) puede verificar la integridad de los datos de la transacción y la autenticidad de la firma, es decir, asegurarse de que la firma de la transacción coincida con la clave pública. .

source: After Transaction is Sent
es: Después de Enviar la Transacción

source: Upon receiving a transaction, the node validates its signature, checks the sender's balance, and so on, see the :ref:`transaction validation <02_decentralchain/03_transaction:Transaction Validation>` article for details. If the transaction is valid, the node puts the transaction to the UTX pool, which is a list of transactions awaiting to be added, and also broadcasts the transaction to other nodes of the blockchain network.
es: Al recibir una transacción, el nodo valida su firma, verifica el saldo del remitente, etc. Consulte el artículo :ref:`validación de transacciones <02_decentralchain/03_transaction:Transaction Validation>` para obtener más detalles. Si la transacción es válida, el nodo coloca la transacción en el grupo UTX, que es una lista de transacciones que esperan agregarse, y también transmite la transacción a otros nodos de la red blockchain.

source: Due to block size limitation (:math:`1` MB) the transaction may not get to the block immediately. First of all, nodes add the most “profitable” transactions with the highest fee per byte. After being added to a block, the transaction changes the blockchain state: account balances, records in the account data storage, and so on. The transaction may never be added to a block if it becomes invalid while waiting in the UTX pool. For example, the transaction has expired (the timestamp is more than :math:`2` hours behind current time) or another transaction has changed the blockchain state and now the sender's balance is insufficient to execute the transaction or the account or asset script denies the transaction.
es: Debido a la limitación del tamaño del bloque (:math:`1` MB), es posible que la transacción no llegue al bloque de inmediato. En primer lugar, los nodos agregan las transacciones más "rentables" con la tarifa más alta por byte. Después de agregarse a un bloque, la transacción cambia el estado de la cadena de bloques: saldos de cuenta, registros en el almacenamiento de datos de la cuenta, etc. Es posible que la transacción nunca se agregue a un bloque si deja de ser válida mientras espera en el grupo UTX. Por ejemplo, la transacción ha caducado (la marca de tiempo tiene más de :math:`2` horas de atraso con respecto a la hora actual) u otra transacción ha cambiado el estado de la cadena de bloques y ahora el saldo del remitente es insuficiente para ejecutar la transacción o la secuencia de comandos de la cuenta o del activo niega la transacción.

source: Transaction Proofs
es: Pruebas de Transacciones

source: Verification by Script
es: Verificación por Script

source: If the transaction sender is a :ref:`dApp or smart account <02_decentralchain/01_account:dApp and Smart Account>`, then the transaction is verified by the script assigned to the account instead of signature verification. The script allows or denies the transaction depending on whether it meets the specified conditions. In particular, the script can run various verifications of the proofs.
es: Si el remitente de la transacción es una :ref:`dApp o cuenta inteligente <02_decentralchain/01_account:dApp y Smart Account>`, la transacción se verifica mediante el script asignado a la cuenta en lugar de la verificación de la firma. El script permite o deniega la transacción dependiendo de si cumple las condiciones especificadas. En particular, el script puede ejecutar varias verificaciones de las pruebas.

source: A common example is a smart account with a multisignature where three co-owner users store shared funds.
es: Un ejemplo común es una cuenta inteligente con una firma múltiple donde tres usuarios copropietarios almacenan fondos compartidos.

source: Transaction Fees
es: Tarifas de Transacción
