Repository: Decentral-America/docs
Catalog: docs/locales/*/LC_MESSAGES/02_decentralchain.po
Languages: es

source: :ref:`Public key <02_decentralchain/01_account:Account Keys>` of the transaction sender: base58 encoded byte array.
es: :ref:`Llave pública <02_decentralchain/01_account:Account Keys>` del remitente de la transacción: matriz de bytes codificada en base58.

source: :ref:`address <02_decentralchain/01_account:Address>` of the transaction sender: base58 encoded byte array.
es: :ref:`Address <02_decentralchain/01_account:Address>` del remitente de la transacción: matriz de bytes codificados en base58.

source: ID of the fee token. null means that the fee is in :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`. The sender can specify the fee for :ref:`invoke script transactions <02_decentralchain/03_transaction:Invoke Script Transaction>` and :ref:`transfer transactions <02_decentralchain/03_transaction:Transfer Transaction>` in a sponsored asset, see the :ref:`sponsored fee <02_decentralchain/03_transaction:Sponsored Fees>` article for details.
es: ID del token de tarifa. null significa que la tarifa está en :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`. El remitente puede especificar la tarifa para :ref:`transacciones para invocar scripts <02_decentralchain/03_transaction:Invoke Script Transaction>` y :ref:`transacciones para transferencia <02_decentralchain/03_transaction:Transfer Transaction>` en un activo patrocinado, consulte el artículo sobre :ref:`tarifas patrocinadas <02_decentralchain/03_transaction:Sponsored Fees>` para obtener más detalles.

source: Array of :ref:`transaction proofs <02_decentralchain/03_transaction:Transaction Proofs>`. Up to :math:`8` proofs, each proof up to :math:`64` bytes base58 encoded.
es: Matriz de :ref:`pruebas de transacción <02_decentralchain/03_transaction:Transaction Proofs>`. Hasta :math:`8` pruebas, cada prueba hasta :math:`64` bytes codificados en base58.

source: :ref:`Transaction fee <02_decentralchain/03_transaction:Transaction Fees>`: an integer value indicated in the minimum fraction (“cent”) of the fee asset. For example, if the fee is :math:`0.001` DecentralCoins, :math:`100000` is indicated in the JSON representation, so far as :math:`1` DecentralCoin = :math:`10^{8}` Decentralites.
es: :ref:`Tarifa de transacción <02_decentralchain/03_transaction:Transaction Fees>`: un valor entero indicado en la fracción mínima ("centavo") del activo de la tarifa. Por ejemplo, si la tarifa es :math:`0.001` DecentralCoins, :math:`100000` se indica en la representación JSON, hasta :math:`1` DecentralCoin = :math:`10^{8}` Decentralites .

source: Transaction ID. For the transaction ID calculation method, see the :ref:`cryptographic practical details <02_decentralchain/09_protocol:Cryptographic Practical Details>` article.
es: ID de transacción. Para conocer el método de cálculo del ID de transacción, consulte el artículo :ref:`detalles prácticos criptográficos <02_decentralchain/09_protocol:Cryptographic Practical Details>`.

source: Transaction type. Type IDs are listed in the :ref:`transaction type <02_decentralchain/03_transaction:Transaction Types>` article.
es: Tipo de transacción. Los ID de tipo se enumeran en el artículo :ref:`tipos de transacción <02_decentralchain/03_transaction:Transaction Types>`.

source: Transaction version. Versions for each type of transaction are listed in :ref:`transaction binary format <02_decentralchain/10_binary-format:Transaction Binary Format>` descriptions.
es: Versión de transacción. Las versiones para cada tipo de transacción se enumeran en las descripciones del :ref:`formato binario de transacción <02_decentralchain/10_binary-format:Transaction Binary Format>`.

source: Status of transaction execution: 1) succeeded: transaction is successful. 2) script_execution_failed: the dApp script or the asset script failed. See the :ref:`transaction validation <02_decentralchain/03_transaction:Transaction Validation>` article for details.
es: Estado de ejecución de la transacción: 1) exitosa: la transacción es exitosa. 2) script_execution_failed: el script de dApp o el script de activos falló. Consulte el artículo :ref:`transaction validation <02_decentralchain/03_transaction:Transaction Validation>` para obtener más detalles.

source: Transaction timestamp specified by the sender: Unix time in milliseconds. The transaction cannot be added to the blockchain if the timestamp value is more than :math:`2` hours behind or :math:`1.5` hours ahead of current block timestamp."
es: Marca de tiempo de la transacción especificada por el remitente: tiempo Unix en milisegundos. La transacción no se puede agregar a la cadena de bloques si el valor de la marca de tiempo tiene más de :math:`2` horas de atraso o :math:`1.5` horas antes de la marca de tiempo del bloque actual.\

source: The sequence number of the block that contains the transaction.
es: El número de secuencia del bloque que contiene la transacción.

source: The sender, id, applicationStatus, and height fields do not need to be filled when sending a transaction, and they are not stored on the blockchain. The node calculates these fields when providing transaction data via the Node REST API. The fields that depend on the type of transaction are listed in the description of each :ref:`type of transaction <02_decentralchain/03_transaction:Transaction Types>`.
es: No es necesario completar los campos de remitente, ID, aplicationStatus y altura al enviar una transacción, y no se almacenan en la cadena de bloques. El nodo calcula estos campos cuando proporciona datos de transacciones a través de la API REST del nodo. Los campos que dependen del tipo de transacción se enumeran en la descripción de cada :ref:`tipo de transacción <02_decentralchain/03_transaction:Transaction Types>`.

source: Transactions are stored on the blockchain in the binary format (byte representation). :ref:`Node extensions <documentation:placeholder>` such as :ref:`gRPC server <documentation:placeholder>` can work directly with data in binary format. The transaction signature and ID are also formed on the basis of the binary format. The guideline for generating a signature and ID is given in the :ref:`cryptographic practical details <02_decentralchain/09_protocol:Cryptographic Practical Details>` article. Transaction binary format is described in the :ref:`transaction binary format <02_decentralchain/10_binary-format:Transaction Binary Format>` article.
es: Las transacciones se almacenan en la cadena de bloques en formato binario (representación de bytes). :ref:`Las extensiones de nodo <documentation:placeholder>` como :ref:`servidor gRPC <documentation:placeholder>` pueden trabajar directamente con datos en formato binario. La firma de la transacción y la identificación también se forman sobre la base del formato binario. La guía para generar una firma y una identificación se proporciona en el artículo :ref:`detalles prácticos criptográficos <02_decentralchain/09_protocol:Cryptographic Practical Details>`. El formato binario de transacción se describe en el artículo :ref:`formato binario de transacción <02_decentralchain/10_binary-format:Transaction Binary Format>`.

source: You can get the transaction by ID, or the list of transactions by certain account address, or the list of all transactions in the block:
es: Puedes obtener la transacción por ID, o la lista de transacciones por determinada dirección de cuenta, o la lista de todas las transacciones en el bloque:

source: In `DecentralChain Explorer <https://decentralscan.com/>`_.
es: En `DecentralChain Explorer <https://decentralscan.com/>`_.

source: Via :ref:`Node REST API <documentation:placeholder>` using the following methods:
es: A través de :ref:`Node REST API <documentation:placeholder>` usando los siguientes métodos:

source: GET /transactions/info/{id} returns transaction data by transaction ID.
es: GET /transactions/info/{id} devuelve datos de transacción por ID de transacción.

source: GET /transactions/address/{address}/limit/{limit} returns the list of transactions where the specified address is involved.
es: GET /transactions/address/{address}/limit/{limit} devuelve la lista de transacciones en las que está involucrada la dirección especificada.

source: GET /blocks/at/{height} returns block data at the specified height including all transactions in the block.
es: GET /blocks/at/{height} devuelve los datos del bloque a la altura especificada, incluidas todas las transacciones del bloque.

source: Transaction Types
es: Tipos de Transacciones

source: Tokenization
es: Tokenización

source: Name
es: Nombre

source: Issues a token.
es: Emite un token.

source: Reissues a token.
es: Reemite un token.

source: Decreases the amount of token.
es: Disminuye la cantidad de token.

source: Modifies the asset script.
es: Modifica el script del activo.

source: Changes the token name and description.
es: Cambia el nombre y la descripción del token.

source: Issue Transaction
es: Transacción para Emisión

source: Issue transaction creates a new :ref:`token <02_decentralchain/02_token(asset):Token (Asset)>`.
es: La transacción para emisión crea un nuevo :ref:`token <02_decentralchain/02_token(asset):Token (Asset)>`.

source: :strong:`Fee`
es: :strong:`Tarifa`

source: The :ref:`minimum fee <02_decentralchain/03_transaction:Minimum Fee>` for an issue transaction is :math:`1` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`, in case of issue of a :ref:`non-fungible tokens (NFT) <02_decentralchain/02_token(asset):Non-Fungible Token>` :math:`0.001` DecentralCoins.
es: La :ref:`tarifa mínima <02_decentralchain/03_transaction:Minimum Fee>` para una transacción de emisión es :math:`1` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`, en caso de emisión de un :ref:`token no fungible (NFT) <02_decentralchain/02_token(activo):Non-Fungible Token>` :math:`0.001` DecentralCoins.

source: If the transaction sender is a :ref:`dApp or smart account <02_decentralchain/01_account:dApp and Smart Account>`, and the complexity of the account script or dApp script verifier function exceeds the :ref:`sender complexity threshold <03_ride-language/07_dapp-to-app-invocation:Limitations>`, the minimum fee is increased by :math:`0.004` DecentralCoins.
es: Si el remitente de la transacción es una :ref:`dApp o una cuenta inteligente <02_decentralchain/01_account:dApp and Smart Account>`, y la complejidad de la secuencia de comandos de la cuenta o la función del verificador de la secuencia de comandos de la dApp supera el :ref:`umbral de complejidad del remitente <03_ride-language/07_dapp-to-app-invocation:Limitations>`, la tarifa mínima se incrementa en :math:`0.004` DecentralCoins.

source: :strong:`JSON Representation`
es: :strong:`Representación JSON`

source: Issue Transaction JSON Representation
es: Representación JSON de Transacción para Emisión

source: Token quantity: an integer value specified in the minimum fraction (“cents”), that is, the real quantity multiplied by :math:`10^{decimals}`. From :math:`1` to :math:`9,223,372,036,854,775,807`. :math:`1` for NFT.
es: Cantidad de token: un valor entero especificado en la fracción mínima ("centavos"), es decir, la cantidad real multiplicada por :math:`10^{decimales}`. De :math:`1` a :math:`9,223,372,036,854,775,807`. :math:`1` para NFT.

source: Number of decimal places, from :math:`0` to :math:`8`. :math:`0` for NFTs.
es: Número de decimales, desde :math:`0` hasta :math:`8`. :math:`0` para NFT.

source: Reissue availability flag, see the :ref:`reissue transaction <02_decentralchain/03_transaction:Reissue Transaction>` article. False for NFTs.
es: Indicador de disponibilidad de reemisión, consulte el artículo :ref:`reemitir transacción <02_decentralchain/03_transaction:Reissue Transaction>`. Falso para NFT.

source: For the :ref:`smart asset <02_decentralchain/02_token(asset):Smart Asset>`: the compiled :ref:`Asset script <03_ride-language/04_script-types:Asset Script>`, up to :math:`8192` bytes, base64 encoded. For the token without a script: null. The token issued without a script cannot be converted to a smart asset.
es: Para un :ref:`activo inteligente <02_decentralchain/02_token(asset):Smart Asset>`: el :ref:`script de activo <03_ride-language/04_script-types:Asset Script>` compilado, hasta :math:`8192 ` bytes, codificado en base64. Para el token sin script: nulo. El token emitido sin un script no se puede convertir en un activo inteligente.

source: :ref:`Chain ID <02_decentralchain/08_mainnet-testnet-stagenet:Chain ID>`
es: :ref:`ID de cadena <02_decentralchain/08_mainnet-testnet-stagenet:Chain ID>`

source: Token ID base58 encoded. The token ID is the same as the Issue transaction ID.
es: Token ID codificado base58. El ID del token es el mismo que el ID de la transacción para emisión.

source: The assetId field does not need to be filled when sending a transaction, and it is not stored on the blockchain. The node calculates these fields when providing transaction data via the REST API. The fields that are common to all types of transactions are described in the :ref:`transaction <02_decentralchain/03_transaction:Transaction>` article.
es: No es necesario completar el campo assetId al enviar una transacción y no se almacena en la cadena de bloques. El nodo calcula estos campos cuando proporciona datos de transacciones a través de la API REST. Los campos que son comunes a todos los tipos de transacciones se describen en el artículo sobre :ref:`transacciones <02_decentralchain/03_transaction:Transaction>`.

source: :strong:`Binary Format`
es: :strong:`Formato Binario`

source: See the :ref:`issue transaction binary format <02_decentralchain/10_binary-format:Issue Transaction Binary Format>`.
es: Consulte el :ref:`formato binario de transacción para emisión <02_decentralchain/10_binary-format:Issue Transaction Binary Format>`.

source: :strong:`Ride Structure`
es: :strong:`Estructura Ride`

source: Reissue Transaction
es: Transacción para Reemisión

source: Reissue transaction increases the amount of the :ref:`token <02_decentralchain/02_token(asset):Token (Asset)>` on the blockchain and/or prohibits its reissue. Only the token issuer can send a reissue transaction. The additional amount of token increases the balance of the transaction sender. The reissuable field of the token determines whether the token can be reissued.
es: La transacción de reemisión aumenta la cantidad del :ref:`token <02_decentralchain/02_token(asset):Token (Asset)>` en la cadena de bloques y/o prohíbe su reemisión. Solo el emisor del token puede enviar una transacción de reemisión. La cantidad adicional de token aumenta el saldo del remitente de la transacción. El campo reemisible del token determina si el token se puede volver a emitir.

source: The :ref:`minimum fee <02_decentralchain/03_transaction:Minimum Fee>` for a reissue transaction is :math:`0.001` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`. If the token is a smart asset, the minimum fee is increased by :math:`0.004` DecentralCoins.
es: La :ref:`tarifa mínima <02_decentralchain/03_transaction:Minimum Fee>` para una transacción de reemisión es :math:`0.001` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`. Si el token es un activo inteligente, la tarifa mínima aumenta en :math:`0.004` DecentralCoins.

source: Reissue Transaction JSON Representation
es: Representación JSON de Transacción para Reemisión

source: Token ID base58 encoded.
es: Token ID codificado base58.

source: Amount of token to reissue: an integer value specified in the minimum fraction (“cents”) of token. The total quantity of token as a result of the reissue should not exceed :math:`9,223,372,036,854,775,807`.
es: Cantidad de token a reemitir: un valor entero especificado en la fracción mínima ("centavos") de token. La cantidad total de tokens como resultado de la reemisión no debe exceder :math:`9,223,372,036,854,775,807`.

source: The fields that are common to all types of transactions are described in the :ref:`transaction <02_decentralchain/03_transaction:Transaction>` article.
es: Los campos que son comunes a todos los tipos de transacciones se describen en el artículo sobre :ref:`transacciones <02_decentralchain/03_transaction:Transaction>`.

source: See the :ref:`reissue transaction binary format <02_decentralchain/10_binary-format:Reissue Transaction Binary Format>`.
es: Consulte el :ref:`formato binario de transacción para reemisión <02_decentralchain/10_binary-format:Reissue Transaction Binary Format>`.

source: Burn Transaction
es: Transacción para Quemado

source: Burn transaction decreases the amount of token on sender's account and thereby the total amount of the token on the blockchain. Any account that owns a token (not necessarily the token issuer) can send the burn transaction. Burned tokens cannot be restored back to the account.
es: La transacción para quemado disminuye la cantidad de token en la cuenta del remitente y, por lo tanto, la cantidad total del token en la cadena de bloques. Cualquier cuenta que posea un token (no necesariamente el emisor del token) puede enviar la transacción para quemado. Los tokens quemados no se pueden restaurar a la cuenta.

source: The :ref:`minimum fee <02_decentralchain/03_transaction:Minimum Fee>` for a burn transaction is :math:`0.001` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`, in case of burning a smart asset :math:`0.005` DecentralCoins.
es: La :ref:`tarifa mínima <02_decentralchain/03_transaction:Minimum Fee>` en una transacción para quemado es :math:`0.001` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`, en caso de quemar un activo inteligente :math:`0.005` DecentralCoins.

source: Burn Transaction JSON Representation
es: Representación JSON de Transacción para Quemado

source: Amount of token to burn: an integer value specified in the minimum fraction (“cents”) of token.
es: Cantidad de token para quemar: un valor entero especificado en la fracción mínima ("centavos") de token.

source: See the :ref:`burn transaction binary format <02_decentralchain/10_binary-format:Burn Transaction Binary Format>`.
es: Consulte el :ref:`formato binario de transacción para quemado <02_decentralchain/10_binary-format:Burn Transaction Binary Format>`.

source: Set Asset Script Transaction
es: Transacción para Asignar Scripts de Activos

source: Set asset script transaction replaces the :ref:`asset script <03_ride-language/04_script-types:Asset Script>`. Only the token issuer can send an asset script transaction. If a token is issued without a script, then no script can be assigned to it. It is also impossible to remove the script and turn the smart asset into a regular one.
es: La transacción para asignar scripts de activos reemplaza a :ref:`script de activo <03_ride-language/04_script-types:Asset Script>`. Solo el emisor del token puede enviar una transacción de script de activos. Si se emite un token sin un script, entonces no se le puede asignar ningún script. También es imposible eliminar el script y convertir el activo inteligente en uno normal.

source: The :ref:`minimum fee <02_decentralchain/03_transaction:Minimum Fee>` for a set asset script transaction is :math:`1` :ref:`DecentralCoin <02_decentralchain/02_token(asset):DecentralCoin>`.
es: La :ref:`tarifa mínima <02_decentralchain/03_transaction:Minimum Fee>` en una transacción para asignar scripts de activos establecida es :math:`1` :ref:`DecentralCoin <02_decentralchain/02_token(asset):DecentralCoin>`.

source: Set Asset Script Transaction JSON Representation
es: Representación JSON de Transacción para Asignar Scripts de Activos

source: Compiled asset script, up to :math:`8192` bytes, base64 encoded.
es: Script de activos compilado, hasta :math:`8192` bytes, codificado en base64.

source: See the :ref:`set asset script transaction binary format <02_decentralchain/10_binary-format:Set Asset Script Transaction Binary Format>`.
es: Consulte el :ref:`formato binario de transacción para asignar scripts de activos <02_decentralchain/10_binary-format:Set Asset Script Transaction Binary Format>`.

source: Update Asset Info Transaction
es: Transacción para Actualizar Información de Activos

source: Update asset info transaction modifies the name and description of the token.
es: La transacción para actualizar información de activos modifica el nombre y la descripción del token.

source: The :ref:`minimum fee <02_decentralchain/03_transaction:Minimum Fee>` for an update asset info transaction is :math:`0.001` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`, in case of a smart asset :math:`0.005` DecentralCoins.
es: La :ref:`tarifa mínima <02_decentralchain/03_transaction:Minimum Fee>` en una transacción actualizar información de activos es :math:`0.001` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`, en caso de una activo inteligente :math:`0.005` DecentralCoins.

source: Update Asset Info Transaction JSON Representation
es: Representación JSON de Transacción para Actualizar Información de Activos

source: Token name. From :math:`4` to :math:`16` bytes.
es: Nombre del token. Desde :math:`4` hasta :math:`16` bytes.

source: See the :ref:`update asset info transaction binary format <02_decentralchain/10_binary-format:Update Asset Info Transaction Binary Format>`.
es: Consulte el :ref:`formato binario de transacción para actualizar información de activos <02_decentralchain/10_binary-format:Update Asset Info Transaction Binary Format>`.

source: Usage
es: Utilización

source: Transfers a token to another account.
es: Transfiere un token a otra cuenta.

source: Exchanges two different tokens between two accounts. Contains two counter orders: a buy order and a sell order.
es: Intercambia dos tokens diferentes entre dos cuentas. Contiene dos contraórdenes: una orden de compra y una orden de venta.

source: Creates alias for the sender's address.
es: Crea un alias para la dirección del remitente.

source: Transfers a token, up to :math:`100` recipients.
es: Transfiere un token, hasta :math:`100` destinatarios.

source: Adds, modifies and deletes data entries in the sender's account data storage.
es: Agrega, modifica y elimina entradas de datos en el almacenamiento de datos de la cuenta del remitente.

source: Assigns the dApp script or account script to the sender's account.
es: Asigna el script de dApp o script de cuenta a la cuenta del remitente.

source: Invokes a callable function of a dApp.
es: Invoca una función invocable de una dApp.

source: Transfer Transaction
es: Transacción para Transferencia

source: Transfer transaction transfers a certain amount of token to another account.
es: La transacción de transferencia transfiere una cierta cantidad de token a otra cuenta.

source: The :ref:`minimum fee <02_decentralchain/03_transaction:Minimum Fee>` for a transfer transaction is :math:`0.001` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`, in case of transferring a smart asset :math:`0.005` DecentralCoins.
es: La :ref:`tarifa mínima <02_decentralchain/03_transaction:Minimum Fee>` en una transacción para transferencia es :math:`0.001` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`, en caso de transferir un activo inteligente :math:`0.005` DecentralCoins.

source: Transfer Transaction JSON Representation
es: Representación JSON de Transacción para Transferencia

source: Token ID base58 encoded. null means :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`.
es: Token ID base58 codificado. nulo significa :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`.
