Repository: Decentral-America/docs
Catalog: docs/locales/*/LC_MESSAGES/02_decentralchain.po
Languages: es

source: This improvement allows resisting stake grinding attacks aimed at influencing block generation randomness to skip miner's opportunity to create a block. The use of VRF makes signature generation unpredictable because of the need to know the private key for calculation. Only the holder of the private key can compute the hash, but verifying the correctness of the hash using the public key from block header is available to anyone.
es: Esta mejora permite resistir los ataques de molienda de estacas destinados a influir en la aleatoriedad de generación de bloques para omitir la oportunidad del minero de crear un bloque. El uso de VRF hace que la generación de firmas sea impredecible debido a la necesidad de conocer la clave privada para el cálculo. Solo el titular de la clave privada puede calcular el hash, pero cualquiera puede verificar la corrección del hash utilizando la clave pública del encabezado del bloque.

source: The VRF contains calculateVRF function, which calculates proof for some message, and verifyVRF function, which verifies proof from calculateVRF function with a message and the public key of the signer. Considering that a block’s generation signature is equal to calculateVRF output for a previous generation signature with account private key sk (of generator of :math:`i+1` th block):
es: El VRF contiene la función de calculateVRF, que calcula la prueba de algún mensaje, y la función de verifyVRF, que verifica la prueba de la función de calculateVRFVRF con un mensaje y la clave pública del firmante. Teniendo en cuenta que la firma de generación de un bloque es igual a calcular la salida calculateVRF para una firma de generación anterior con clave privada de cuenta sk (del generador de :math:`i+1` th block):

source: The output of calculateVRF function is a VRF proof, which means that the validity of the signature can be checked. The output of function verifyVRF(pk :math:`_i`, generationSignature :math:`_i`) is used to define the time delay between :math:`i+99` and :math:`i+100` blocks for concrete block generator.
es: La salida de la función de calculateVRF es una prueba de VRF, lo que significa que se puede verificar la validez de la firma. La salida de la función verifyVRF(pk :math:`_i`, generationSignature :math:`_i`) se usa para definir el retraso de tiempo entre :math:`i+99` y :math:`i+100` bloques para concreto generador de bloques

source: Block Height
es: Altura del Bloque

source: The block height is a sequence number of a :ref:`block <02_decentralchain/04_block:Block>` in the blockchain.
es: La altura del bloque es un número de secuencia de un :ref:`bloque <02_decentralchain/04_block:Block>` en la cadena de bloques.

source: Block Signature
es: Firma del Bloque

source: A block signature is a hash that a :ref:`generating node <02_decentralchain/05_node:Generating Node>` acquires when it signs the :ref:`generated block <02_decentralchain/04_block:Block Generation>` with the private key of the account from the node's wallet.
es: Una firma de bloque es un hash que un :ref:`nodo generador <02_decentralchain/05_node:Generating Node>` adquiere cuando firma el :ref:`bloque generado <02_decentralchain/04_block:Block Generation>` con la llave privada de la cuenta de la billetera del nodo.

source: Block Timestamp
es: Marca de Tiempo del Bloque

source: A block timestamp is a time of :ref:`block generation <02_decentralchain/04_block:Block Generation>`. The time is specified in milliseconds that have passed since the beginning of the unix epoch.
es: Una marca de tiempo de bloque es indica el tiempo en que ocurrió la :ref:`generación del bloque <02_decentralchain/04_block:Block Generation>`. El tiempo se especifica en milisegundos que han pasado desde el comienzo de la época de Unix.

source: When the :ref:`node <02_decentralchain/05_node:Node>` receives a new block from the blockchain network, it verifies that the timestamp value of the block does not outpace the UTC time by more than :math:`100` milliseconds. The timestamp value of the block is validated by nodes using the formula from FPoS.
es: Cuando el :ref:`nodo <02_decentralchain/05_node:Node>` recibe un nuevo bloque de la red blockchain, verifica que el valor de la marca de tiempo del bloque no supere la hora UTC en más de :math:`100` milisegundos. Los nodos validan el valor de la marca de tiempo del bloque utilizando la fórmula de FPoS.

source: Genesis Block
es: Bloque Génesis

source: A genesis block is the first :ref:`block <02_decentralchain/04_block:Block>` of the blockchain. A genesis block contains one or more :ref:`genesis transactions <02_decentralchain/03_transaction:Genesis Transaction>`. There is one genesis block in the blockchain.
es: Un bloque de génesis es el primer :ref:`bloque <02_decentralchain/04_block:Block>` de la cadena de bloques. Un bloque de génesis contiene una o más :ref:`transacciones génesis <02_decentralchain/03_transaction:Genesis Transaction>`. Hay un bloque de génesis en la cadena de bloques.

source: Transactions Root Hash
es: Hash Raíz de Transacciones

source: The transactionsRoot field in the block header contains the root hash of the Merkle tree of transactions of the block. The root hash is the proof that the block contains all the transactions in the proper order. The transactions root hash in the block header has the following purposes:
es: El campo transactionRoot en el encabezado del bloque contiene el hash raíz del árbol Merkle de transacciones del bloque. El hash raíz es la prueba de que el bloque contiene todas las transacciones en el orden correcto. El hash raíz de transacciones en el encabezado del bloque tiene los siguientes propósitos:

source: To prove the integrity of transactions in the block without presenting all transactions.
es: Para probar la integridad de las transacciones en el bloque sin presentar todas las transacciones.

source: To sign the block header only, separately from its transactions.
es: Firmar únicamente la cabecera del bloque, separadamente de sus transacciones.

source: transactions Root Сalculation
es: Cálculo de la Raíz de la Transacción

source: The hash of each transaction in the block is calculated. For example:
es: Se calcula el hash de cada transacción en el bloque. Por ejemplo:

source: Each pair of adjacent hashes is concatenated, and the hash is calculated for each resulting concatenation:
es: Cada par de hash adyacentes se concatena y el hash se calcula para cada concatenación resultante:

source: If the last hash does not have a pair, it is concatenated with the zero byte hash: :math:`H_{GH}` = hash(:math:`H_G` + hash(0))
es: Si el último hash no tiene un par, se concatena con el hash de cero bytes: :math:`H_{GH}` = hash(:math:`H_G` + hash(0))

source: Step 2 is repeated until the root hash is obtained:
es: Se repite el paso 2 hasta obtener el hash raíz:

source: The root hash is written in the transactionsRoot field.
es: El hash raíz se escribe en el campo transactionRoot.

source: If the block is empty, then transactionsRoot = hash(0). DecentralChain blockchain uses BLAKE2b-256 hashing function.
es: Si el bloque está vacío, transaccionesRoot = hash(0). La cadena de bloques DecentralChain utiliza la función hash BLAKE2b-256.

source: Proof of Transaction in Block
es: Prueba deTransacción en Bloque

source: Let's suppose that side :math:`1` stores the full blockchain data and side :math:`2` stores the block headers only. To prove that the block contains a given transaction, side :math:`1` provides the following data:
es: Supongamos que el lado :math:`1` almacena los datos completos de la cadena de bloques y el lado :math:`2` almacena solo los encabezados de los bloques. Para probar que el bloque contiene una transacción determinada, side :math:`1` proporciona los siguientes datos:

source: T: Transaction to check.
es: T: Transacción a comprobar.

source: merkleProofs: Array of sibling hashes of the Merkle tree, bottom-to-top.
es: merkleProofs: matriz de valores hash hermanos del árbol de Merkle, de abajo hacia arriba.

source: index: Index of the transaction in the block.
es: index: Índice de la transacción en el bloque.

source: For example, for the :math:`T_D` transaction:
es: Por ejemplo, para la transacción :math:`T_D`:

source: Side 2 checks the proof:
es: El lado 2 verifica la prueba:

source: It calculates the hash of the transaction being checked (all the transaction data is hashed, including the signature): :math:`H_D` = hash(:math:`T_D`)
es: Calcula el hash de la transacción que se está comprobando (todos los datos de la transacción son hash, incluida la firma): :math:`H_D` = hash(:math:`T_D`)

source: 2. It concatenates the current hash with the corresponding hash of the merkleProofs array and calculates the hash of concatenation. index determines in which order to concatenate the hashes:
es: 2. Concatena el hash actual con el hash correspondiente del array merkleProofs y calcula el hash de concatenación. index determina en qué orden concatenar los hashes:

source: If the nth bit of index from the end is :math:`0`, then the order is: the current hash + the nth hash of the merkleProofsarray (proof hash is on the right).
es: Si el enésimo bit de índice desde el final es :math:`0`, entonces el orden es: el hash actual + el enésimo hash de merkleProofsarray (el hash de prueba está a la derecha).

source: If the nth bit is :math:`1` , the order is: the nth hash of the merkleProofsarray + the current hash (proof hash is on the left). For example, index = :math:`3_{10}` = :math:`11_2` , thus:
es: Si el enésimo bit es :math:`1` , el orden es: el enésimo hash de merkleProofsarray + el hash actual (el hash de prueba está a la izquierda). Por ejemplo, index = :math:`3_{10}` = :math:`11_2` , por lo tanto:

source: merkleProofs[0] = :math:`H_{C}` is on the left,
es: merkleProofs[0] = :math:`H_{C}` está a la izquierda,

source: merkleProofs[1] = :math:`H_{AB}` is on the left,
es: merkleProofs[1] = :math:`H_{AB}` está a la izquierda,

source: merkleProofs[2] = :math:`H_{EFGH}` is on the right.
es: merkleProofs[2] = :math:`H_{EFGH}` está a la derecha.

source: It repeats step 2 until the root hash is obtained: :math:`H_{ABCDEFGH}`
es: Repite el paso 2 hasta obtener el hash raíz: :math:`H_{ABCDEFGH}`

source: It compares the root hash obtained with the already known transactionsRoot from the block header. If the hashes match, then the transaction exists in the block.
es: Compara el hash de raíz obtenido con las transaccionesRoot ya conocidas del encabezado del bloque. Si los valores hash coinciden, la transacción existe en el bloque.

source: Tools
es: Herramientas

source: The following Node API methods accept transaction IDs and provide the proof that the transaction is in a block for each transaction:
es: Los siguientes métodos de API de nodo aceptan ID de transacciones y proporcionan la prueba de que la transacción está en un bloque para cada transacción:

source: GET /transactions/merkleProof
es: GET /transacciones/merkleProof

source: POST /transactions/merkleProof
es: POST /transacciones/merkleProof

source: The methods are described in the :ref:`transaction <02_decentralchain/03_transaction:Transaction>` article. You can check a transaction on the same blockchain without using a root hash, since the DecentralChain nodes store the entire blockchain data, including all transactions. Use the following built-in Ride function:
es: Los métodos se describen en el artículo sobre :ref:`transacciones <02_decentralchain/03_transaction:Transaction>`. Puedes verificar una transacción en la misma cadena de bloques sin usar un hash raíz, ya que los nodos de DecentralChain almacenan todos los datos de la cadena de bloques, incluidas todas las transacciones. Utilice la siguiente función Ride integrada:

source: The function returns the block height if the transaction with the specified ID exists. Otherwise, it returns a unit. See the function description in the :ref:`blockchain functions <03_ride-language/03_functions:Blockchain Functions>` article. To check a transaction in a block on the external blockchain you can use the following built-in Ride function:
es: La función devuelve la altura del bloque si existe la transacción con el ID especificado. De lo contrario, devuelve una unidad. Consulte la descripción de la función en el artículo :ref:`funciones blockchain <03_ride-language/03_functions:Blockchain Functions>`. Para verificar una transacción en un bloque en la cadena de bloques externa, puede usar la siguiente función Ride incorporada:

source: This function is applicable if the external blockchain uses the same algorithm for calculating the root hash of transactions. The createMerkleRoot function calculates the root hash from the transaction hash and sibling hashes of the merkle tree (see Steps 1–3). To check a transaction in a block, compare the calculated root hash with the transactionsRoot value in the block header.
es: Esta función es aplicable si la cadena de bloques externa utiliza el mismo algoritmo para calcular el hash raíz de las transacciones. La función createMerkleRoot calcula el hash raíz a partir del hash de transacción y los hashes hermanos del árbol merkle (consulte los pasos 1 a 3). Para verificar una transacción en un bloque, compare el hash de raíz calculado con el valor de transactionRoot en el encabezado del bloque.

source: Node
es: Nodo

source: A node is a host connected to the blockchain network. Node functions are:
es: Un nodo es un host conectado a la red blockchain. Las funciones de nodo son:

source: :ref:`Block <02_decentralchain/04_block:Block>` storage.
es: :ref:`Almacenamiento de bloque <02_decentralchain/04_block:Bloqck>`.

source: :ref:`Transaction validation <02_decentralchain/03_transaction:Transaction Validation>`.
es: :ref:`Validación de transacciones <02_decentralchain/03_transaction:Transaction Validation>`.

source: Sending :ref:`transactions <02_decentralchain/03_transaction:Transaction>`.
es: Envio de :ref:`transacciones <02_decentralchain/03_transaction:Transaction>`.

source: Generating Node
es: Nodo Generador

source: Generating node is a node that generates blocks. Each generating node is a :ref:`validating node <02_decentralchain/05_node:Validating Node>`. Generating account is an :ref:`account <02_decentralchain/01_account:Account>` that a node uses for :ref:`signing <02_decentralchain/04_block:Block Signature>` generated blocks. A node can generate blocks if the following conditions are met:
es: El nodo generador es un nodo que genera bloques. Cada nodo generador es un :ref:`nodo validador <02_decentralchain/05_node:Validating Node>`. La cuenta generadora es una :ref:`cuenta <02_decentralchain/01_account:Account>` que un nodo usa para :ref:`firmar bloques <02_decentralchain/04_block:Block Signature>` generados. Un nodo puede generar bloques si se cumplen las siguientes condiciones:

source: The node's generating balance is at least :math:`10000` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`. This means that the account balance in DecentralCoins, taking into account leasing, was not less than :math:`10000` DecentralCoins in each of the last :math:`1000` blocks (more details in the :ref:`account balance <02_decentralchain/01_account:Account Balance>` article). The greater the generating balance, the higher is your chance of being eligible to generate the next block.
es: El saldo de generación del nodo es al menos :math:`10000` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`. Esto significa que el saldo de la cuenta en DecentralCoins, teniendo en cuenta el arrendamiento, no fue inferior a :math:`10000` DecentralCoins en cada uno de los últimos :math:`1000` bloques (más detalles en el artículo sobre :ref:`saldo de cuenta <02_decentralchain/01_account:Account Balance>`). Cuanto mayor sea el saldo de generación, mayor será su probabilidad de ser elegible para generar el siguiente bloque.

source: Node's account is not a :ref:`smart account or dApp <02_decentralchain/01_account:dApp and Smart Account>`.
es: La cuenta del nodo no es una :ref:`smart account o dApp <02_decentralchain/01_account:dApp and Smart Account>`.

source: Block generation is not disabled in node settings. By default, block generation is enabled.
es: La generación de bloques no está deshabilitada en la configuración del nodo. De forma predeterminada, la generación de bloques está habilitada.

source: The node is connected to at least the number of peers specified in the required parameters (:math:`1` by default).
es: El nodo está conectado al menos a la cantidad de pares especificados en los parámetros requeridos (:math:`1` por defecto).

source: Validating Node
es: Nodo de Validación

source: A validating node is a node that :ref:`validates <02_decentralchain/03_transaction:Transaction Validation>` transactions.
es: Un nodo de validación es un nodo que :ref:`valida <02_decentralchain/03_transaction:Transaction Validation>` transacciones.

source: Generator’s Income
es: Ingresos para Generador

source: A node's income from adding a new block to the blockchain consists of the following amounts:
es: Los ingresos de un nodo por agregar un nuevo bloque a la cadena de bloques consisten en las siguientes cantidades:

source: Block reward: The current reward size is :math:`6` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` but it can be changed by voting, see the :ref:`block reward <02_decentralchain/05_node:Block Reward>` article.
es: Recompensa de bloque: el tamaño de la recompensa actual es :math:`6` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` pero se puede cambiar votando, consulte el artículo sobre la :ref:`recompensa de bloque <02_decentralchain/05_node :Block Reward>`.

source: :math:`40\%` of the total transaction fees in the current block. The exact value is calculated as follows:
es: :math:`40\%` de las tarifas de transacción totales en el bloque actual. El valor exacto se calcula de la siguiente manera:

source: Here f :math:`_i` is the fee for the :math:`i`-th transaction. For each transaction fee, an integer division by :math:`5` is performed, then a multiplication by :math:`2`, and finally they are summed up.
es: Aquí f :math:`_i` es la tarifa por la :math:`i`-ésima transacción. Para cada tarifa de transacción, se realiza una división entera por :math:`5`, luego una multiplicación por :math:`2`, y finalmente se suman.

source: :math:`60\%` of the total transaction fees in the previous block.
es: :math:`60\%` de las tarifas de transacción totales en el bloque anterior.

source: The block generator receives exactly the part of the fee that the previous block generator did not receive.
es: El generador de bloques recibe exactamente la parte de la tarifa que no recibió el generador de bloques anterior.

source: If the :ref:`transaction fees <02_decentralchain/03_transaction:Transaction Fees>` are specified in a sponsored asset, then the block generators receive the fee equivalent in DecentralCoins instead of the fee (as a general rule, in a :math:`\frac{40}{60}` ratio):
es: Si las :ref:`tarifas de transacción <02_decentralchain/03_transaction:Transaction Fees>` se especifican en un activo patrocinado, los generadores de bloques reciben la tarifa equivalente en DecentralCoins en lugar de la tarifa (como regla general, en :matemáticas:` relación \frac{40}{60}`):

source: minSponsoredAssetFee is the amount of the sponsored asset equivalent to :math:`0.001` DecentralCoins. The sponsor sets this value when enabling sponsorship. For details, see the :ref:`sponsored fees <02_decentralchain/03_transaction:Sponsored Fees>` article.
es: minSponsoredAssetFee es la cantidad del activo patrocinado equivalente a :math:`0.001` DecentralCoins. El patrocinador establece este valor al habilitar el patrocinio. Para obtener más información, consulte el artículo sobre :ref:`tarifas patrocinadas <02_decentralchain/03_transaction:Sponsored Fees>`.

source: Block Reward
es: Recompensa de Bloque

source: Block reward is a blockchain feature under which :ref:`generating nodes <02_decentralchain/05_node:Generating Node>` receive a fixed fee in :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` for each :ref:`generated block <02_decentralchain/04_block:Block Generation>`. Block rewards are paid due to the additional issue of the DecentralCoin token. The community of generating nodes can change the size of reward through voting.
es: La recompensa de bloque es una función de cadena de bloques en virtud de la cual los :ref:`nodos generadores <02_decentralchain/05_node:Generating Node>` reciben una tarifa fija en :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` por cada :ref:`bloque generado <02_decentralchain/04_block:Block Generation>`. Las recompensas en bloque se pagan debido a la emisión adicional del token DecentralCoin. La comunidad de nodos generadores puede cambiar el tamaño de la recompensa mediante la votación.

source: Current Reward Size
es: Tamaño Actual de la Decompensa

source: You can view the current reward size by making a request to the :ref:`Node REST API <documentation:placeholder>`. In response to the request, a JSON file is returned, the value of the currentReward field of which is the current block reward size in Decentralites.
es: Puede ver el tamaño de la recompensa actual realizando una solicitud a la :ref:`Node REST API <documentation:placeholder>`. En respuesta a la solicitud, se devuelve un archivo JSON, cuyo valor del campo currentReward es el tamaño actual de la recompensa del bloque en Decentralitos.

source: Example of response:
es: Ejemplo de Respuesta:

source: In the example above, the value of the JSON's currentReward field is 600,000,000 Decentralites— i.e. it's 6 :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`.
es: En el ejemplo anterior, el valor del campo currentReward del JSON es 600 000 000 decentralitos, es decir, es 6 :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`.

source: The Change of Block Reward Size Over Time
es: Cambio del Tamaño de la Recompensa en Bloque a lo Largo del Tiempo

source: Every :math:`100,000` blocks, i.e. approximately every :math:`70` days, a new voting for the current reward size change begins among the generators. The voting duration is :math:`10,000` blocks. During this time, generating nodes vote to increase, decrease or leave the current reward size unchanged. The elected reward size remains unchanged for :math:`100,000` blocks following the end of voting.
es: Cada :math:`100,000` bloques, es decir, aproximadamente cada :math:`70` días, comienza una nueva votación entre los generadores para cambiar el tamaño de la recompensa actual. La duración de la votación es :math:`10,000` bloques. Durante este tiempo, los nodos generadores votan para aumentar, disminuir o dejar sin cambios el tamaño de la recompensa actual. El tamaño de la recompensa elegido permanece sin cambios para :math:`100,000` bloques después del final de la votación.

source: Voting
es: Votación
