Repository: Decentral-America/docs
Catalog: docs/locales/*/LC_MESSAGES/02_decentralchain.po
Languages: es

source: Once a node generates a key block it becomes the leader. As a leader, the node is allowed to generate microblocks at a set rate smaller than a predefined maximum. These micro blocks will contain the ledger entries with no requirement for any Proof of Stake and they're generated by the elected leader in every block-generation cycle. This block-generation cycle is initiated by a leader block. The only requirement is to sign the micro blocks with the elected leader's private key. The micro blocks can be generated at a very high speed by the elected leader(miner), thus resulting in increased performance and transaction speed.
es: Una vez que un nodo genera un bloque clave, se convierte en el líder. Como líder, el nodo puede generar microbloques a una tasa establecida más pequeña que un máximo predefinido. Estos microbloques contendrán las entradas del libro mayor sin ningún requisito de prueba de participación y son generados por el líder electo en cada ciclo de generación de bloques. Este ciclo de generación de bloques es iniciado por un bloque líder. El único requisito es firmar los microbloques con la clave privada del líder electo. El líder elegido (minero) puede generar los microbloques a una velocidad muy alta, lo que resulta en un mayor rendimiento y velocidad de transacción.

source: For a microblock to be valid, all its entries must be valid according to the specification of the state machine, and the signature has to be valid. Figure 5 illustrates the structure. Note that microblocks do not affect the weight of the chain, as they do not contain proof of stake. When all micro blocks have been validated, they will be merged with their key block into one block.
es: Para que un microbloque sea válido, todas sus entradas deben ser válidas según la especificación de la máquina de estado y la firma debe ser válida. La Figura 5 ilustra la estructura. Tenga en cuenta que los microbloques no afectan el peso de la cadena, ya que no contienen prueba de participación. Cuando se hayan validado todos los microbloques, se fusionarán con su bloque clave en un solo bloque.

source: DecentralChain-M5 Reward Mechanisms
es: Mecanismos de Recompensa de DecentralChain-M5

source: Remuneration consists of two parts. First, each key block entitles its generator a set amount. Second, each ledger entry carries a fee. This fee is split by the leader that places this entry in a microblock and the subsequent leader that generates the next key block.
es: La remuneración consta de dos partes. Primero, cada bloque clave da derecho a su generador a una cantidad fija. En segundo lugar, cada entrada del libro mayor conlleva una tarifa. Esta tarifa se divide entre el líder que coloca esta entrada en un microbloque y el líder posterior que genera el siguiente bloque clave.

source: In order to motivate participants to follow the protocol, DecentralChain-M5 uses the following mechanisms: Each transaction pays a fee to the system, but unlike Bitcoin, this fee is distributed, with :math:`40\%` to the leader, and :math:`60\%` to the subsequent leader. Finally, if a leader forks the chain by generating two microblocks with the same parent, it is punished by revoking the subsidy revenue; whoever detects the fraud wins a nominal fee, (Figure 5).
es: Para motivar a los participantes a seguir el protocolo, DecentralChain-M5 utiliza los siguientes mecanismos: cada transacción paga una tarifa al sistema, pero a diferencia de Bitcoin, esta tarifa se distribuye, con :math:`40\%` al líder, y :math:`60\%` al siguiente líder. Finalmente, si un líder bifurca la cadena generando dos microbloques con el mismo padre, es sancionado con la revocación de los ingresos del subsidio; quien detecta el fraude gana una tarifa nominal (Figura 5).

source: Figure 5: chain structure of the DecentralChain-M5 Protocol. Microblocks (circles) are signed with the private key matching with the public key in the last key block (squares). The fee is distributed :math:`40\%` to the leader and :math:`60\%` to the next one.
es: Figura 5: estructura de cadena del Protocolo DecentralChain-M5. Los microbloques (círculos) se firman con la clave privada que coincide con la clave pública en el último bloque de claves (cuadrados). La tarifa se distribuye :math:`40\%` al líder y :math:`60\%` al siguiente.

source: In practice, the remuneration is implemented by having each key block contain a single coinbase transaction that mints new coins and deposits the funds to the current and previous leaders. As in Bitcoin, this transaction can only be spent after a maturity period of :math:`100` key blocks, to avoid non-mergeable transactions following a fork.
es: En la práctica, la remuneración se implementa haciendo que cada bloque clave contenga una sola transacción de base de monedas que acuña nuevas monedas y deposita los fondos a los líderes actuales y anteriores. Al igual que en Bitcoin, esta transacción solo se puede gastar después de un período de vencimiento de :math:`100` bloques clave, para evitar transacciones no fusionables después de una bifurcación.

source: Fair Proof of Stake
es: Prueba Justa de Participación

source: In this model, the choice of account that has the right to generate the next block and receive the corresponding transaction fees is based on the number of tokens in the account. The more tokens that are held in the account, the greater the chance that account will earn the right to generate a block.
es: En este modelo, la elección de la cuenta que tiene derecho a generar el siguiente bloque y recibir las tarifas de transacción correspondientes se basa en la cantidad de tokens en la cuenta. Cuantos más tokens se mantengan en la cuenta, mayor será la posibilidad de que la cuenta obtenga el derecho a generar un bloqueo.

source: In DecentralChain, we are convinced that each participant in the blockchain should participate in the block generation process proportionally to his stake: we have decided to correct the PoS formula. At the moment we do not have the goal of completely changing the algorithm, since there is no need; we simply want to make some adjustments. We presented an improved PoS algorithm that makes the choice of block creator fair and reduces vulnerability to the multi-branching attacks, in accordance with the shortcomings of the current algorithm.
es: En DecentralChain estamos convencidos de que cada participante en la cadena de bloques debe participar en el proceso de generación de bloques de forma proporcional a su participación: hemos decidido corregir la fórmula PoS. Por el momento no tenemos el objetivo de cambiar completamente el algoritmo, ya que no hay necesidad; simplemente queremos hacer algunos ajustes. Presentamos un algoritmo PoS mejorado que hace que la elección del creador de bloques sea justa y reduce la vulnerabilidad a los ataques de ramificación múltiple, de acuerdo con las deficiencias del algoritmo actual.

source: We analyzed the model of the new algorithm for its correspondence to the stake share and the share of blocks, and the results were positive. Also, the algorithm was analyzed for vulnerability to attacks, and results obtained with the new model were better than with the old one. The attacks’ results for the attacker were not so successful in terms of the profits gained. The number of forks and their length decreased.
es: Analizamos el modelo del nuevo algoritmo para su correspondencia con la participación de participación y la participación de bloques, y los resultados fueron positivos. Además, se analizó la vulnerabilidad del algoritmo a los ataques y los resultados obtenidos con el nuevo modelo fueron mejores que con el antiguo. Los resultados de los ataques para el atacante no fueron tan exitosos en términos de las ganancias obtenidas. El número de horquillas y su longitud disminuyó.

source: Blockchain Data Types
es: Tipos de Datos del Blockchain

source: Keyword
es: Palabra clave

source: Possible values
es: Valores posibles

source: Variable size in bytes
es: Tamaño variable en bytes

source: :math:`0` and :math:`1`.
es: :math:`0` y :math:`1`.

source: Integer from :math:`-128` to :math:`127` inclusive.
es: Entero de :math:`-128` a :math:`127` inclusive.

source: Integer from :math:`-2,147,483,648` to :math:`2,147,483,647` inclusive.
es: Número entero de :math:`-2,147,483,648` a :math:`2,147,483,647` inclusive.

source: Integer from :math:`-9,223,372,036,854,775,808` to :math:`9,223,372,036,854,775,807` inclusive.
es: Entero de :math:`-9,223,372,036,854,775,808` a :math:`9,223,372,036,854,775,807` inclusive.

source: Integer from :math:`-32,768` to :math:`32,767` inclusive.
es: Número entero de :math:`-32,768` a :math:`32,767` inclusive.

source: From :math:`0` to :math:`2,147,483,647` characters inclusive.
es: Desde :math:`0` hasta :math:`2,147,483,647` caracteres inclusive.

source: From :math:`1` to :math:`4` bytes per character.
es: Desde :math:`1` hasta :math:`4` bytes por carácter.

source: Validation Rules
es: Reglas de Validación

source: Account Validation
es: Validación de Cuenta

source: Account is valid then it is a valid Base58 string and the length of the corresponding array is :math:`26` bytes. Version of address (1st byte) is equal to :math:`1`. The network byte (2nd byte) is equal to network ID. The checksum of address (last :math:`4` bytes) is correct.
es: La cuenta es válida, entonces es una cadena Base58 válida y la longitud de la matriz correspondiente es :math:`26` bytes. La versión de la dirección (1er byte) es igual a :math:`1`. El byte de red (segundo byte) es igual a la ID de red. La suma de comprobación de la dirección (últimos :math:`4` bytes) es correcta.

source: Transactions Validation
es: Validación de Transacciones

source: Transfer Transaction Validation
es: Validación de Transacción para Transferencia

source: Transfer transaction is valid then:
es: La transacción para transferencia es válida entonces:

source: Recipient address is valid. If not, InvalidAddress validation result will be returned.
es: La dirección del destinatario es válida. De lo contrario, se devolverá el resultado de validación de InvalidAddress.

source: Size of attachment is less than or equals MaxAttachementSize(:math:`140` bytes). In other case TooBigArray validation result will be returned.
es: El tamaño del archivo adjunto es menor o igual a MaxAttachementSize(:math:`140` bytes). En otro caso, se devolverá el resultado de la validación de TooBigArray.

source: Transaction's amount is more than :math:`0`, otherwise NegativeAmount validation result is returned.
es: El monto de la transacción es mayor que :math:`0`; de lo contrario, se devuelve el resultado de la validación NegativeAmount.

source: Transaction's fee is positive, otherwise InsufficientFee validation result is returned.
es: La tarifa de la transacción es positiva; de lo contrario, se devuelve el resultado de validación de tarifa insuficiente.

source: Adding fee to amount does not lead to Long overflow. In case of Long overflow OverflowError validation result will be returned.
es: Agregar una tarifa a la cantidad no conduce a un desbordamiento largo. En caso de desbordamiento prolongado, se devolverá el resultado de la validación OverflowError.

source: Transaction's signature is valid, otherwise InvalidSignature validation result is returned.
es: La firma de la transacción es válida; de lo contrario, se devuelve el resultado de la validación InvalidSignature.

source: Issue Transaction Validation
es: Validación de Transacción para Emisión

source: Issue transaction is valid then:
es: La transacción para emisión es válida entonces:

source: Sender's address is valid. If not, InvalidAddress validation result will be returned.
es: La dirección del remitente es válida. De lo contrario, se devolverá el resultado de validación de InvalidAddress.

source: Quantity of asset is positive, otherwise NegativeAmount validation result is returned.
es: La cantidad de activos es positiva; de lo contrario, se devuelve el resultado de la validación NegativeAmount.

source: Transaction's fee is more than or equals MinFee(:math:`100000000` Decentralites = :math:`1` DecentralCoin), in other case InsufficientFee validation result is returned.
es: La tarifa de la transacción es mayor o igual a MinFee(:math:`100000000` Decentralites = :math:`1` DecentralCoin), en otro caso, se devuelve un resultado de validación de tarifa insuficiente.

source: Size of description is less than or equals MaxDescriptionLength(:math:`1000` bytes), otherwise TooBigArray is returned.
es: El tamaño de la descripción es menor o igual a MaxDescriptionLength(:math:`1000` bytes); de lo contrario, se devuelve TooBigArray.

source: Size of name is more than or equals MinAssetNameLength and less or equals MaxAssetNameLength, in other case InvalidName validation result will be returned.
es: El tamaño del nombre es mayor o igual a MinAssetNameLength y menor o igual a MaxAssetNameLength; en otro caso, se devolverá el resultado de validación de InvalidName.

source: Decimals is positive and less than or equals MaxDecimals, in other case TooBigArray is returned.
es: Decimals es positivo y menor o igual a MaxDecimals; en otro caso, se devuelve TooBigArray.

source: Reissue Transaction Validation
es: Validación de Transacción para Reemisión

source: Reissue transaction is valid then:
es: La transacción para reemisión es válida entonces:

source: Sender's account is valid. Otherwise InvalidAddress validation result is returned.
es: La cuenta del remitente es válida. De lo contrario, se devuelve el resultado de validación de InvalidAddress.

source: Quantity is positive, in other case NegativeAmount validation result will be returned.
es: Quantity es positivo; en otro caso, se devolverá el resultado de la validación NegativeAmount.

source: Transaction's fee is positive, in other case InsufficientFee result will be returned.
es: La tarifa de la transacción es positiva, en caso contrario, se devolverá el resultado de Tarifa Insuficiente.

source: Block Validations
es: Validaciones de Bloque

source: Block is valid then:
es: El bloque es válido entonces:

source: Block chain contains referenced blocks.
es: La cadena de bloques contiene bloques a los que se hace referencia.

source: Block's signature is valid.
es: La firma del bloque es válida.

source: Block's consensus data is valid.
es: Los datos de consenso del bloque son válidos.

source: Block's transactions are valid.
es: Las transacciones del bloque son válidas.

source: Consensus Data Validation
es: Validación de Datos de Consenso

source: Block's consensus data is valid then:
es: Los datos de consenso del bloque son válidos entonces:

source: Block creation time is no more than MaxTimeDrift(:math:`15` seconds) in future.
es: El tiempo de creación del bloque no es más que MaxTimeDrift(:math:`15` segundos) en el futuro.

source: Block's transactions are sorted. This rule works only after :math:`1477958400000` on Testnet and :math:`1479168000000` on Mainnet.
es: Las transacciones del bloque están ordenadas. Esta regla solo funciona después de :math:`1477958400000` en Testnet y :math:`1479168000000` en Mainnet.

source: Block chain contains parent block or block chain height is equal :math:`1`.
es: La cadena de bloques contiene el bloque principal o la altura de la cadena de bloques es igual :math:`1`.

source: Block's base target is valid.
es: El objetivo base del bloque es válido.

source: Block's generator signature is valid.
es: La firma del generador del bloque es válida.

source: Generator's balance is more than or equals MinimalEffectiveBalanceForGeneration(:math:`1000000000000` Decentralites). This rule always works on Testnet and works only after :math:`1479168000000` on Mainnet.
es: El saldo del generador es mayor o igual a MinimalEffectiveBalanceForGeneration(:math:`1000000000000` Decentralites). Esta regla siempre funciona en Testnet y funciona solo después de :math:`1479168000000` en Mainnet.

source: Block's hit is less than calculated block's target.
es: El golpe del bloque es menor que el objetivo del bloque calculado.

source: Voted features are sorted in ascending order and are not repeated.
es: Las características votadas se ordenan en orden ascendente y no se repiten.

source: Transactions Data Validation
es: Validación de Datos de Transacciones

source: Block's transactions are valid then:
es: Las transacciones del bloque son válidas entonces:

source: Creation time of every transaction in block is less than block's creation time no more than on MaxTxAndBlockDiff(:math:`2` hours).
es: El tiempo de creación de cada transacción en el bloque es menor que el tiempo de creación del bloque no más que en MaxTxAndBlockDiff(:matemáticas:`2` horas).

source: All transactions are valid against state.
es: Todas las transacciones son válidas contra el estado.

source: Transaction validation against state. Transactions are valid then:
es: Validación de transacciones contra el estado. Las transacciones son válidas entonces:

source: Transaction is valid by transaction validation rules.
es: La transacción es válida según las reglas de validación de transacciones.

source: Transaction creation time more than block's creation time no more than on MaxTimeForUnconfirmed(:math:`90` minutes). This limitation works always on Testnet and only after :math:`1479168000000` on Mainnet.
es: El tiempo de creación de la transacción es más que el tiempo de creación del bloque no más que en MaxTimeForUnconfirmed(:math:`90` minutos). Esta limitación funciona siempre en Testnet y solo después de :math:`1479168000000` en Mainnet.

source: Application of transaction to accounts should not lead to temporary negative balance. This rule works after :math:`1479168000000` on Mainnet and after :math:`1477958400000` on Testnet.
es: La aplicación de la transacción a las cuentas no debe dar lugar a un saldo negativo temporal. Esta regla funciona después de :math:`1479168000000` en Mainnet y después de :math:`1477958400000` en Testnet.

source: Changes made by transaction should be sorted by their amount. This rule works on both Mainnet and Testnet after :math:`1479416400000`.
es: Los cambios realizados por transacción deben ordenarse por su monto. Esta regla funciona tanto en Mainnet como en Testnet después de :math:`1479416400000`.

source: Application of transaction's amount to current balance should not lead to Long overflow.
es: La aplicación del monto de la transacción al saldo actual no debe conducir a un desbordamiento largo.

source: After application of all block's transactions affected balances should not be negative.
es: Después de la aplicación de todas las transacciones del bloque, los saldos afectados no deben ser negativos.

source: Unconfirmed Transactions Pool Validation
es: Validación del Grupo de Transacciones no Confirmadas

source: Transaction could be inserted in unconfirmed transactions pool then:
es: La transacción podría insertarse en el grupo de transacciones no confirmadas entonces:

source: If transaction's fee is more than or equals minimum fee that was set by the owner of a node.
es: Si la tarifa de la transacción es mayor o igual a la tarifa mínima establecida por el propietario de un nodo.

source: There is a space for a new transaction if unconfirmed transactions pool. By default the pool is limited by :math:`1000` transactions.
es: Hay un espacio para una nueva transacción si hay un grupo de transacciones no confirmadas. De forma predeterminada, el grupo está limitado por :math:`1000` transacciones.

source: unconfirmed transactions pool does not contain transaction with the same ID.
es: El grupo de transacciones no confirmadas no contiene transacciones con el mismo ID.

source: Transaction created not later than MaxTimeForUncofimed(:math:`90` minutes) after the last block was created.
es: Transacción creada a más tardar MaxTimeForUncofimed(:matemáticas:`90` minutos) después de la creación del último bloque.

source: Transaction creation time is no more than MaxTimeDrift(:math:`15` seconds) in future.
es: El tiempo de creación de la transacción no es más que MaxTimeDrift(:math:`15` segundos) en el futuro.

source: Transaction is valid against state.
es: La transacción es válida contra el estado.

source: :ref:`Address binary format <02_decentralchain/10_binary-format:Address Binary Format>`
es: :ref:`Formato binario de dirección <02_decentralchain/10_binary-format:Address Binary Format>`

source: :ref:`Alias binary format <02_decentralchain/10_binary-format:Alias Binary Format>`
es: :ref:`Formato binario de alias<02_decentralchain/10_binary-format:Alias Binary Format>`

source: :ref:`Block binary format <02_decentralchain/10_binary-format:Block Binary Format>`
es: :ref:`Formato binario del bloque <02_decentralchain/10_binary-format:Block Binary Format>`

source: :ref:`Network message binary format <02_decentralchain/10_binary-format:Network Message Binary Format>`
es: :ref:`Formato binario del mensaje de red <02_decentralchain/10_binary-format:Network Message Binary Format>`

source: :ref:`Block message binary format <02_decentralchain/10_binary-format:Block Message Binary Format>`
es: :ref:`Formato binario del mensaje del bloque <02_decentralchain/10_binary-format:Block Message Binary Format>`

source: :ref:`Checkpoint message binary format <02_decentralchain/10_binary-format:Checkpoint Message Binary Format>`
es: :ref:`Formato binario del mensaje del checkpoint <02_decentralchain/10_binary-format:Checkpoint Message Binary Format>`

source: :ref:`Get block message binary format <02_decentralchain/10_binary-format:Get Block Message Binary Format>`
es: :ref:`Formato binario del mensaje al obtener bloque <02_decentralchain/10_binary-format:Get Block Message Binary Format>`

source: :ref:`Get peers message binary format <02_decentralchain/10_binary-format:Get Peers Message Binary Format>`
es: :ref:`Formato binario del mensaje al obtener pares <02_decentralchain/10_binary-format:Get Peers Message Binary Format>`

source: :ref:`Get signatures message binary format <02_decentralchain/10_binary-format:Get Signatures Message Binary Format>`
es: :ref:`Formato binario del mensaje al obtener firma <02_decentralchain/10_binary-format:Get Signatures Message Binary Format>`

source: :ref:`Handshake message binary format <02_decentralchain/10_binary-format:Handshake Message Binary Format>`
es: :ref:`Formato binario del mensaje de enlace <02_decentralchain/10_binary-format:Handshake Message Binary Format>`

source: :ref:`Peers message binary format <02_decentralchain/10_binary-format:Peers Message Binary Format>`
es: :ref:`Formato binario del mensaje de pares <02_decentralchain/10_binary-format:Peers Message Binary Format>`

source: :ref:`Score message binary format <02_decentralchain/10_binary-format:Score Message Binary Format>`
es: :ref:`Formato binario del mensaje de puntaje <02_decentralchain/10_binary-format:Score Message Binary Format>`

source: :ref:`Signatures message binary format <02_decentralchain/10_binary-format:Signatures Message Binary Format>`
es: :ref:`Formato binario del mensaje de firmas <02_decentralchain/10_binary-format:Signatures Message Binary Format>`

source: :ref:`Transaction message binary format <02_decentralchain/10_binary-format:Transaction Message Binary Format>`
es: :ref:`Formato binario del mensaje de transacción <02_decentralchain/10_binary-format:Transaction Message Binary Format>`

source: :ref:`Order binary format <02_decentralchain/10_binary-format:Order Binary Format>`
es: :ref:`Formato binario de orden <02_decentralchain/10_binary-format:Order Binary Format>`

source: :ref:`Transaction binary format <02_decentralchain/10_binary-format:Transaction Binary Format>`
es: :ref:`Formato binario de transacción <02_decentralchain/10_binary-format:Transaction Binary Format>`
