Repository: Decentral-America/docs
Catalog: docs/locales/*/LC_MESSAGES/02_decentralchain.po
Languages: es

source: The regular balance is the amount of :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` that belongs directly to the account. Thе other types of balances are determined counting :ref:`leased <02_decentralchain/05_node:Leased Proof of Stake>` DecentralCoins.
es: El saldo regular es la cantidad de :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` que pertenece directamente a la cuenta. Los otros tipos de saldos se determinan contando :ref:`arrendamientos <02_decentralchain/05_node:Leased Proof of Stake>` DecentralCoins.

source: Let us introduce the following notation:
es: Introduzcamos la siguiente notación:

source: Then:
es: Entonces:

source: The generating balance of a :ref:`node <02_decentralchain/05_node:Node>` account affects the ability to participate in block generation. To generate blocks, you need a generating balance of at least :math:`10000` DecentralCoins. The larger the generating balance, the greater the chance to add the next block is.
es: El saldo de generación de un :ref:`nodo <02_decentralchain/05_node:Node>` afecta la capacidad de participar en la generación de bloques. Para generar bloques, necesita un saldo de generación de al menos :math:`10000` DecentralCoins. Cuanto mayor sea el saldo de generación, mayor será la posibilidad de agregar el siguiente bloque.

source: View Account Balance
es: Ver Saldo de Cuenta

source: The balances of any account, as well as other blockchain data, are public and can be read by anyone.
es: Los saldos de cualquier cuenta, así como otros datos de blockchain, son públicos y cualquiera puede leerlos.

source: For example, you can see the list of tokens and their amount on the account in `DecentralChain Explorer <https://decentralscan.com/>`_. To do this, find an account by its address or alias. Balances in :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` are displayed right under the address, balances in other assets are at the Assets tab, and :ref:`non-fungible tokens (NFT) <02_decentralchain/02_token(asset):Non-Fungible Token>` are at the Non-fungible tokens tab.
es: Por ejemplo, puede ver la lista de tokens y su cantidad en la cuenta en el `Explorador DecentralChain <https://decentralscan.com/>`_. Para hacer esto, busque una cuenta por su dirección o alias. Los saldos en :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` se muestran justo debajo de la dirección, los saldos en otros activos están en la pestaña Activos y :ref:`tokens no fungibles (NFT) <02_decentralchain/ 02_token(activo):Non-Fungible Token>` están en la pestaña de tokens no fungibles.

source: Top up Balance
es: Recargar Saldo

source: You can buy DecentralCoin tokens at `Decentral.Exchange <https://decentral.exchange/>`_.
es: Puedes comprar tokens DecentralCoin en `Decentral.Exchange <https://decentral.exchange/>`_.

source: Account Data Storage
es: Almacenamiento de Datos de Cuenta

source: Account data storage is a key-value storage associated with an :ref:`account <02_decentralchain/01_account:Account>`. The key of each entry is a unique string. The value is the data being stored, it’s store using one of the types:
es: El almacenamiento de datos de cuenta es un almacenamiento de llave-valor asociado con una :ref:`cuenta <02_decentralchain/01_account:Account>`. La llave de cada entrada es una cadena única. El valor son los datos que se almacenan, se almacenan utilizando uno de los tipos:

source: String
es: Cadena

source: Boolean
es: Booleano

source: Integral
es: Entero

source: Array of bytes
es: Matriz de bytes

source: The size of an account data storage is unlimited. For key and value size limitations, see the :ref:`data transaction <02_decentralchain/03_transaction:Data Transaction>` article.
es: El tamaño del almacenamiento de datos de una cuenta es ilimitado. Para conocer las limitaciones de tamaño de llave y valor, consulte el artículo :ref:`transacción para datos <02_decentralchain/03_transaction:Data Transaction>`.

source: View Account Data
es: Ver Datos de Cuenta

source: Data storage of any account, as well as other blockchain data, are public and can be read by anyone. For example, you can see data entries in `DecentralChain Explorer <https://decentralscan.com/>`_. To do this, find an account by its :ref:`address <02_decentralchain/01_account:Address>` or :ref:`alias <02_decentralchain/01_account:Alias>` and switch to the Data tab.
es: El almacenamiento de datos de cualquier cuenta, así como otros datos de blockchain, son públicos y cualquiera puede leerlos. Por ejemplo, puede ver las entradas de datos en `DecentralChain Explorer <https://decentralscan.com/>`_. Para hacer esto, busque una cuenta por su :ref:`dirección <02_decentralchain/01_account:Address>` o :ref:`alias <02_decentralchain/01_account:Alias>` y cambie a la pestaña Datos.

source: Add, Modify, Delete Entries
es: Agregar, Modificar, Eliminar Entradas

source: The account owner can add, modify or delete entries of the account data storage via a :ref:`data transaction <02_decentralchain/03_transaction:Data Transaction>`.
es: El propietario de la cuenta puede agregar, modificar o eliminar entradas del almacenamiento de datos de la cuenta a través de una :ref:`transacción para datos <02_decentralchain/03_transaction:Data Transaction>`.

source: A :ref:`dApp script <02_decentralchain/01_account:dApp and Smart Account>` can add, modify or delete entries in the dApp's data storage as a result of an :ref:`invoke script transaction <02_decentralchain/03_transaction:Invoke Script Transaction>` transaction via script actions:
es: Un :ref:`dApp script <02_decentralchain/01_account:dApp and Smart Account>` puede agregar, modificar o eliminar entradas en el almacenamiento de datos de la dApp como resultado de una :ref:`transacción para invocar scripts <02_decentralchain/03_transaction:Invoke Script Transaction >` a través de acciones de script:

source: dApp and Smart Account
es: dApp y Cuenta Inteligente

source: An account with a script assigned to it becomes a dApp or smart account. dApp is the account with the :ref:`dApp script <03_ride-language/04_script-types:dApp Script>` assigned. dApp is an application whose functions can be called from other accounts via an :ref:`invoke script transaction <02_decentralchain/03_transaction:Invoke Script Transaction>`. Callable functions can accept payments to the dApp and also perform actions applied to the blockchain:
es: Una cuenta con un script asignado se convierte en una dApp o cuenta inteligente. dApp es la cuenta con el :ref:`dApp script <03_ride-language/04_script-types:dApp Script>` asignado. dApp es una aplicación cuyas funciones se pueden llamar desde otras cuentas a través de una :ref:`transacción para invocar scripts <02_decentralchain/03_transaction:Invoke Script Transaction>`. Las funciones a las que se puede llamar pueden aceptar pagos a la dApp y también realizar acciones aplicadas a la cadena de bloques:

source: Add, modify or delete entries of the dApp account data storage.
es: Agregue, modifique o elimine entradas del almacenamiento de datos de la cuenta dApp.

source: Transfer tokens from the dApp balance.
es: Transferir tokens del saldo de dApp.

source: Issue, reissue, burn tokens on behalf of the dApp, sponsorship setup.
es: Emitir, reemitir, quemar tokens en nombre de la dApp, configuración de patrocinio.

source: Beyond that, a dApp script can comprise the verifier function that allows or denies transactions and orders that are sent on behalf of the dApp account depending on the specified conditions. The verifier function replaces the default verification that is used to verify the sender's signature and allows you to set more complex rules, such as multisignature.
es: Más allá de eso, un script de dApp puede comprender la función de verificación que permite o deniega transacciones y pedidos que se envían en nombre de la cuenta de dApp según las condiciones especificadas. La función de verificación reemplaza la verificación predeterminada que se usa para verificar la firma del remitente y le permite establecer reglas más complejas, como la firma múltiple.

source: Using dApps, you can implement various blockchain-empowered applications: gaming and gambling, DeFi, digital identity, supply chains, and many others.
es: Con dApps, puedes implementar varias aplicaciones potenciadas por blockchain: juegos y apuestas, DeFi, identidad digital, cadenas de suministro y muchas otras.

source: A smart account is an account with the :ref:`account script <03_ride-language/04_script-types:Account Script>` assigned. The account script is similar to a verifier function of a dApp script. Please note:
es: Una cuenta inteligente es una cuenta con el :ref:`script de cuenta <03_ride-language/04_script-types:Account Script>` asignado. La secuencia de comandos de la cuenta es similar a una función de verificación de una secuencia de comandos dApp. Tenga en cuenta:

source: To assign a script to an account, you have to send a :ref:`set script transaction <02_decentralchain/03_transaction:Set Script Transaction>` on behalf of the account.
es: Para asignar un script a una cuenta, debe enviar una :ref:`transacción para asignar scripts <02_decentralchain/03_transaction:Set Script Transaction>` en nombre de la cuenta.

source: You can also change or delete the script via the set script transaction, unless the script itself prohibits it.
es: También puede cambiar o eliminar el script a través de la transacción set script, a menos que el propio script lo prohíba.

source: The :ref:`minimum fee <02_decentralchain/03_transaction:Minimum Fee>` for any transaction sent from a dApp or smart account is increased by :math:`0.004` DecentralCoins if the complexity of sender's account script or dApp script verifier function exceeds the :ref:`sender complexity threshold <03_ride-language/07_dapp-to-app-invocation:Limitations>`.
es: La :ref:`tarifa mínima <02_decentralchain/03_transaction:Minimum Fee>` para cualquier transacción enviada desde una dApp o una cuenta inteligente se incrementa en :math:`0.004` DecentralCoins si la complejidad del script de cuenta del remitente o la función de verificación del script de dApp excede el :ref:`umbral de complejidad del remitente <03_ride-language/07_dapp-to-app-invocation:Limitations>`.

source: Token (Asset)
es: Token (Activo)

source: Token is a digital asset on the blockchain. A token can be used:
es: El token es un activo digital en la cadena de bloques. Se puede usar un token:

source: As a cryptocurrency to pay for goods and services within a project, as well as for crowdfunding;
es: Como criptomoneda para pagar bienes y servicios dentro de un proyecto, así como para crowdfunding;

source: As an object or resource in games etc.
es: Como objeto o recurso en juegos, etc.

source: A token can represent a physical or an intangible object. The words “token” and “asset” are used interchangeably in the DecentralChain ecosystem. DecentralCoin is the native token on the DecentralChain blockchain. :ref:`More about DecentralCoin <02_decentralchain/02_token(asset):DecentralCoin>`.
es: Un token puede representar un objeto físico o intangible. Las palabras "token" y "activo" se usan indistintamente en el ecosistema DecentralChain. DecentralCoin es el token nativo en la cadena de bloques DecentralChain. :ref:`Más sobre DecentralCoin <02_decentralchain/02_token(asset):DecentralCoin>`.

source: All other tokens are custom tokens issued on behalf of some account. Any account that has enough DecentralCoins to pay the fee can issue its own token. The new token is immediately available:
es: Todos los demás tokens son tokens personalizados emitidos en nombre de alguna cuenta. Cualquier cuenta que tenga suficientes DecentralCoins para pagar la tarifa puede emitir su propio token. El nuevo token está disponible de inmediato:

source: For transfers between accounts,
es: Para transferencias entre cuentas,

source: For trading on `Decentral.Exchange <https://decentral.exchange/>`_ (except for :ref:`NFTs <02_decentralchain/02_token(asset):Non-Fungible Token>`; :ref:`smart assets <02_decentralchain/02_token(asset):Smart Asset>` trading is temporarily unavailable),
es: Para operar en `Decentral.Exchange <https://decentral.exchange/>`_ (excepto :ref:`NFTs <02_decentralchain/02_token(asset):Non-Fungible Token>`; :ref:`activos inteligentes <02_decentralchain) /02_token(asset):Smart Asset>` el comercio no está disponible temporalmente),

source: For payments attached to dApp :ref:`script invocation <02_decentralchain/03_transaction:Invoke Script Transaction>`.
es: Para pagos adjuntos a la :ref:`invocación de script <02_decentralchain/03_transaction:Invoke Script Transaction>` de una dApp.

source: Token Issue
es: Emisión de Tokens

source: You can use `Decentral.Exchange <https://decentral.exchange/>`_ online to create an asset.
es: Puedes usar `Decentral.Exchange <https://decentral.exchange/>`_ en línea para crear un activo.

source: On the main screen make sure you are logged into your account, then click on Create Token.
es: En la pantalla principal, asegúrese de haber iniciado sesión en su cuenta, luego haga clic en Crear Token.

source: On the next screen specify the token parameters:
es: En la siguiente pantalla, especifique los parámetros del token:

source: Name: The name of the created asset can not be shorter than :math:`4` characters.
es: Nombre: el nombre del activo creado no puede tener menos de :math:`4` caracteres.

source: Description: A short description where you can include website links that can be particularly useful.
es: Descripción: Una breve descripción donde se pueden incluir enlaces a sitios web que pueden ser de especial utilidad.

source: Quantity: Define the total supply of your asset. The total supply can either be fixed at the issuance or increased later by making the asset re-issuable.
es: Cantidad: Defina el suministro total de su activo. La oferta total puede fijarse en el momento de la emisión o aumentarse más adelante haciendo que el activo sea reemisible.

source: Reissuable: Defines if the asset total supply can be increased later. If set to reissuable, the issuer can increase the supply at any time (If reissuable is selected when the asset is created, it can be changed to not reissuable at a later stage).
es: Reemisible: Define si la oferta total del activo puede incrementarse posteriormente. Si se establece en reemisible, el emisor puede aumentar el suministro en cualquier momento (si se selecciona reemisible cuando se crea el activo, se puede cambiar a no reemisible en una etapa posterior).

source: Decimals: Specify how many decimals your asset will have. For example, if you specify :math:`8` decimals, as in Bitcoin, your asset can be divided down to :math:`0.00000001`.
es: Decimales: Especifique cuántos decimales tendrá su activo. Por ejemplo, si especifica :math:`8` decimales, como en Bitcoin, su activo se puede dividir en :math:`0.00000001`.

source: :ref:`Smart asset <02_decentralchain/02_token(asset):Smart Asset>`: A smart asset is an asset with an attached script that places conditions on every transaction made for the asset in question.
es: :ref:`Activo inteligente <02_decentralchain/02_token(asset):Smart Asset>`: Un activo inteligente es un activo con un script adjunto que establece condiciones en cada transacción realizada para el activo en cuestión.

source: Script (for issuing a smart asset).
es: Script (para emitir un activo inteligente).

source: Before creating a new asset, carefully read the creation conditions. If necessary, change the name of the asset according to the conditions, then select the I understand... checkbox and click Generate.
es: Antes de crear un nuevo activo, lea atentamente las condiciones de creación. Si es necesario, cambie el nombre del activo de acuerdo con las condiciones, luego seleccione la casilla de verificación Entiendo... y haga clic en Generar.

source: On the next screen double-check the entered data and if everything is correct click Send to finish the creation or click Go Back to make corrections..
es: En la siguiente pantalla, vuelva a verificar los datos ingresados y, si todo es correcto, haga clic en Enviar para finalizar la creación o haga clic en Volver para hacer las correcciones.

source: Token ID
es: Identificador del token

source: Token ID is a byte array calculated as follows:
es: El identificador del token es una matriz de bytes calculada de la siguiente manera:

source: If the token is issued by :ref:`issue transaction <02_decentralchain/03_transaction:Issue Transaction>`, the token ID is the same as the transaction ID.
es: Si el token lo emite una :ref:`transacción para emisión <02_decentralchain/03_transaction:Issue Transaction>`, el ID del token es el mismo que el ID de la transacción.

source: In the :ref:`Node REST API <documentation:placeholder>`, the token identifier is encoded in base58. For example:
es: En :ref:`Node REST API <documentation:placeholder>`, el identificador del token está codificado en base58. Por ejemplo:

source: The :ref:`DecentralCoin <02_decentralchain/02_token(asset):DecentralCoin>` token has no identifier. The Node REST API uses null for DecentralCoin.
es: El token :ref:`DecentralCoin <02_decentralchain/02_token(asset):DecentralCoin>` no tiene identificador. La API REST de Node usa nulo para DecentralCoin.

source: Token Operations
es: Operaciones con Tokens

source: Transfer to another account
es: Transferir a otra cuenta

source: Exchange (trade deal)
es: Intercambio (acuerdo comercial)

source: Three accounts can participate in the exchange: one user creates an :ref:`order <02_decentralchain/06_order:Order>` to buy a token, the other creates an order to sell a token. The matcher combines buy and sell orders with suitable parameters and creates an :ref:`exchange transaction <02_decentralchain/03_transaction:Exchange Transaction>`.
es: Tres cuentas pueden participar en el intercambio: un usuario crea una :ref:`orden <02_decentralchain/06_order:Order>` para comprar un token, el otro crea una orden para vender un token. El emparejador combina órdenes de compra y venta con parámetros adecuados y crea una :ref:`transacción para intercambio <02_decentralchain/03_transaction:Exchange Transaction>`.

source: Burning
es: Quemado

source: Payment to :ref:`dApp <02_decentralchain/01_account:dApp and Smart Account>`
es: Pago a :ref:`dApp <02_decentralchain/01_account:dApp and Smart Account>`

source: An :ref:`invoke script transaction <02_decentralchain/03_transaction:Invoke Script Transaction>` can contain up to two payments to the dApp. Payment amount and token are available to the callable function.
es: Una :ref:`transacción para invocar scripts <02_decentralchain/03_transaction:Invoke Script Transaction>` puede contener hasta dos pagos a la dApp. El monto del pago y el token están disponibles para la función invocable.

source: Operations Available Only to Issuer
es: Operaciones Disponibles Solo para Emisor

source: The following token operations can only be performed by the account that issued the token:
es: Las siguientes operaciones de token solo pueden ser realizadas por la cuenta que emitió el token:

source: Sponsorship setup
es: Configuración de patrocinio

source: The token issuer can enable sponsorship which allows all users to pay fees in this token (instead of DecentralCoins) for invoke script transactions and transfer transactions. :ref:`More about sponsorship <02_decentralchain/03_transaction:Sponsored Fees>`. Enabling or disabling sponsorship can be done via a :ref:`sponsor fee transaction <02_decentralchain/03_transaction:Sponsor Fee Transaction>`. A dApp script can set up sponsorship using a :ref:`SponsorFee <03_ride-language/05_structures:SponsorFee>` as a result of the invoke script transaction.
es: El emisor del token puede habilitar el patrocinio que permite a todos los usuarios pagar tarifas en este token (en lugar de DecentralCoins) en transacciones para invocar scripts y transacciones para transferencia. :ref:`Más sobre el patrocinio <02_decentralchain/03_transaction:Sponsored Fees>`. La activación o desactivación del patrocinio se puede realizar mediante una :ref:`transacción para patrocinar tarifas <02_decentralchain/03_transaction:Sponsor Fee Transaction>`. Un script de dApp puede configurar el patrocinio mediante :ref:`SponsorFee <03_ride-language/05_structures:SponsorFee>` como resultado de la transacción para invocar scripts.

source: Reissue
es: Reemisión

source: Replacing the asset script
es: Sustitución del script del activo

source: Can be done via a :ref:`set asset script transaction <02_decentralchain/03_transaction:Set Asset Script Transaction>`. If the token is not a smart asset, that is, the script was not attached when the token was issued, then it is impossible to attach the script later.
es: Se puede hacer a través de una :ref:`transacción para asignar scripts de activos <02_decentralchain/03_transaction:Set Asset Script Transaction>`. Si el activo no es un activo inteligente, es decir, el script no se adjuntó cuando se emitió el activo, entonces es imposible adjuntar el script más adelante.

source: Modifying the token name and / or description
es: Modificación del nombre del token y/o descripción

source: Can be done via an :ref:`update asset info transaction <02_decentralchain/03_transaction:Update Asset Info Transaction>`.
es: Se puede hacer a través de una :ref:`transacción para actualizar información de activos <02_decentralchain/03_transaction:Update Asset Info Transaction>`.

source: Token Types
es: Tipos de Tokens

source: Non-Fungible Token
es: Token No-Fungible

source: Non-fungible token or NFT is a special type of a :ref:`token <02_decentralchain/02_token(asset):Token (Asset)>` that is issued with the following parameters:
es: El token no fungible o NFT es un tipo especial de :ref:`token <02_decentralchain/02_token(asset):Token (Asset)>` que se emite con los siguientes parámetros:

source: NFT is a singular entity that has a unique ID. This contrasts with a regular token, two coins of which (for example, two WBTC) cannot be distinguished from each other. NFTs can be used as in-game items, collectibles, certificates, or unique coupons.
es: NFT es una entidad singular que tiene una identificación única. Esto contrasta con un token regular, dos monedas de las cuales (por ejemplo, dos WBTC) no se pueden distinguir entre sí. Los NFT se pueden usar como elementos del juego, coleccionables, certificados o cupones únicos.

source: Issue of NFT
es: Emisión de NFT

source: NFT can be issued in the same ways as a regular token, see :ref:`token issue <02_decentralchain/02_token(asset):Token Issue>`. The minimum fee for an NFT issue is :math:`0.001` DecentralCoins, :math:`1000` times less than for a regular token.
es: Un NFT se puede emitir de la misma manera que un token normal, consulte :ref:`token issue <02_decentralchain/02_token(asset):Token Issue>`. La tarifa mínima para una emisión de NFT es :math:`0.001` DecentralCoins, :math:`1000` veces menos que para un token normal.

source: Smart Asset
es: Activo Inteligente
