Repository: Decentral-America/docs
Catalog: docs/locales/*/LC_MESSAGES/02_decentralchain.po
Languages: es

source: :math:`32` or :math:`0` (depends on the byte in 5.1).
es: :math:`32` o :math:`0` (depende del byte en 5.1).

source: Order type (:math:`0` - Buy, :math:`1` - Sell)
es: Tipo de orden (:math:`0` - Compra, :math:`1` - Venta)

source: Expiration
es: Vencimiento

source: Matcher's fee
es: Tarifa del emparejador

source: :strong:`Version 1`
es: :strong:`Versión 1`

source: Order Binary Format Version 1
es: Formato Binario de Orden Versión 1

source: :math:`32` or :math:`0` (depends on the byte in 3.1).
es: :math:`32` o :math:`0` (depende del byte en 3.1).

source: Price asset flag (:math:`1` - asset, :math:`0` - DecentralCoins)
es: Indicador de activo de precio (:math:`1` - activo, :math:`0` - DecentralCoins)

source: Signature
es: Firma

source: The price listed for amount asset in price asset :math:`* 10^8`. Expiration is order time to live, timestamp in future, max :math:`= 30` days in future. The signature is calculated from the following bytes:
es: El precio indicado para el activo de cantidad en activo de precio :math:`* 10^8`. La caducidad es el tiempo de vida del pedido, la marca de tiempo en el futuro, max :math:`= 30` días en el futuro. La firma se calcula a partir de los siguientes bytes:

source: Order Binary Format Version 1 Bytes
es: Formato Binario de Orden Versión 1 Bytes

source: Transaction Binary Format
es: Formato Binario de Transacción

source: Learn more about :ref:`transaction <02_decentralchain/03_transaction:Transaction>`.
es: Obtenga más información sobre :ref:`transactions <02_decentralchain/03_transaction:Transaction>`.

source: Transactions are stored on the blockchain in a binary format (byte representation). :ref:`Node extensions <documentation:placeholder>` such as :ref:`gRPC server <documentation:placeholder>` can work directly with data in binary format. The transaction signature and ID are also formed on the basis of the binary format, namely the transaction body bytes. The contents of transaction body bytes is given in the description of the binary format of each type and version of the transaction. Normally the transaction body bytes include all transaction fields, with the exception of the following fields:
es: Las transacciones se almacenan en la cadena de bloques en formato binario (representación de bytes). :ref:`Las extensiones de nodo <documentation:placeholder>` como :ref:`servidor gRPC <documentation:placeholder>` pueden trabajar directamente con datos en formato binario. La firma y el ID de la transacción también se forman sobre la base del formato binario, es decir, los bytes del cuerpo de la transacción. El contenido de los bytes del cuerpo de la transacción se proporciona en la descripción del formato binario de cada tipo y versión de la transacción. Normalmente, los bytes del cuerpo de la transacción incluyen todos los campos de la transacción, con la excepción de los siguientes campos:

source: Transaction ID (it is not stored on the blockchain),
es: ID de transacción (no se almacena en la cadena de bloques),

source: Version flag,
es: Indicador de versión,

source: Proofs or signature, depending on the version of the transaction.
es: Comprobantes o firma, según la versión de la transacción.

source: The guideline for generating a signature and ID is given in the :ref:`cryptographic practical details <02_decentralchain/09_protocol:Cryptographic Practical Details>` article. All strings are UTF-8 encoded.
es: La guía para generar una firma y una identificación se proporciona en el artículo :ref:`detalles prácticos criptográficos <02_decentralchain/09_protocol:Cryptographic Practical Details>`. Todas las cadenas están codificadas en UTF-8.

source: Protobuf facilitates the development of client libraries for the DecentralChain blockchain, as it avoids serialization errors and streamlines the creation of a correctly signed transaction. How to generate a transaction signature using protobuf:
es: Protobuf facilita el desarrollo de bibliotecas de clientes para la cadena de bloques DecentralChain, ya que evita errores de serialización y agiliza la creación de una transacción correctamente firmada. Cómo generar una firma de transacción usando protobuf:

source: Download the `protocol buffers package <https://github.com/protocolbuffers/protobuf/releases/>`_ for your programming language. Generate the Transaction class on the basis of transaction.proto.
es: Descargue el paquete `protocol buffers <https://github.com/protocolbuffers/protobuf/releases/>`_ para su lenguaje de programación. Genere la clase Transaction sobre la base de transaction.proto.

source: Fill in the transaction fields.
es: Rellene los campos de la transacción.

source: Asset IDs should be specified in the binary format.
es: Los ID de activos deben especificarse en formato binario.

source: Addresses should be specified in the shortened binary format (without the first two and the last four bytes). See the :ref:`address binary format <02_decentralchain/10_binary-format:Address Binary Format>`) article.
es: Las direcciones deben especificarse en el formato binario abreviado (sin los primeros dos y los últimos cuatro bytes). Consulte el artículo sobre el :ref:`formato binario de dirección <02_decentralchain/10_binary-format:Address Binary Format>`).

source: Serialize the transaction object to get transaction body bytes. Detailed instructions for various programming languages are provided in `protocol buffers tutorials <https://developers.google.com/protocol-buffers/docs/tutorials>`_.
es: Serialice el objeto de la transacción para obtener los bytes del cuerpo de la transacción. Se proporcionan instrucciones detalladas para varios lenguajes de programación en `tutoriales de búfer de protocolo <https://developers.google.com/protocol-buffers/docs/tutorials>`_.

source: Generate the signature for the transaction body bytes with the Curve25519 function using sender private key bytes.
es: Genere la firma para los bytes del cuerpo de la transacción con la función Curve25519 utilizando los bytes de la clave privada del remitente.

source: The byte representation of a transaction based on the protobuf schema must not contain default values. Make sure that your protocol buffers compiler does not write the field value when serializing if it is equal to the default value for this data type, otherwise the transaction signature will be invalid. Send the signed transaction to a node:
es: La representación de bytes de una transacción basada en el esquema protobuf no debe contener valores predeterminados. Asegúrese de que su compilador de búferes de protocolo no escriba el valor del campo al serializar si es igual al valor predeterminado para este tipo de datos; de lo contrario, la firma de la transacción no será válida. Envía la transacción firmada a un nodo:

source: If you use your own node and :ref:`gRPC server <documentation:placeholder>`, send the SignedTransaction object.
es: Si usa su propio nodo y :ref:`gRPC server <documentation:placeholder>`, envíe el objeto SignedTransaction.

source: If you use :ref:`Node REST API <documentation:placeholder>`, compose the JSON representation of the transaction and add the base58-encoded signature to the proof array. Send the transaction to a node using POST /transactions/broadcast method.
es: Si usa :ref:`Node REST API <documentation:placeholder>`, componga la representación JSON de la transacción y agregue la firma codificada en base58 a la matriz de prueba. Envíe la transacción a un nodo utilizando el método POST /transactions/broadcast.

source: Public key of the transaction sender.
es: Clave pública del remitente de la transacción.

source: :ref:`Transaction fee <02_decentralchain/03_transaction:Transaction Fees>` in the minimum fraction (“cent”) of the fee asset.
es: :ref:`Tarifa de transacción <02_decentralchain/03_transaction:Transaction Fees>` en la fracción mínima ("centavo") del activo de la tarifa.

source: :math:`32` bytes for the fee in a sponsored asset. :math:`0` for the fee in DecentralCoins
es: :math:`32` bytes por la tarifa en un activo patrocinado. :math:`0` para la tarifa en DecentralCoins

source: ID of the token of the fee. The fee in a sponsored asset is only available for invoke script transactions and transfer transactions. See the :ref:`sponsored fee <02_decentralchain/03_transaction:Sponsored Fees>` article.
es: ID del token de la tarifa. La tarifa en un activo patrocinado solo está disponible para transacciones de script de invocación y transacciones de transferencia. Consulte el artículo sobre :ref:`tarifas patrocinadas <02_decentralchain/03_transaction:Sponsored Fees>`.

source: Transaction timestamp: Unix time in milliseconds. The transaction won't be added to the blockchain if the timestamp value is more than :math:`2` hours back or :math:`1.5` hours forward of the current block timestamp.
es: Marca de tiempo de la transacción: tiempo Unix en milisegundos. La transacción no se agregará a la cadena de bloques si el valor de la marca de tiempo es más de :math:`2` horas atrás o :math:`1.5` horas antes de la marca de tiempo del bloque actual.

source: Transaction version.
es: Versión de transacción.

source: Each proof up to :math:`64` bytes,up to :math:`8` proofs.
es: Cada prueba hasta :math:`64` bytes, hasta :math:`8` pruebas.

source: :ref:`Transaction proofs <02_decentralchain/03_transaction:Transaction Proofs>` that are used to check the validity of the transaction. The array can contain several transaction signatures (but not limited to signatures only).
es: :ref:`Pruebas de transacción <02_decentralchain/03_transaction:Transaction Proofs>` que se utilizan para verificar la validez de la transacción. La matriz puede contener varias firmas de transacciones (pero no se limita solo a firmas).

source: The fields that depend on the type of transaction are described in the following articles:
es: Los campos que dependen del tipo de transacción se describen en los siguientes artículos:

source: :ref:`Update asset info transaction binary format <02_decentralchain/10_binary-format:Update Asset Info Transaction Binary Format>`
es: :ref:`Formato binario de transacción para actualizar información de activos <02_decentralchain/10_binary-format:Update Asset Info Transaction Binary Format>`

source: Burn Transaction Binary Format
es: Formato Binario de Transacción para Quemado

source: Learn more about :ref:`burn transaction <02_decentralchain/03_transaction:Burn Transaction>`.
es: Obtenga más información sobre la :ref:`transacción para quemado <02_decentralchain/03_transaction:Burn Transaction>`.

source: Burn Transaction Binary Format Version 3
es: Formato Binario de Transacción para Quemado Versión 3

source: Amount of token to burn, specified in the minimum fraction (“cents”).
es: Cantidad de ficha a quemar, especificada en la fracción mínima (“centavos”).

source: :ref:`ID <02_decentralchain/02_token(asset):Token ID>` of token to burn.
es: :ref:`ID <02_decentralchain/02_token(asset):Token ID>` del token a quemar

source: Burn Transaction Binary Format Version 2
es: Formato Binario de Transacción para Quemado Versión 2

source: Comment
es: Comentario

source: Version flag
es: Indicador de versión

source: Indicates the transaction version is :math:`2` or higher. Value must be :math:`0`.
es: Indica que la versión de la transacción es :math:`2` o superior. El valor debe ser :math:`0`.

source: :ref:`Transaction type ID <02_decentralchain/03_transaction:Transaction Types>`
es: :ref:`ID de tipo de transacción <02_decentralchain/03_transaction:Transaction Types>`

source: Value must be :math:`6`.
es: El valor debe ser :math:`6`.

source: Transaction version
es: Versión de transacción

source: Public key of the transaction sender
es: Clave pública del remitente de la transacción

source: :ref:`ID <02_decentralchain/02_token(asset):Token ID>` of the token to burn
es: :ref:`ID <02_decentralchain/02_token(asset):Token ID>` del token a quemar

source: Amount of tokens to burn
es: Cantidad de tokens para quemar

source: :ref:`Transaction fee <02_decentralchain/03_transaction:Transaction Fees>`
es: :ref:`Tarifa de transacción <02_decentralchain/03_transaction:Transaction Fees>`

source: Transaction timestamp
es: Marca de tiempo de la transacción

source: Transaction proofs
es: Pruebas de la transacción

source: See :ref:`transaction proofs binary format <02_decentralchain/10_binary-format:Transaction Proofs Binary Format>`
es: Consulte el :ref:`formato binario de pruebas de transacción <02_decentralchain/10_binary-format:Transaction Proofs Binary Format>`

source: If the array is empty, then :math:`S = 3`. If the array is not empty, then :math:`S = 3 + 2 × N + 64 × N`, where :math:`N` is the number of proofs in the array. The maximum number of proofs in the array is :math:`8`. The size of each proof is :math:`64` bytes.
es: Si la matriz está vacía, entonces :math:`S = 3`. Si la matriz no está vacía, entonces :math:`S = 3 + 2 × N + 64 × N`, donde :math:`N` es el número de pruebas en la matriz. El número máximo de pruebas en la matriz es :math:`8`. El tamaño de cada prueba es :math:`64` bytes.

source: The fields :math:`2`, :math:`3`, :math:`4`, :math:`5`, :math:`6`, :math:`7`, :math:`8` and :math:`9` are the transaction body bytes.
es: Los campos :math:`2`, :math:`3`, :math:`4`, :math:`5`, :math:`6`, :math:`7`, :math:`8` y :math:`9` son los bytes del cuerpo de la transacción.

source: :strong:`JSON Representation of Transaction`
es: :strong:`Representación JSON de Transacción`

source: Burn Transaction Binary Format Version 1
es: Formato Binario de Transacción para Quemado Versión 1

source: Transaction signature
es: Firma de transacción

source: The fields :math:`1`, :math:`2`, :math:`3`, :math:`4`, :math:`5` and :math:`6` are the transaction body bytes.
es: Los campos :math:`1`, :math:`2`, :math:`3`, :math:`4`, :math:`5` y :math:`6` son los bytes del cuerpo de la transacción.

source: Create Alias Transaction Binary Format
es: Formato Binario de Transacción para Crear Alias

source: Learn more about :ref:`create alias transaction <02_decentralchain/03_transaction:Create Alias Transaction>`.
es: Obtenga más información sobre la :ref:`transacción para crear alias <02_decentralchain/03_transaction:Create Alias Transaction>`.

source: Create Alias Transaction Binary Format Version 3
es: Formato Binario de Transacción para Crear Alias Versión 3

source: From :math:`4` to :math:`30` bytes
es: De :math:`4` a :math:`30` bytes

source: Create Alias Transaction Binary Format Version 2
es: Formato Binario de Transacción para Crear Alias Versión 2

source: Value must be :math:`10`.
es: El valor debe ser :math:`10`.

source: Alias length
es: Longitud del alias

source: Number of characters in the alias name.
es: Número de caracteres en el nombre del alias.

source: from :math:`4` to :math:`30`
es: de :math:`4` a :math:`30`

source: The fields :math:`2`, :math:`3`, :math:`4`, :math:`5`, :math:`6`, :math:`7` and :math:`8` are the transaction body bytes.
es: Los campos :math:`2`, :math:`3`, :math:`4`, :math:`5`, :math:`6`, :math:`7` y :math:`8` son los bytes del cuerpo de la transacción.

source: Create Alias Transaction Binary Format Version 1
es: Formato Binario de Transacción para Crear Alias Versión 1

source: From :math:`4` to :math:`30`
es: De :math:`4` a :math:`30`

source: Data Transaction Binary Format
es: Formato Binario de Transacción para Datos

source: Learn more about :ref:`data transaction <02_decentralchain/03_transaction:Data Transaction>`.
es: Obtenga más información sobre la :ref:`transacción para datos <02_decentralchain/03_transaction:Data Transaction>`.

source: Data Transaction Binary Format Version 2
es: Formato Binario de Transacción para Datos Versión 2

source: Up to :math:`400` bytes
es: Hasta :math:`400` bytes

source: Entry key.
es: Llave de entrada.

source: Up to :math:`32,767` bytes
es: Hasta :math:`32,767` bytes

source: Entry value. If omitted, the transaction deletes the entry.
es: Valor de entrada. Si se omite, la transacción elimina la entrada.

source: The maximum number of entries is :math:`100`. The maximum data size (keys + values) is :math:`165,890` bytes.
es: El número máximo de entradas es :math:`100`. El tamaño máximo de datos (claves + valores) es :math:`165,890` bytes.

source: Data Transaction Binary Format Version 1
es: Formato Binario de Transacción para Datos Versión 1

source: Value must be :math:`12`.
es: El valor debe ser :math:`12`.

source: Length of the data array
es: Longitud de la matriz de datos

source: Key 1 length
es: Longitud de la clave 1

source: Key 1
es: Llave 1

source: Up to :math:`400`
es: Hasta :math:`400`

source: Maximum of :math:`100` characters.
es: Máximo de :math:`100` caracteres.

source: Value 1 type
es: Valor 1 tipo

source: Options are: 0 - :ref:`Long <02_decentralchain/09_protocol:Blockchain Data Types>`. 1 - :ref:`Boolean <02_decentralchain/09_protocol:Blockchain Data Types>`. 2 - Array[:ref:`Byte <02_decentralchain/09_protocol:Blockchain Data Types>`]. 3 - :ref:`String <02_decentralchain/09_protocol:Blockchain Data Types>`.
es: Las opciones son: 0 - :ref:`Long <02_decentralchain/09_protocol:Blockchain Data Types>`. 1 - :ref:`Boolean <02_decentralchain/09_protocol:Blockchain Data Types>`. 2 - Array[:ref:`Byte <02_decentralchain/09_protocol:Blockchain Data Types>`]. 3 - :ref:`String <02_decentralchain/09_protocol:Blockchain Data Types>`.

source: Value 1 length
es: Valor 1 longitud

source: This field is present only if the value is of type of array of bytes or a string. If the value is of type of integer or a boolean, this field should not be included in the data structure.
es: Este campo está presente solo si el valor es del tipo de matriz de bytes o una cadena. Si el valor es de tipo entero o booleano, este campo no debe incluirse en la estructura de datos.

source: Value 1
es: Valor 1

source: T is one of the following: 1) :ref:`Long <02_decentralchain/09_protocol:Blockchain Data Types>`, :math:`S = 8`. 2) :ref:`Boolean <02_decentralchain/09_protocol:Blockchain Data Types>`, :math:`S = 1`. 3) Array[:ref:`Byte <02_decentralchain/09_protocol:Blockchain Data Types>`], :math:`S ⩽ 32,767`. 4) :ref:`String <02_decentralchain/09_protocol:Blockchain Data Types>`, :math:`S ⩽ 32,767`.
es: T es uno de los siguientes: 1) :ref:`Long <02_decentralchain/09_protocol:Blockchain Data Types>`, :math:`S = 8`. 2) :ref:`Boolean <02_decentralchain/09_protocol:Blockchain Data Types>`, :math:`S = 1`. 3) Array[:ref:`Byte <02_decentralchain/09_protocol:Blockchain Data Types>`], :math:`S ⩽ 32,767`. 4) :ref:`String <02_decentralchain/09_protocol:Blockchain Data Types>`, :math:`S ⩽ 32,767`.

source: Key 2 length
es: Longitud de la llave 2

source: Key 2
es: Llave 2

source: Value 2 type
es: Tipo de valor 2

source: Value 2 length
es: Valor 2 longitud

source: Value 2
es: Valor 2

source: N-th key length
es: Longitud de N-ésima llave

source: N-th key
es: N-ésima llave

source: N-th value type
es: Tipo del N-ésimo valor

source: N-th value length
es: Longitud del valor N-ésimo

source: N-th value
es: N-ésimo valor

source: If the array is empty, then :math:`S = 3`. If the array is not empty, then :math:`S = 3 + 2 × N + 64 × N`, where :math:`N` is the number of proofs in the array. The maximum number of proofs in the array is :math:`8`. The size of each proof is 64 bytes.
es: Si la matriz está vacía, entonces :math:`S = 3`. Si la matriz no está vacía, entonces :math:`S = 3 + 2 × N + 64 × N`, donde :math:`N` es el número de pruebas en la matriz. El número máximo de pruebas en la matriz es :math:`8`. El tamaño de cada prueba es de 64 bytes.

source: The fields :math:`1`, :math:`2`, :math:`3`, :math:`4`, :math:`5`, :math:`6.1`, :math:`6.2`, :math:`6.3`, :math:`6.4`, :math:`6.5`, :math:`6.6`, :math:`6.7`, :math:`6.8`, :math:`6.9`, :math:`6.10`, :math:`6.[5 × N - 4]`, :math:`6.[5 × N - 3]`, :math:`6.[5 × N - 2]`, :math:`6.[5 × N - 1]`, :math:`6.[5 × N]`, :math:`7` and :math:`8` are the transaction body bytes. The maximum number of records is :math:`100`. The maximum size of transaction body bytes is :math:`153,600` bytes.
es: Los campos :math:`1`, :math:`2`, :math:`3`, :math:`4`, :math:`5`, :math:`6.1`, :math:`6.2` , :math:`6.3`, :math:`6.4`, :math:`6.5`, :math:`6.6`, :math:`6.7`, :math:`6.8`, :math:`6.9`, :math:`6.10`, :math:`6.[5 × N - 4]`, :math:`6.[5 × N - 3]`, :math:`6.[5 × N - 2] `, :math:`6.[5 × N - 1]`, :math:`6.[5 × N]`, :math:`7` y :math:`8` son los bytes del cuerpo de la transacción. El número máximo de registros es :math:`100`. El tamaño máximo de los bytes del cuerpo de la transacción es :math:`153,600` bytes.

source: Exchange Transaction Binary Format
es: Formato Binario de Transacción para Intercambio

source: Learn more about :ref:`exchange transaction <02_decentralchain/03_transaction:Exchange Transaction>`.
es: Obtenga más información sobre la :ref:`transacción para intercambio <02_decentralchain/03_transaction:Exchange Transaction>`.

source: Exchange transaction of version 3 can accept orders of versions 1 –4.
es: Una transacción para intercambio de la versión 3 puede aceptar pedidos de las versiones 1–4.

source: Exchange Transaction Binary Format Version 3
es: Formato Binario de Transacción para Intercambio Versión 3

source: Amount of the amount asset (base currency) that the buyer received from the seller, specified in the minimum fraction (“cent”) of asset.
es: Monto de la cantidad de activo (moneda base) que el comprador recibió del vendedor, especificado en la fracción mínima (“centavo”) de activo.

source: Price for the amount asset (base currency) nominated in the price asset (quote currency), multiplied by :math:`10^{8}`. For more details see the :ref:`order <02_decentralchain/06_order:Order>` article.
es: Precio del activo de cantidad (moneda base) nominado en el activo de precio (moneda de cotización), multiplicado por :math:`10^{8}`. Para obtener más detalles, consulte el artículo sobre :ref:`órdenes <02_decentralchain/06_order:Order>`.

source: Buy matcher fee. The fee token ID is indicated in buy order.
es: Comprar tarifa para el emparejador. La identificación del token de tarifa se indica en la orden de compra.

source: Sell matcher fee The fee token ID is indicated in sell order.
es: Tarifa del emparejador para venta. El ID del token de tarifa se indica en la orden de venta.

source: orders
es: pedidos

source: Buy order and sell order. See the :ref:`order binary format <02_decentralchain/10_binary-format:Order Binary Format>`.
es: Orden de compra y orden de venta. Consulte el :ref:`formato binario de orden <02_decentralchain/10_binary-format:Order Binary Format>`.

source: Transaction version 2 can accept orders of version 1, 2 and 3.
es: La versión 2 de la transacción puede aceptar órdenes de la versión 1, 2 y 3.

source: Exchange Transaction Binary Format Version 2
es: Formato Binario de Transacción para Intercambio Versión 2

source: Value must be :math:`7`.
es: El valor debe ser :math:`7`.

source: Buy order size
es: Tamaño del pedido de compra

source: Size including flag 4.2.
es: Tamaño incluida la bandera 4.2.

source: Buy order version flag
es: Indicador de versión de orden de compra

source: :math:`S = 1` if the order version is :math:`1`. :math:`S = 0` if the order version is 2 or 3.
es: :math:`S = 1` si la versión del pedido es :math:`1`. :math:`S = 0` si la versión del pedido es 2 o 3.

source: Buy order
es: Orden de compra

source: See :ref:`order binary format <02_decentralchain/10_binary-format:Order Binary Format>`
es: Consulte :ref:`formato binario de orden <02_decentralchain/10_binary-format:Order Binary Format>`

source: Sell order size
es: Tamaño de la orden de venta

source: Size including flag 5.2.
es: Tamaño incluida la bandera 5.2.

source: Sell order version flag
es: Bandera de versión de orden de venta

source: Sell order
es: Orden de venta
