Repository: Decentral-America/docs
Catalog: docs/locales/*/LC_MESSAGES/02_decentralchain.po
Languages: es

source: A generating node specifies the new desired reward size via settings in the node configuration file, the setting value is specified in Decentralites. If the value is greater than the current reward size, then the generator votes for the current reward size increase; if the value is smaller — for the decrease. If the setting value is not specified in the configuration file, then the generator votes for keeping the current reward size. When a node generates a block, it writes into that block the value of the desired reward size specified in the setting from its own node configuration file. If the setting value is not specified in the configuration file, then :math:`-1` is written to the block. During the voting time in :math:`10,000` blocks, a single node can generate several blocks, therefore one node can vote several times. How often a node generates blocks is determined by the LPoS consensus.
es: Un nodo generador especifica el nuevo tamaño de recompensa deseado a través de la configuración en el archivo de configuración del nodo, el valor de configuración se especifica en Decentralites. Si el valor es mayor que el tamaño de la recompensa actual, entonces el generador vota por el aumento del tamaño de la recompensa actual; si el valor es más pequeño — para la disminución. Si el valor de configuración no se especifica en el archivo de configuración, entonces el generador vota por mantener el tamaño de la recompensa actual. Cuando un nodo genera un bloque, escribe en ese bloque el valor del tamaño de recompensa deseado especificado en la configuración de su propio archivo de configuración de nodo. Si el valor de configuración no se especifica en el archivo de configuración, :math:`-1` se escribe en el bloque. Durante el tiempo de votación en :math:`10,000` bloques, un solo nodo puede generar varios bloques, por lo tanto, un nodo puede votar varias veces. La frecuencia con la que un nodo genera bloques está determinada por el consenso LPoS.

source: How Votes are Counted
es: Cómo se Cuentan los Votos

source: To count the votes, all :math:`10,000` blocks generated during the voting period are inspected. If either :math:`-1` or the value that is equal to the current reward size is recorded to the block, then the generator votes for keeping the current reward size. If the value recorded to the block is greater than the current reward size, then the generator votes for the current reward size increase; if the value is smaller — for the decrease. The block reward is increased/decreased only if more than half of the :math:`10,000` votes — i.e. :math:`5,001` votes or more — were given for increase/decrease. The amount of the current reward is increased/decreased by :math:`0.5` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`.
es: Para contar los votos, se inspeccionan todos los :math:`10,000` bloques generados durante el período de votación. Si se registra en el bloque :math:`-1` o el valor que es igual al tamaño de la recompensa actual, entonces el generador vota por mantener el tamaño de la recompensa actual. Si el valor registrado en el bloque es mayor que el tamaño de la recompensa actual, entonces el generador vota por el aumento del tamaño de la recompensa actual; si el valor es más pequeño — para la disminución. La recompensa del bloque aumenta/disminuye solo si más de la mitad de los :math:`10,000` votos, es decir, :math:`5,001` votos o más, se otorgaron para aumentar/disminuir. La cantidad de la recompensa actual aumenta/disminuye en :math:`0.5` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`.

source: At the blockchain height of :math:`2,000,000`, the block reward equals :math:`5` DecentralCoins. At the height of :math:`2,090,000`, another voting starts. During the :math:`10,000` blocks of voting :math:`6,000` votes were given for reward increase, :math:`1,000` — for decrease, :math:`3,000` — for keeping the current reward size. From the height of :math:`2`, :math:`100,000` to the height of :math:`2,199,999`, the new reward size will be :math:`5.5` DecentralCoins, because the reward change step is :math:`0.5` DecentralCoins. The next voting will take place from the height of :math:`2,190,000` to :math:`2,199,999`.
es: A la altura de la cadena de bloques de :math:`2,000,000`, la recompensa del bloque es igual a :math:`5` DecentralCoins. A la altura de :math:`2,090,000`, comienza otra votación. Durante los :math:`10,000` bloques de votación, se otorgaron :math:`6,000` votos para aumentar la recompensa, :math:`1,000` — para disminuir, :math:`3,000` — para mantener el tamaño actual de la recompensa. Desde la altura de :math:`2`, :math:`100,000` hasta la altura de :math:`2,199,999`, el nuevo tamaño de recompensa será :math:`5.5` DecentralCoins, porque el paso de cambio de recompensa es :math :`0.5` Monedas descentralizadas. La próxima votación tendrá lugar desde la altura de :math:`2,190,000` hasta :math:`2,199,999`.

source: At the blockchain height of :math:`2,100,000`, the block reward equals :math:`5.5` DecentralCoins. At the height of :math:`2,190,000`, another voting starts. During the :math:`10,000` blocks of voting :math:`4,500` votes were given for reward increase, :math:`4,000` — for decrease, :math:`1,500` — for keeping the current reward size. From the height of :math:`2,200,000` to the height of :math:`2,299,999`, the "new" reward size will be the same — :math:`5.5` DecentralCoins. Although the highest number of votes were given for the reward increase, it was not enough to change the current reward size. In order for the current reward size to be increased, at least :math:`5,001` votes must be given for the increase. The next voting will take place from the height of :math:`2,290,000` to :math:`2,299,999`.
es: A la altura de la cadena de bloques de :math:`2,100,000`, la recompensa del bloque es igual a :math:`5.5` DecentralCoins. A la altura de :math:`2,190,000`, comienza otra votación. Durante los :math:`10,000` bloques de votación, se otorgaron :math:`4,500` votos para aumentar la recompensa, :math:`4,000` — para disminuir, :math:`1,500` — para mantener el tamaño actual de la recompensa. Desde la altura de :math:`2,200,000` hasta la altura de :math:`2,299,999`, el "nuevo" tamaño de la recompensa será el mismo: :math:`5.5` DecentralCoins. Aunque se otorgó la mayor cantidad de votos para el aumento de la recompensa, no fue suficiente para cambiar el tamaño actual de la recompensa. Para aumentar el tamaño de la recompensa actual, se deben otorgar al menos :math:`5,001` votos para el aumento. La próxima votación tendrá lugar desde la altura de :math:`2,290,000` hasta :math:`2,299,999`.

source: Leased Proof of Stake
es: Prueba de Participación Arrendada

source: Leased Proof of Stake (LPoS) is an enhanced type of proof of stake consensus algorithm by which the DecentralChain blockchain network aims to achieve the distributed consensus to secure the network.
es: Leased Proof of Stake (LPoS) es un tipo mejorado de algoritmo de consenso de prueba de participación mediante el cual la red blockchain DecentralChain tiene como objetivo lograr el consenso distribuido para asegurar la red.

source: Leasing Benefits for the Node Owner
es: Beneficios del Arrendamiento para el Propietario del Nodo

source: :ref:`Nodes <02_decentralchain/05_node:Node>` can use the leased tokens to generate blocks and get the :ref:`mining reward <02_decentralchain/05_node:Block Reward>`. For that purpose, the generating balance of a node must be at least :math:`10000` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`.
es: Los :ref:`nodes <02_decentralchain/05_node:Node>` puede usar los tokens arrendados para generar bloques y obtener la :ref:`recompensa <02_decentralchain/05_node:Block Reward>`. Para ello, el saldo generador de un nodo debe ser al menos :math:`10000` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`.

source: Leasing Benefits for the Token Holder
es: Beneficios de Arrendamiento para el Titular del Token

source: LPoS allows the token holders to lease their tokens to the DecentralChain nodes and earn a percentage of the payout as a reward. By using LPoS, lessors will be able to participate in the process of generating new blocks because the larger the amount that is leased to a DecentralChain node, the higher the chances for that node to be selected to generate the next block. If that node is selected, then the leaser will receive a reward. When the user starts leasing the tokens, those leased tokens are locked and remain in the same address with the full control of their owner (they are not transferred to the node, they just remain unspendable until the lease is canceled by the lessor). The only thing to consider when leasing is to choose the right node operator, as the operator's node may work with different efficiency and send back different percentages as rewards.
es: LPoS permite a los titulares de tokens arrendar sus tokens a los nodos de DecentralChain y obtener un porcentaje del pago como recompensa. Al usar LPoS, los arrendadores podrán participar en el proceso de generación de nuevos bloques porque cuanto mayor sea la cantidad arrendada a un nodo DecentralChain, mayores serán las posibilidades de que ese nodo sea seleccionado para generar el siguiente bloque. Si se selecciona ese nodo, el arrendatario recibirá una recompensa. Cuando el usuario comienza a arrendar los tokens, esos tokens arrendados se bloquean y permanecen en la misma dirección con el control total de su propietario (no se transfieren al nodo, simplemente no se pueden gastar hasta que el arrendador cancele el arrendamiento). Lo único que se debe tener en cuenta al arrendar es elegir el operador de nodo correcto, ya que el nodo del operador puede funcionar con una eficiencia diferente y devolver diferentes porcentajes como recompensa.

source: Rewards
es: Recompensas

source: The node owner may send the lessor a part of the rewards according to his conditions.
es: El propietario del nodo podrá enviar al arrendador una parte de las recompensas según sus condiciones.

source: The more transactions that are made on the network, the more rewards the lessors get.
es: Cuantas más transacciones se realicen en la red, más recompensas obtienen los arrendadores.

source: These rewards mostly are in :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` but also they can be in the form of different tokens with the unique DecentralCoins feature where different tokens can be accepted as a fee.
es: Estas recompensas se encuentran principalmente en :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` pero también pueden ser en forma de diferentes tokens con la característica única DecentralCoins donde se pueden aceptar diferentes tokens como tarifa.

source: LPoS Transactions
es: Transacciones LPoS

source: To start leasing, the token holder needs to create a lease transaction and specify the recipient address (node address) along with the amount of :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` to lease. There are two types of transactions which are used in the LPoS:
es: Para comenzar el arrendamiento, el titular del token debe crear una transacción de arrendamiento y especificar la dirección del destinatario (dirección del nodo) junto con la cantidad de :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` para arrendar. Hay dos tipos de transacciones que se utilizan en el LPoS:

source: :ref:`Lease transaction <02_decentralchain/03_transaction:Lease Transaction>` to activate the leasing process.
es: :ref:`Transacción para arrendamiento <02_decentralchain/03_transaction:Lease Transaction>` para activar el proceso de arrendamiento.

source: :ref:`Lease cancel transaction <02_decentralchain/03_transaction:Lease Cancel Transaction>` to deactivate the leasing process.
es: :ref:`Transacción para cancelar arrendamiento <02_decentralchain/03_transaction:Lease Cancel Transaction>` para desactivar el proceso de arrendamiento.

source: Create a Lease
es: Crear un Contrato de Arrendamiento

source: You can use `Decentral.Exchange <https://decentral.exchange/>`_ online to create a lease.
es: Puedes usar `Decentral.Exchange <https://decentral.exchange/>`_ en línea para crear un arrendamiento

source: Make sure you are logged into your account. On the main screen navigate to Wallet > Leasing.
es: Asegúrate de haber iniciado sesión en tu cuenta. En la pantalla principal, vaya a Billetera > Arrendamiento.

source: On the next screen click Start Lease and then select the recipient between the list of nodes and indicate the amount you want to lease.
es: En la siguiente pantalla, haga clic en Iniciar Arrendamiento y luego seleccione el destinatario entre la lista de nodos e indique la cantidad que desea arrendar.

source: Verify all the information and click Start Lease again to confirm.
es: Verifique toda la información y haga clic en Iniciar Arrendamiento nuevamente para confirmar.

source: Order
es: Orden

source: Order is the instruction from the :ref:`account <02_decentralchain/01_account:Account>` to matcher to buy or sell a :ref:`token <02_decentralchain/02_token(asset):Token (Asset)>` on the exchange.
es: La orden es la instrucción de la :ref:`cuenta <02_decentralchain/01_account:Account>` al emparejador para comprar o vender un :ref:`token <02_decentralchain/02_token(asset):Token (Asset)>` en el intercambio.

source: Asset Pair
es: Par de Activos

source: Each order contains amount asset / price asset pair, also called asset pair.
es: Cada orden contiene un par de activos de cantidad / precio, también llamado par de activos.

source: :strong:`Example`
es: :strong:`Ejemplo`

source: :strong:`Asset Pair Fields`
es: :strong:`Campos del Par de Activos`

source: Asset Pair Fields
es: Campos del Par de Activos

source: Field name
es: Nombre del campo

source: ID of the pair's first asset, that the order's sender wants to buy or sell.
es: ID del primer activo del par, que el remitente de la orden quiere comprar o vender.

source: ID of the pair's second asset, in which the price of the order is expressed. null value means that asset is :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`.
es: ID del segundo activo del par, en el que se expresa el precio de la orden. valor nulo significa que el activo es :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`.

source: Order's Amount and Price
es: Cantidad y Precio del Pedido

source: In the user interface, the amount and price are usually presented as values with a fractional part (for example, :math:`0.74585728` DecentralCoins), i.e. in the denormalized form. The denormalized form is convenient for humans, but not for calculations. To solve the problem of calculation accuracy, the normalization is performed.
es: En la interfaz de usuario, la cantidad y el precio generalmente se presentan como valores con una parte fraccionaria (por ejemplo, :math:`0.74585728` DecentralCoins), es decir, en forma desnormalizada. La forma desnormalizada es conveniente para los humanos, pero no para los cálculos. Para resolver el problema de la precisión del cálculo, se realiza la normalización.

source: In the user interface, the amount and price are usually presented as values with a fractional part (for example, :math:`0.74585728` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`), i.e. in the denormalized form. The denormalized form is convenient for humans, but not for calculations. To solve the problem of calculation accuracy, the normalization is performed, i.e. amount and price are represented as an integer. So, :math:`0.74585728` DecentralCoins is :math:`0.74585728 × 10^{8}` or :math:`74585728` Decentralites. In this case, the exponent is :math:`8`, because DecentralCoins has :math:`8` decimals after the decimal point. Other assets may have different amount of decimals. For example, TDX has 2 decimals.
es: En la interfaz de usuario, la cantidad y el precio generalmente se presentan como valores con una parte fraccionaria (por ejemplo, :math:`0.74585728` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`), es decir, en forma desnormalizada. La forma desnormalizada es conveniente para los humanos, pero no para los cálculos. Para resolver el problema de la precisión del cálculo, se realiza la normalización, es decir, la cantidad y el precio se representan como un número entero. Entonces, :math:`0.74585728` DecentralCoins es :math:`0.74585728 × 10^{8}` o :math:`74585728` Decentralitos. En este caso, el exponente es :math:`8`, porque DecentralCoins tiene :math:`8` decimales después del punto decimal. Otros activos pueden tener diferente cantidad de decimales. Por ejemplo, TDX tiene 2 decimales.

source: Amount
es: Cantidad

source: Consider buying :math:`2.13` TDX at the price of :math:`0.35016774` DecentralCoins for one TDX. Here the asset pair is TDX / DecentralCoins. The amount in the order is the number of units sold or bought in conventional "pennies". This value in the current case is :math:`213`, since :math:`2.13` TDX :math:`= 2.13 × 10^{2}` = 213` "pennies" of TDX. So, to bring the amount to the normalized form, it is multiplied by :math:`10^{amountAssetDecimals}`.
es: Considere comprar :math:`2.13` TDX al precio de :math:`0.35016774` DecentralCoins por una TDX. Aquí el par de activos es TDX / DecentralCoins. El importe del pedido es el número de unidades vendidas o compradas en "centavos" convencionales. Este valor en el caso actual es :math:`213`, ya que :math:`2.13` TDX :math:`= 2.13 × 10^{2}` = 213` \pennies\ de TDX. Entonces, para llevar la cantidad a la forma normalizada, se multiplica por :math:`10^{amountAssetDecimals}`.

source: Price
es: Precio

source: Price is the value of 1 unit of the amount asset, expressed in the price asset. In the TDX / DecentralCoins example above, this is the price in DecentralCoins for 1 TDX. To normalize price, it is multiplied by:
es: El precio es el valor de 1 unidad de la cantidad del activo, expresado en el precio del activo. En el ejemplo anterior de TDX/DecentralCoins, este es el precio en DecentralCoins por 1 TDX. Para normalizar el precio, se multiplica por:

source: In orders of versions 1, 2, 3: :math:`10^{(8 + priceAssetDecimals - amountAssetDecimals)}`.
es: En órdenes de versiones 1, 2, 3: :math:`10^{(8 + priceAssetDecimals - amountAssetDecimals)}`.

source: In orders of version 4: at :math:`10^{8}`.
es: En órdenes de la versión 4: en :math:`10^{8}`.

source: The exponent of :math:`8` is selected because there cannot be an asset with the exceeding quantity of decimals on the DecentralChain blockchain. The matcher algorithm has a limitation in relation to price: the last N digits of the normalized price must be zeros (N is price_decimals minus amount_decimals). If this is not so, then the matcher rejects the order on placement.
es: El exponente de :math:`8` se selecciona porque no puede haber un activo con una cantidad superior de decimales en la cadena de bloques DecentralChain. El algoritmo del emparejador tiene una limitación en relación con el precio: los últimos N dígitos del precio normalizado deben ser ceros (N es precio_decimales menos cantidad_decimales). Si esto no es así, entonces el emparejador rechaza el pedido en la colocación.

source: Price Asset Quantity Calculation
es: Cálculo de Cantidad del Activo de Precio

source: The quantity of price asset in normalized form which:
es: La cantidad del activo de precio en forma normalizada que:

source: Will be given by sender if order is BUY.
es: Será proporcionado por el remitente si el pedido es de COMPRA.

source: Will be acquired by sender if order is SELL.
es: Será adquirido por el remitente si el pedido es de VENTA.

source: Is calculated by the following formula: amount × price × :math:`10^{(priceAssetDecimals - amountAssetDecimals - 8)}`.
es: Se calcula mediante la siguiente fórmula: amount × price ×:math:`10^{(priceAssetDecimals - amountAssetDecimals - 8)}`.

source: In orders of versions 1, 2, 3: amount × price × :math:`10^{-8}`
es: En órdenes de versiones 1, 2, 3: amount× price × :math:`10^{-8}`

source: In orders of version 4: amount × price × :math:`10^{(priceAssetDecimals - amountAssetDecimals - 8)}`.
es: En los pedidos de la versión 4: amount × price × :math:`10^{(priceAssetDecimals - cantidadAssetDecimals - 8)}`.

source: If the result of the calculation is a value with a fractional part, then the fractional part is discarded. Designations in the above formula:
es: Si el resultado del cálculo es un valor con una parte fraccionaria, entonces se descarta la parte fraccionaria. Designaciones en la fórmula anterior:

source: Amount — amount in normalized form.
es: Amount — cantidad en forma normalizada.

source: Price — price in normalized form.
es: Price — precio en forma normalizada.

source: PriceAssetDecimals — the number of decimal places of the price asset.
es: PriceAssetDecimals — el número de lugares decimales del activo de precio.

source: AmountAssetDecimals — the number of decimal places of the amount asset.
es: AmountAssetDecimals — el número de lugares decimales del activo de cantidad.

source: Order Cancellation
es: Cancelación de Orden

source: The order sender may cancel the order before it is executed. Unexecuted orders are automatically canceled at the date and time specified by the order sender.
es: El remitente de la orden puede cancelar la orden antes de que se ejecute. Los pedidos no ejecutados se cancelan automáticamente en la fecha y hora especificadas por el remitente del pedido.

source: Order Expiration Date
es: Fecha de Vencimiento de la Orden

source: Order expiration date is the date and time of automatic cancellation of an unexecuted order. The date is specified in milliseconds which have passed since the beginning of the unix epoch. The expiration time can't be earlier than matcher time + :math:`1` minute and later than matcher time + :math:`30` days.
es: La fecha de vencimiento del pedido es la fecha y la hora de cancelación automática de un pedido no ejecutado. La fecha se especifica en milisegundos que han pasado desde el comienzo de la época de Unix. El tiempo de caducidad no puede ser anterior al tiempo del emparejador + :math:`1` minuto ni posterior al tiempo de emparejador + :math:`30` días.

source: Order Timestamp
es: Marca de Tiempo de la Orden

source: Order timestamp is the time when the matcher added the order to the order book. The time is specified in milliseconds that have passed since the beginning of the unix epoch.
es: La marca de tiempo del pedido es el momento en que el emparejador agregó el pedido al libro de pedidos. El tiempo se especifica en milisegundos que han pasado desde el comienzo de la época de Unix.

source: Order Binary Format
es: Formato Binario de Orden

source: See the :ref:`order binary format <02_decentralchain/10_binary-format:Order Binary Format>` page.
es: Consulte el :ref:`formato binario de orden <02_decentralchain/10_binary-format:Order Binary Format>` page.

source: Oracle
es: Oráculo

source: Oracle is a data provider from the outside world on the blockchain.
es: Un oráculo es un proveedor de datos del mundo exterior en la cadena de bloques.

source: Sources of the Outside World
es: Fuentes del Mundo Exterior
