Repository: Decentral-America/docs
Catalog: docs/locales/*/LC_MESSAGES/02_decentralchain.po
Languages: es

source: Account
es: Cuenta

source: DecentralChain uses an account-based model:
es: DecentralChain utiliza un modelo basado en cuentas:

source: Each :ref:`transaction <02_decentralchain/03_transaction:Transaction>` is created on behalf of a certain account.
es: Cada :ref:`transacción <02_decentralchain/03_transaction:Transaction>` se crea en nombre de una determinada cuenta.

source: All the :ref:`tokens <02_decentralchain/02_token(asset):Token (Asset)>` belong to certain accounts.
es: Todos los :ref:`tokens <02_decentralchain/02_token(asset):Token (Asset)>` pertenecen a ciertas cuentas.

source: All the data is associated with accounts. For details, see the :ref:`account data storage <02_decentralchain/01_account:Account Data Storage>` article.
es: Todos los datos están asociados a cuentas. Para obtener más información, consulte el artículo :ref:`almacenamiento de datos de cuenta <02_decentralchain/01_account:Account Data Storage>`.

source: Account Keys
es: Llaves de Cuenta

source: Unlike centralized applications, users do not have usernames and passwords on the blockchain. User identification and validation of their actions are performed using a cryptographically bound key pair:
es: A diferencia de las aplicaciones centralizadas, los usuarios no tienen nombres de usuario ni contraseñas en la cadena de bloques. La identificación del usuario y la validación de sus acciones se realizan mediante un par de claves vinculadas criptográficamente:

source: The private key is used to sign transactions or orders.
es: La clave privada se utiliza para firmar transacciones u órdenes.

source: The public key allows the verification of the digital signature.
es: La clave pública permite la verificación de la firma digital.

source: Each transaction contains the public key of the sender's account. The sender generates a digital signature of the transaction using the account's private key. The signature and the sender's public key are used to verify the authenticity of the transaction's data and to check that the signature of the transaction matches the public key.
es: Cada transacción contiene la clave pública de la cuenta del remitente. El remitente genera una firma digital de la transacción utilizando la clave privada de la cuenta. La firma y la clave pública del remitente se utilizan para verificar la autenticidad de los datos de la transacción y para verificar que la firma de la transacción coincida con la clave pública.

source: DecentralChain uses an asymmetric cryptographic system based on the elliptic curve Curve25519-ED25519 with X25519 keys. The guideline for generating keys and signatures is given in the :ref:`cryptographic practical details <02_decentralchain/09_protocol:Cryptographic Practical Details>` article. The private and public keys are :math:`32` byte arrays. In UIs, the keys are displayed as base58 encoded strings. Base58-encoded keys can be of different lengths, the maximum length is :math:`44` characters.
es: DecentralChain utiliza un sistema criptográfico asimétrico basado en la curva elíptica Curve25519-ED25519 con claves X25519. La guía para generar claves y firmas se proporciona en el artículo :ref:`detalles prácticos criptográficos <02_decentralchain/09_protocol:Cryptographic Practical Details>`. Las claves privadas y públicas son matrices de bytes :math:`32`. En las interfaces de usuario, las claves se muestran como cadenas codificadas en base58. Las claves codificadas en Base58 pueden tener diferentes longitudes, la longitud máxima es :math:`44` caracteres.

source: Example private key in base58:
es: Ejemplo de clave privada en base58:

source: Example public key in base58:
es: Ejemplo de clave pública en base58:

source: Secret (Seed) Phrase
es: Frase Secreta (Semilla)

source: The private key can be generated from some random seed phrase using hashing functions. The public key is obtained from the private key using an elliptic curve multiplication. The account :ref:`address <02_decentralchain/01_account:Address>` is obtained from the public key. All these transformations are unidirectional. The opposite direction is almost impossible in terms of the required computations.
es: La clave privada se puede generar a partir de alguna frase inicial aleatoria utilizando funciones hash. La clave pública se obtiene a partir de la clave privada mediante una multiplicación de curva elíptica. La :ref:`dirreción<02_decentralchain/01_account:Address>` de la cuenta se obtiene de la llave pública. Todas estas transformaciones son unidireccionales. La dirección opuesta es casi imposible en términos de los cálculos requeridos.

source: The secret phrase (a.k.a. seed phrase, backup phrase) can be any combination of symbols, words, or bytes. DecentralChain wallet apps typically use a random set of :math:`15` English words out of :math:`2048` words available. Using such a phrase is secure since the probability of generating two identical seed phrases is :math:`\frac{1}{2048^{15}}`, so brute-force will take millions of years on an average CPU. The point of using a secret phrase (rather than a private key) is to simplify user experience: the secret phrase is much easier to write down or remember.
es: La frase secreta (también conocida como frase semilla, frase de respaldo) puede ser cualquier combinación de símbolos, palabras o bytes. Las aplicaciones de billetera DecentralChain generalmente usan un conjunto aleatorio de :math:`15` palabras en inglés de :math:`2048` palabras disponibles. Usar una frase de este tipo es seguro ya que la probabilidad de generar dos frases semilla idénticas es :math:`\frac{1}{2048^{15}}`, por lo que la fuerza bruta llevará millones de años en una CPU promedio. El objetivo de usar una frase secreta (en lugar de una clave privada) es simplificar la experiencia del usuario: la frase secreta es mucho más fácil de escribir o recordar.

source: Example of a secret phrase:
es: Ejemplo de una frase secreta:

source: Security Information:
es: Informacion de Seguridad:

source: The secret phrase or the private key derived from it provide complete control over the account, including the ability to dispose of funds. Do not give your secret phrase or private key to anyone, and do not publish or send them.
es: La frase secreta o la clave privada derivada de ella brindan un control completo sobre la cuenta, incluida la capacidad de disponer de fondos. No le des tu frase secreta o clave privada a nadie, y no los publiques ni los envíes.

source: The secret phrase cannot be changed: another secret phrase (even one that differs by a single character) will generate a different key pair, and therefore a different account.
es: La frase secreta no se puede cambiar: otra frase secreta (incluso una que difiera en un solo carácter) generará un par de claves diferente y, por lo tanto, una cuenta diferente.

source: If you lose your secret phrase or private key, you will no longer be able to access your account ever again. We strongly encourage you to :ref:`backup of your secret phrase <02_decentralchain/01_account:Backup Seed Phrase>`.
es: Si pierde su frase secreta o clave privada, ya no podrá acceder a su cuenta nunca más. Le recomendamos encarecidamente que :ref:`haga una copia de seguridad de su frase secreta <02_decentralchain/01_account:Backup Seed Phrase>`.

source: If the secret phrase is compromised (you have accidentally sent it to someone or suspect that it was taken by fraudsters), immediately create a new account and transfer all the assets to it.
es: Si la frase secreta está comprometida (se la envió accidentalmente a alguien o sospecha que los estafadores se la llevaron), cree inmediatamente una nueva cuenta y transfiérale todos los activos.

source: For ways to generate account keys, see the :ref:`creating an account <02_decentralchain/01_account:Creating an Account>` article.
es: Para conocer formas de generar claves de cuenta, consulte el artículo :ref:`creación de una cuenta <02_decentralchain/01_account:Creating an Account>`.

source: Creating an Account
es: Crear una Cuenta

source: To create an account means to generate an :ref:`account key pair <02_decentralchain/01_account:Account Keys>` and :ref:`address <02_decentralchain/01_account:Address>` based on a :ref:`secret (seed) phrase <02_decentralchain/01_account:Secret (Seed) Phrase>`.
es: Crear una cuenta significa generar un :ref:`par de llaves de cuenta <02_decentralchain/01_account:Account Keys>` y una :ref:`dirección <02_decentralchain/01_account:Address>` con base en una :ref:`frase secreta (semilla) <02_decentralchain/01_account:Secret (Seed) Phrase>`.

source: You can use `Decentral.Exchange <https://decentral.exchange/>`_ online to create an account.
es: Puede usar `Decentral.Exchange <https://decentral.exchange/>`_ en línea para crear una cuenta.

source: On the main screen click Create Account then in the Create Password box type in the password, type it again in the Confirm Password box, accept the Terms and Conditions as well as the Privacy Policy and click Continue.
es: En la pantalla principal, haga clic en Crear Cuenta, luego en el cuadro Crear Contraseña, escriba la contraseña, escríbala nuevamente en el cuadro Confirmar Contraseña, acepte los Términos y Condiciones, así como la Política de Privacidad y haga clic en Continuar.

source: On the next screen select Create Account and then choose the avatar you like the most for your account and click Continue.
es: En la siguiente pantalla, seleccione Crear Cuenta y luego elija el avatar que más le guste para su cuenta y haga clic en Continuar.

source: After that, select the name you want the account to have on that particular device and click Continue.
es: Después de eso, seleccione el nombre que desea que tenga la cuenta en ese dispositivo en particular y haga clic en Continuar.

source: At this point you will be forwarded to your wallet page. You must do a :ref:`backup of your seed phrase <02_decentralchain/01_account:Backup Seed Phrase>`.
es: En este punto, será redirigido a la página de su billetera. Debe hacer una :ref:`copia de seguridad de su frase semilla <02_decentralchain/01_account:Backup Seed Phrase>`.

source: Backup Seed Phrase
es: Respaldar Frase Semilla

source: Open `Decentral.Exchange <https://decentral.exchange/>`_ main screen and make sure you are logged into your account. Click on the account avatar and navigate to Settings > Security.
es: Abra la pantalla principal `Decentral.Exchange <https://decentral.exchange/>`_ y asegúrese de haber iniciado sesión en su cuenta. Haga clic en el avatar de la cuenta y vaya a Configuración > Seguridad.

source: Click Show in the Backup Phrase box.
es: Haga clic en Mostrar en el cuadro Respaldar Frase Semilla.

source: Write down the phrase and store it in a secure location.
es: Escriba la frase y guárdela en un lugar seguro.

source: Do not store the backup phrase unencrypted on any electronic device. We strongly recommend backing up the seed phrase, since this is the only way to restore access to your account in case of loss or theft of the device.
es: No almacene la frase de respaldo sin cifrar en ningún dispositivo electrónico. Recomendamos encarecidamente hacer una copia de seguridad de la frase semilla, ya que esta es la única forma de restaurar el acceso a su cuenta en caso de pérdida o robo del dispositivo.

source: Log in to Account
es: Ingresar a la Cuenta

source: Open `Decentral.Exchange <https://decentral.exchange/>`_ main screen and click Create Account then in the Create Password box type in the password, type it again in the Confirm Password box, accept the Terms and Conditions as well as the Privacy Policy and click Continue.
es: Abra la pantalla principal `Decentral.Exchange <https://decentral.exchange/>`_ y haga clic en Crear Cuenta, luego en el cuadro Crear Contraseña escriba la contraseña, escríbala nuevamente en el cuadro Confirmar Contraseña, acepte los Términos y Condiciones también como la Política de Privacidad y haga clic en Continuar.

source: On the next screen select Import Accounts, then choose the Seed or Key option.
es: En la siguiente pantalla, seleccione Importar Cuentas, luego elija la opción Semilla o Clave.

source: After that type in the seed you backed up in the past and click Continue, then select the name you want the account to have on that particular device and click Continue.
es: Después de eso, escriba la semilla de la que hizo una copia de seguridad en el pasado y haga clic en Continuar, luego seleccione el nombre que desea que tenga la cuenta en ese dispositivo en particular y haga clic en Continuar.

source: At this point you will be forwarded to your wallet page.
es: En este punto, será redirigido a la página de su billetera.

source: Forgot Password
es: Olvidé mi Contraseña

source: Open `Decentral.Exchange <https://decentral.exchange/>`_ main screen and click Forgot Password then select the Reset All option.
es: Abra la pantalla principal de `Decentral.Exchange <https://decentral.exchange/>`_ y haga clic en Olvidé mi Contraseña y luego seleccione la opción Restablecer todo.

source: On the next screen, in the Create Password box type in the password, type it again in the Confirm Password box, accept the Terms and Conditions as well as the Privacy Policy and click Continue.
es: En la siguiente pantalla, en el cuadro Crear Contraseña, ingrese la contraseña, escríbala nuevamente en el cuadro Confirmar Contraseña, acepte los Términos y Condiciones, así como la Política de Privacidad y haga clic en Continuar.

source: When this is done, select Import Accounts, then choose the Seed or Key option.
es: Cuando termine, seleccione Importar Cuentas, luego elija la opción Semilla o Clave.

source: Address
es: Dirección

source: Address is an :ref:`account <02_decentralchain/01_account:Account>` attribute derived from the :ref:`public key <02_decentralchain/01_account:Account Keys>`. The address also contains the :ref:`chain ID <02_decentralchain/08_mainnet-testnet-stagenet:Chain ID>` that identifies the blockchain network, therefore the address on the Mainnet cannot be used on the Testnet and vice versa.
es: La dirección es un atributo de la :ref:`cuenta <02_decentralchain/01_account:Account>` derivado de la :ref:`llave pública <02_decentralchain/01_account:Account Keys>`. La dirección también contiene el :ref:`ID de la cadena <02_decentralchain/08_mainnet-testnet-stagenet:Chain ID>` que identifica la red blockchain, por lo tanto, la dirección en Mainnet no se puede usar en Testnet y viceversa.

source: The address is a :math:`26` byte array (see the :ref:`address binary format <02_decentralchain/10_binary-format:Address Binary Format>`). In UIs the address is displayed as a base58 encoded string.
es: La dirección es una matriz de :math:`26` bytes (consulte el :ref:`formato binario de dirección <02_decentralchain/10_binary-format:Address Binary Format>`). En las interfaces de usuario, la dirección se muestra como una cadena codificada en base58.

source: Normally, the address starting with 3P refers to the Mainnet, and the address starting with 3M or 3N refers to Testnet or Stagenet.
es: Normalmente, la dirección que comienza con 3P se refiere a Mainnet, y la dirección que comienza con 3M o 3N se refiere a Testnet o Stagenet.

source: The address is used to obtain information about the account:
es: La dirección se utiliza para obtener información sobre la cuenta:

source: :ref:`Token balances <02_decentralchain/01_account:Account Balance>`,
es: :ref:`Saldos de tokens <02_decentralchain/01_account:Account Balance>`,

source: Entries of :ref:`account data storage <02_decentralchain/01_account:Account Data Storage>`,
es: Entradas de :ref:`almacenamiento de datos de cuenta <02_decentralchain/01_account:Account Data Storage>`,

source: :ref:`Aliases <02_decentralchain/01_account:Alias>`,
es: :ref:`Alias <02_decentralchain/01_account:Alias>`,

source: :ref:`Assigned script <02_decentralchain/01_account:dApp and Smart Account>`, etc.
es: :ref:`Script asignado <02_decentralchain/01_account:dApp and Smart Account>`, etc.

source: The address is indicated:
es: Se indica la dirección:

source: In :ref:`transfer <02_decentralchain/03_transaction:Transfer Transaction>`, :ref:`mass transfer <02_decentralchain/03_transaction:Mass Transfer Transaction>` and :ref:`lease transaction <02_decentralchain/03_transaction:Lease Transaction>` to identify a recipient;
es: En transacciones para :ref:`transferencia <02_decentralchain/03_transaction:Transfer Transaction>`, :ref:`transferencia masiva <02_decentralchain/03_transaction:Mass Transfer Transaction>` y :ref:`arrendamiento <02_decentralchain/03_transaction:Lease Transaction>` para identificar un destinatario;

source: In :ref:`invoke script transactions <02_decentralchain/03_transaction:Invoke Script Transaction>` to identify an invoked dApp.
es: En :ref:`transacción para invocar scripts <02_decentralchain/03_transaction:Invoke Script Transaction>` para identificar una dApp invocada.

source: Get Personal Address
es: Obtener Dirección Personal

source: Open `Decentral.Exchange <https://decentral.exchange/>`_ main screen and make sure you are logged into your account. Click on the account avatar and navigate to Address.
es: Abra la pantalla principal `Decentral.Exchange <https://decentral.exchange/>`_ y asegúrese de haber iniciado sesión en su cuenta. Haga clic en el avatar de la cuenta y navegue hasta Dirección.

source: Copy the address and use it, or you can also use the generated QR code.
es: Copie la dirección y úsela, o también puede usar el código QR generado.

source: Alias is a short, easy to remember, name of the :ref:`address <02_decentralchain/01_account:Address>`. The alias is unique on the blockchain. One address can have several aliases. The alias can be used instead of the address:
es: Alias es un nombre corto y fácil de recordar de la :ref:`dirección <02_decentralchain/01_account:Address>`. El alias es único en la cadena de bloques. Una dirección puede tener varios alias. El alias se puede utilizar en lugar de la dirección:

source: In :ref:`transfer <02_decentralchain/03_transaction:Transfer Transaction>`, :ref:`mass transfer <02_decentralchain/03_transaction:Mass Transfer Transaction>` and :ref:`lease transaction <02_decentralchain/03_transaction:Lease Transaction>` to identify a recipient; as well as in :ref:`invoke script transactions <02_decentralchain/03_transaction:Invoke Script Transaction>` to identify an invoked dApp.
es: En transacciones para :ref:`transferencia <02_decentralchain/03_transaction:Transfer Transaction>`, :ref:`transferencia masiva <02_decentralchain/03_transaction:Mass Transfer Transaction>` y :ref:`arrendamiento <02_decentralchain/03_transaction:Lease Transaction>` para identificar un destinatario; así como en :ref:`transacciones para invocar scripts <02_decentralchain/03_transaction:Invoke Script Transaction>` para identificar una dApp invocada.

source: To find an account in `DecentralChain Explorer <https://decentralscan.com/>`_.
es: Para encontrar una cuenta en `DecentralChain Explorer <https://decentralscan.com/>`_.

source: The alias cannot be deleted.
es: El alias no se puede eliminar.

source: Alias Requirements
es: Requisitos de Alias

source: The length of an alias can be from :math:`4` to :math:`30` bytes (:math:`1` character can take up to :math:`4` bytes). The following characters are allowed:
es: La longitud de un alias puede ser de :math:`4` a :math:`30` bytes (el carácter :math:`1` puede ocupar hasta :math:`4` bytes). Se permiten los siguientes caracteres:

source: lowercase Latin letters
es: letras latinas minúsculas

source: numbers
es: números

source: dot
es: punto

source: underscore
es: guión bajo

source: hyphen
es: guión

source: Create Alias
es: Crear Alias

source: You can use `Decentral.Exchange <https://decentral.exchange/>`_ online to create an alias.
es: Puedes usar `Decentral.Exchange <https://decentral.exchange/>`_ en línea para crear un alias.

source: Make sure you are logged into your account. On the main screen click on the account avatar and navigate to Aliases.
es: Asegúrate de haber iniciado sesión en tu cuenta. En la pantalla principal, haga clic en el avatar de la cuenta y navegue hasta Alias.

source: On the next screen select Create New and then type in the name of the alias and click Create New again to complete the process.
es: En la siguiente pantalla, seleccione Crear Nuevo y luego escriba el nombre del alias y haga clic en Crear Nuevo otra vez para completar el proceso.

source: View Aliases
es: Ver Alias

source: The list of account aliases, as well as other blockchain data, is public and can be read by anyone. For example, you can see aliases in `DecentralChain Explorer <https://decentralscan.com/>`_. To do this, find an account by its :ref:`address <02_decentralchain/01_account:Address>` and switch to the Aliases tab.
es: La lista de alias de cuenta, así como otros datos de la cadena de bloques, es pública y cualquiera puede leerla. Por ejemplo, puede ver los alias en `DecentralChain Explorer <https://decentralscan.com/>`_. Para hacer esto, busque una cuenta por su :ref:`dirección <02_decentralchain/01_account:Address>` y cambie a la pestaña Alias.

source: Using :ref:`Node REST API <documentation:placeholder>`, you can obtain a list of aliases by address using the GET/alias/by-address/{address} method and an address by alias using the GET /alias/by-alias/{alias} method.
es: Usando :ref:`Node REST API <documentation:placeholder>`, puedes obtener una lista de alias por dirección usando el método GET/alias/by-address/{address} y una dirección por alias usando el método GET /alias/by-alias/{alias}.

source: Binary Format
es: Formato Binario

source: See the :ref:`alias binary format <02_decentralchain/10_binary-format:Alias Binary Format>` article.
es: Consulte el artículo :ref:`formato binario de dirección <02_decentralchain/10_binary-format:Alias Binary Format>`.

source: Account Balance
es: Saldo de Cuenta

source: Account balance is the amount of a :ref:`token (asset) <02_decentralchain/02_token(asset):Token (Asset)>` that belongs to the :ref:`account <02_decentralchain/01_account:Account>`.
es: Account balance is the amount of a :ref:`token (asset) <02_decentralchain/02_token(asset):Token (Asset)>` that belongs to the :ref:`cuenta <02_decentralchain/01_account:Account>`.

source: One account can store different tokens in different amounts. For example, an account can have :math:`50` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` and USD-N at the same time. The amount of the Y token on the account is called the account balance in Y token. If there is no Y token on the account, it is said that the account balance in Y token is equal to zero.
es: Una cuenta puede almacenar diferentes tokens en diferentes cantidades. Por ejemplo, una cuenta puede tener :math:`50` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` y USD-N al mismo tiempo. La cantidad del token Y en la cuenta se denomina saldo de la cuenta en el token Y. Si no hay un token Y en la cuenta, se dice que el saldo de la cuenta en el token Y es igual a cero.

source: Account Balance in DecentralCoin
es: Saldo de Cuenta en DecentralCoin

source: There are four types of balances in DecentralChain:
es: Hay cuatro tipos de saldos en DecentralChain:

source: available
es: disponible

source: effective
es: efectivo

source: generating
es: generador
