Repository: Decentral-America/docs
Catalog: docs/locales/*/LC_MESSAGES/02_decentralchain.po
Languages: es

source: Transaction fee is a fee that an :ref:`account <02_decentralchain/01_account:Account>` owner pays to send a :ref:`transaction <02_decentralchain/03_transaction:Transaction>`. A transaction sender can specify any amount of fee but not less than the minimum amount. The larger the fee is, the quicker the transaction will be added to the new :ref:`block <02_decentralchain/04_block:Block>`. For :ref:`invoke script transactions <02_decentralchain/03_transaction:Invoke Script Transaction>` and :ref:`transfer transaction <02_decentralchain/03_transaction:Transfer Transaction>`, a sender can specify a transaction fee nominated in a sponsored asset instead of :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`, see the section :ref:`fee in sponsored asset <02_decentralchain/03_transaction:Fee in Sponsored Asset>` below.
es: La tarifa de transacción es una tarifa que el propietario de una :ref:`cuenta <02_decentralchain/01_account:Account>` paga para enviar una :ref:`transacción <02_decentralchain/03_transaction:Transaction>`. El remitente de una transacción puede especificar cualquier cantidad de tarifa, pero no menos de la cantidad mínima. Cuanto mayor sea la tarifa, más rápido se agregará la transacción al nuevo :ref:`blocque <02_decentralchain/04_block:Block>`. Para las transacciones para :ref:`invocar scripts <02_decentralchain/03_transaction:Invoke Script Transaction>` y :ref:`transferencia masiva <02_decentralchain/03_transaction:Mass Transfer Transaction>`, un remitente puede especificar una tarifa de transacción nominada en un activo patrocinado en lugar de :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`, consulte la sección :ref:`tarifa en activo patrocinado <02_decentralchain/03_transaction:Fee in Sponsored Asset>` a continuación.

source: Regular Fees
es: Tarifas Regulares

source: Minimum Fee
es: Tarifa Mínima

source: The minimum fees in DecentralCoins for each type of transaction are listed below.
es: Las tarifas mínimas en DecentralCoins para cada tipo de transacción se enumeran a continuación.

source: If the transaction sender is a :ref:`dApp or smart account <02_decentralchain/01_account:dApp and Smart Account>`, and the complexity of the account script or dApp script verifier function exceeds the :ref:`sender complexity threshold <03_ride-language/07_dapp-to-app-invocation:Limitations>`, the minimum fee is increased by :math:`0.004` DecentralCoins. If the order sender in :ref:`exchange transaction <02_decentralchain/03_transaction:Exchange Transaction>` is a dApp or smart account, this does nor affect the minimum fee.
es: Si el remitente de la transacción es una :ref:`dApp o una cuenta inteligente <02_decentralchain/01_account:dApp and Smart Account>`, y la complejidad de la secuencia de comandos de la cuenta o la función del verificador de la secuencia de comandos de la dApp supera el :ref:`umbral de complejidad del remitente <03_ride-language/07_dapp-to-app-invocation:Limitations>`, la tarifa mínima se incrementa en :math:`0.004` DecentralCoins. Si el remitente del pedido en una :ref:`transacción para intercambio <02_decentralchain/03_transaction:Exchange Transaction>` es una dApp o cuenta inteligente, esto no afecta la tarifa mínima.

source: The minimum fee is increased by :math:`0.004` DecentralCoins for each smart asset involved, except for:
es: La tarifa mínima se incrementa en :math:`0.004` DecentralCoins por cada activo inteligente involucrado, excepto por:

source: :ref:`Smart assets <02_decentralchain/02_token(asset):Smart Asset>` used as matcher fees in exchange transactions.
es: :ref:`Activos inteligentes <02_decentralchain/02_token(asset):Smart Asset>` utilizados como tarifa del emparejador en transacciones para intercambio.

source: :strong:`Example 1`
es: :stong:`Ejemplo 1`

source: The minimum fee for a transfer transaction:
es: La tarifa mínima de una transacción para transferencia:

source: No smart account or smart assets: :math:`0.001` DecentralCoins.
es: Sin cuenta inteligente ni activos inteligentes: :math:`0.001` DecentralCoins.

source: Transfer from smart account*: :math:`0.001 + 0.004 = 0.005` DecentralCoins.
es: Transferencia desde cuenta inteligente*: :math:`0.001 + 0.004 = 0.005` DecentralCoins.

source: Transfer of smart asset: :math:`0.001 + 0.004 = 0.005` DecentralCoins.
es: Transferencia de activo inteligente: :math:`0.001 + 0.004 = 0.005` DecentralCoins.

source: Transfer of smart asset sent from smart account*: :math:`0.001 + 0.004 + 0.004 = 0.009` DecentralCoins.
es: Transferencia de activo inteligente enviado desde cuenta inteligente*: :math:`0.001 + 0.004 + 0.004 = 0.009` DecentralCoins.

source: If the account script complexity is higher than the :ref:`sender complexity threshold <03_ride-language/07_dapp-to-app-invocation:Limitations>`.
es: Si la complejidad del script de la cuenta es superior al :ref:`umbral de complejidad del remitente <03_ride-language/07_dapp-to-app-invocation:Limitations>`.

source: :strong:`Example 2`
es: :strong:`Ejemplo 2`

source: The minimum fee for an Invoke Script transaction:
es: La tarifa mínima de una Transacción para Invocar Scripts:

source: No smart account, no assets issued: :math:`0.005` DecentralCoins.
es: Sin cuenta inteligente, sin activos emitidos: :math:`0.005` DecentralCoins.

source: dApp script invocation is sent from a smart account*: :math:`0.005 + 0.004 = 0.009` DecentralCoins.
es: La invocación del script de una dApp se envía desde una cuenta inteligente*: :math:`0.005 + 0.004 = 0.009` DecentralCoins.

source: dApp script invocation issues an asset that is not :ref:`non-fungible tokens <02_decentralchain/02_token(asset):Non-Fungible Token>`: :math:`0.005 + 1 = 1.005` DecentralCoins.
es: La invocación del script de una dApp emite un activo que no es :ref:`tokens no fungibles <02_decentralchain/02_token(asset):Token no fungible>`: :math:`0.005 + 1 = 1.005` DecentralCoins.

source: dApp script invocation is sent from smart account*, and :math:`10` assets that are not non-fungible tokens are issued: :math:`0.005 + 0.004 + 10 × 1 = 10.009` DecentralCoins.
es: La invocación del script dApp se envía desde la cuenta inteligente* y se emiten :math:`10` activos que no son tokens no fungibles: :math:`0.005 + 0.004 + 10 × 1 = 10.009` DecentralCoins.

source: Minimum Fees
es: Tarifas Mínimas

source: Transaction type
es: Tipo de transacción

source: Transaction type ID
es: ID del tipo de transacción

source: Minimum transaction fee in :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`
es: Tarifa mínima de transacción en :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`

source: :ref:`Burn transaction <02_decentralchain/03_transaction:Burn Transaction>`
es: :ref:`Transacción para quemado <02_decentralchain/03_transaction:Burn Transaction>`

source: :ref:`Create alias transaction <02_decentralchain/03_transaction:Create Alias Transaction>`
es: :ref:`Transacción para crear alias <02_decentralchain/03_transaction:Create Alias Transaction>`

source: :ref:`data transaction <02_decentralchain/03_transaction:Data Transaction>`
es: :ref:`Transacción para Datos <02_decentralchain/03_transaction:Data Transaction>`

source: :math:`0.001` per kilobyte. The size is rounded up to an integer number of kilobytes.
es: :math:`0.001` por kilobyte. El tamaño se redondea a un número entero de kilobytes.

source: :ref:`Exchange transaction <02_decentralchain/03_transaction:Exchange Transaction>`
es: :ref:`Transacción para intercambio <02_decentralchain/03_transaction:Exchange Transaction>`

source: :ref:`invoke script transaction <02_decentralchain/03_transaction:Invoke Script Transaction>`
es: :ref:`Transacción para invocar scripts <02_decentralchain/03_transaction:Invoke Script Transaction>`

source: :math:`0.005 + K`. :math:`K` is the number of assets issued as a result of dApp script invocation that are not non-fungible tokens.
es: :math:`0.005 + K`. :math:`K` es la cantidad de activos emitidos como resultado de la invocación del script de la dApp que no son tokens no fungibles.

source: :ref:`Issue transaction <02_decentralchain/03_transaction:Issue Transaction>`
es: :ref:`Transacción para emisión <02_decentralchain/03_transaction:Issue Transaction>`

source: :math:`1` for reqular token. :math:`0.001` for :ref:`non-fungible token <02_decentralchain/02_token(asset):Non-Fungible Token>`.
es: :math:`1` para token regular. :math:`0.001` para :ref:`token no fungible <02_decentralchain/02_token(asset):Non-Fungible Token>`.

source: :ref:`Lease cancel transaction <02_decentralchain/03_transaction:Lease Cancel Transaction>`
es: :ref:`Transacción para cancelar arrendamiento <02_decentralchain/03_transaction:Lease Cancel Transaction>`

source: :ref:`Lease transaction <02_decentralchain/03_transaction:Lease Transaction>`
es: :ref:`Transacción para arrendamiento <02_decentralchain/03_transaction:Lease Transaction>`

source: :ref:`Mass transfer transaction <02_decentralchain/03_transaction:Mass Transfer Transaction>`
es: :ref:`Transacción para transferencia masiva <02_decentralchain/03_transaction:Mass Transfer Transaction>`

source: :math:`0.001 + 0.0005 × N`. :math:`N` is the number of transfers inside of the transaction. The value is rounded up to the three decimals.
es: :math:`0.001 + 0.0005 × N`. :math:`N` es el número de transferencias dentro de la transacción. El valor se redondea a los tres decimales.

source: :ref:`Reissue transaction <02_decentralchain/03_transaction:Reissue Transaction>`
es: :ref:`Transacción para reemisión <02_decentralchain/03_transaction:Reissue Transaction>`

source: :ref:`Set asset script transaction <02_decentralchain/03_transaction:Set Asset Script Transaction>`
es: :ref:`Transacción para asignar scripts de activos <02_decentralchain/03_transaction:Set Asset Script Transaction>`

source: :ref:`set script transaction <02_decentralchain/03_transaction:Set Script Transaction>`
es: :ref:`Transacción para Asignar Scripts <02_decentralchain/03_transaction:Set Script Transaction>`

source: :ref:`Sponsor fee transaction <02_decentralchain/03_transaction:Sponsor Fee Transaction>`
es: :ref:`Transacción para patrocinar tarifas <02_decentralchain/03_transaction:Sponsor Fee Transaction>`

source: :ref:`Transfer transaction <02_decentralchain/03_transaction:Transfer Transaction>`
es: :ref:`Transacción para transferencia <02_decentralchain/03_transaction:Transfer Transaction>`

source: :ref:`Update asset info transaction <02_decentralchain/03_transaction:Update Asset Info Transaction>`
es: :ref:`Transacción para actualizar información de activos <02_decentralchain/03_transaction:Update Asset Info Transaction>`

source: Fee for Failed Transactions
es: Tarifa por Transacciones Fallidas

source: :ref:`Invoke script transactions <02_decentralchain/03_transaction:Invoke Script Transaction>` and :ref:`exchange transactions <02_decentralchain/03_transaction:Exchange Transaction>` can be saved on the blockchain even if the result of a dApp script or asset script execution failed. In this case, the sender is charged a fee. For an exchange transaction, the matcher is charged the transaction fee but the order senders are not charged the matcher fee. :ref:`More about transaction validation<02_decentralchain/03_transaction:Transaction Validation>`.
es: :ref:`Transacciones para invocar scripts <02_decentralchain/03_transaction:Invoke Script Transaction>` y :ref:`transacciones para intercambio <02_decentralchain/03_transaction:Exchange Transaction>` se pueden guardar en la cadena de bloques incluso si el resultado de un script de dApp o un script de activos la ejecución falló. En este caso, al remitente se le cobra una tarifa. Para una transacción de intercambio, al emparejador se le cobra la tarifa por transacción, pero a los remitentes de pedidos no se les cobra la tarifa del emparejador. :ref:`Más sobre la validación de transacciones<02_decentralchain/03_transaction:Transaction Validation>`.

source: Fee in Sponsored Asset
es: Tarifa en Activo Patrocinado

source: An issuer of an asset can set up sponsorship — so that any user can specify a transaction fee in this asset for :ref:`invoke script transactions <02_decentralchain/03_transaction:Invoke Script Transaction>` and :ref:`transfer transactions <02_decentralchain/03_transaction:Transfer Transaction>`. To activate sponsorship, the issuer puts a :ref:`sponsor fee transaction<02_decentralchain/03_transaction:Sponsor Fee Transaction>` that specifies an amount of asset that is equivalent to the minimum fee of :math:`0.001` DecentralCoins. For example, if minSponsoredAssetFee: :math:`5`, then the fee in this asset for an invoke script transaction equals :math:`5 * \frac{0.005}{0.001} = 25`.
es: Un emisor de un activo puede configurar el patrocinio, de modo que cualquier usuario pueda especificar una tarifa de transacción en este activo para :ref:`transacciones para invocar scripts <02_decentralchain/03_transaction:Invoke Script Transaction>` y :ref:`transacciones para transferencia <02_decentralchain/ 03_transaction:Exchange Transaction>`. Para activar el patrocinio, el emisor coloca una :ref:`transacción para patrocinar tarifas <02_decentralchain/03_transaction:Sponsor Fee Transaction>` que especifica una cantidad de activo que es equivalente a la tarifa mínima de :math:`0.001` DecentralCoins. Por ejemplo, si minSponsoredAssetFee: :math:`5`, entonces la tarifa en este activo para una transacción de script de invocación es igual a :math:`5 * \frac{0.005}{0.001} = 25`.

source: Sponsored Fees
es: Tarifas Patrocinadas

source: Users of DecentralChain-based apps should pay a fee for each transaction. This is the entry threshold for new users. Sometimes users don't know anything about :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` or don't understand how to get DecentralCoins or don't want to spend money. Sponsorship enables launching apps that do not require DecentralCoins from users.
es: Los usuarios de aplicaciones basadas en DecentralChain deben pagar una tarifa por cada transacción. Este es el umbral de entrada para nuevos usuarios. A veces, los usuarios no saben nada sobre :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` o no entienden cómo obtener DecentralCoins o no quieren gastar dinero. El patrocinio permite lanzar aplicaciones que no requieren DecentralCoins de los usuarios.

source: Sponsored Asset
es: Activo Patrocinado

source: An account that issued an asset can enable sponsorship, that is, allow all users to pay a fee in this asset for :ref:`invoke script transactions <02_decentralchain/03_transaction:Invoke Script Transaction>` and :ref:`transfer transactions <02_decentralchain/03_transaction:Transfer Transaction>`. The sponsor can distribute the sponsored asset among app users.
es: Una cuenta que emitió un activo puede habilitar el patrocinio, es decir, permitir que todos los usuarios paguen una tarifa en este activo por :ref:`transacción para invocar scripts <02_decentralchain/03_transaction:Invoke Script Transaction>` y :ref:`transacciones para transferencia <02_decentralchain/03_transaction:Transfer Transaction>`. El patrocinador puede distribuir el activo patrocinado entre los usuarios de la aplicación.

source: How to Enable Sponsorship
es: Cómo Habilitar el Patrocinio

source: You can use `Decentral.Exchange <https://decentral.exchange/>`_ online to enable sponsorship.
es: Puedes usar `Decentral.Exchange <https://decentral.exchange/>`_ en línea para habilitar el patrocinio.

source: Make sure you are logged into your account. Find the desired asset in the list, hover cursor over it and in its menu (⋮) click Enable Sponsorship.
es: Asegúrate de haber iniciado sesión en tu cuenta. Encuentre el activo deseado en la lista, coloque el cursor sobre él y en su menú (⋮) haga clic en Habilitar Patrocinio.

source: Carefully read the Terms and Conditions before proceeding and then in the Amount per transaction box specify the required amount of sponsored asset to be charged to users. Then click Continue.
es: Lea atentamente los Términos y Condiciones antes de continuar y luego, en el cuadro Monto por transacción, especifique el monto requerido de activo patrocinado que se cobrará a los usuarios. Luego haga clic en Continuar.

source: In the following window double-check the entered data and if everything is correct click Send or click Go Back to make corrections. Activation will be processed with the next block.
es: En la siguiente ventana, vuelva a verificar los datos ingresados y, si todo es correcto, haga clic en Enviar o haga clic en Volver para hacer las correcciones. La activación se procesará con el siguiente bloque.

source: After activation you'll be able to change the specified amount without deactivation. To do so, find your asset in the list, hover cursor over it and in its menu (⋮) click Change Sponsorship.
es: Después de la activación, podrá cambiar la cantidad especificada sin la desactivación. Para hacerlo, busque su activo en la lista, pase el cursor sobre él y en su menú (⋮) haga clic en Cambiar Patrocinio.

source: How to Disable Sponsorship
es: Cómo Desactivar el Patrocinio

source: You can use `Decentral.Exchange <https://decentral.exchange/>`_ online to disable sponsorship.
es: Puedes usar `Decentral.Exchange <https://decentral.exchange/>`_ en línea para deshabilitar el patrocinio.

source: Make sure you are logged into your account. Find the desired asset in the list, hover cursor over it and in its menu (⋮) click Disable Sponsorship.
es: Asegúrate de haber iniciado sesión en tu cuenta. Encuentre el activo deseado en la lista, coloque el cursor sobre él y en su menú (⋮) haga clic en Desactivar Patrocinio.

source: In the following window click Sign to deactivate the sponsorship. Deactivation will be processed with the next block.
es: En la siguiente ventana haz clic en Firmar para desactivar el patrocinio. La desactivación se procesará con el siguiente bloque.

source: Restrictions
es: Restricciones

source: Only the issuer of the asset can be a sponsor.
es: Solo el emisor del activo puede ser patrocinador.

source: Smart assets cannot be sponsored assets.
es: Los activos inteligentes no pueden ser activos patrocinados.

source: Sponsorship only works if the sponsor's account balance is greater than :math:`1.005` DecentralCoins. If the account balance becomes less than :math:`1.005` DecentralCoins, the sponsorship is suspended, and if the balance becomes more than :math:`1.005` DecentralCoins the sponsorship is resumed.
es: El patrocinio solo funciona si el saldo de la cuenta del patrocinador es superior a :math:`1.005` DecentralCoins. Si el saldo de la cuenta es inferior a :math:`1.005` DecentralCoins, se suspende el patrocinio, y si el saldo es superior a :math:`1.005` DecentralCoins, se reanuda el patrocinio.

source: The fee in the sponsored asset can only be specified for :ref:`invoke script transactions <02_decentralchain/03_transaction:Invoke Script Transaction>` and :ref:`transfer transactions <02_decentralchain/03_transaction:Transfer Transaction>`.
es: La tarifa en el activo patrocinado solo se puede especificar en :ref:`transacciones para invocar scripts <02_decentralchain/03_transaction:Invoke Script Transaction>` y :ref:`transacciones para transferencia <02_decentralchain/03_transaction:Transfer Transaction>`.

source: How It Works
es: Cómo Funciona

source: After :ref:`enabling sponsorship <02_decentralchain/03_transaction:How to Enable Sponsorship>`, if the requirements described in the :ref:`restrictions <02_decentralchain/03_transaction:Restrictions>` section are met, the sponsorship works as follows:
es: Después de :ref:`habilitar el patrocinio <02_decentralchain/03_transaction:How to Enable Sponsorship>`, si se cumplen los requisitos descritos en la sección :ref:`restricciones <02_decentralchain/03_transaction:Restrictions>`, el patrocinio funciona de la siguiente manera:

source: A user broadcasts a transaction and specifies a fee in the sponsored asset.
es: Un usuario transmite una transacción y especifica una tarifa en el activo patrocinado.

source: The sponsor receives the fee in the sponsored asset from the user's account.
es: El patrocinador recibe la tarifa en el activo patrocinado de la cuenta del usuario.

source: Block generators receive the fee in DecentralCoins from the sponsor's account (in accordance with the :ref:`DecentralChain-M5 protocol <02_decentralchain/09_protocol:DecentralChain-M5 Protocol>`, the fee is distributed between the current block generator and the next block generator in a ratio of :math:`\frac{40}{60}`.
es: Los generadores de bloques reciben la tarifa en DecentralCoins de la cuenta del patrocinador (de acuerdo con el :ref:`protocolo DecentralChain-M5 <02_decentralchain/09_protocol:DecentralChain-M5 Protocol>`, la tarifa se distribuye entre el generador de bloques actual y el siguiente generador de bloques en una proporción de :math:`\frac{40}{60}`.

source: The script on the sponsor's account is not executed and does not affect the sponsorship because the transaction is sent from the user's account.
es: El script en la cuenta del patrocinador no se ejecuta y no afecta el patrocinio porque la transacción se envía desde la cuenta del usuario.

source: The fee in :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` charged to the sponsor is proportional to the fee specified by the transaction sender:
es: La tarifa en :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` cobrada al patrocinador es proporcional a la tarifa especificada por el remitente de la transacción:

source: minSponsoredAssetFee is the amount of sponsored asset equivalent to :math:`0.001` DecentralCoins. The sponsor sets this value when enabling sponsorship. For example, if the sponsor sets :math:`3` tokens = :math:`0.001` DecentralCoins, then the minimum fee for :ref:`invoke script transactions <02_decentralchain/03_transaction:Invoke Script Transaction>` is :math:`15` tokens, which corresponds to :math:`0.005` DecentralCoins. Please note:
es: minSponsoredAssetFee es la cantidad de activo patrocinado equivalente a :math:`0.001` DecentralCoins. El patrocinador establece este valor al habilitar el patrocinio. Por ejemplo, si el patrocinador establece :math:`3` tokens = :math:`0.001` DecentralCoins, entonces la tarifa mínima en una :ref:`transacción para invocar scripts <02_decentralchain/03_transaction:Invoke Script Transaction>` es :math:` 15` tokens, que corresponde a :math:`0.005` DecentralCoins. Tenga en cuenta:

source: The user can use the sponsored asset to pay for transactions that are not related to a certain app.
es: El usuario puede usar el activo patrocinado para pagar transacciones que no están relacionadas con una determinada aplicación.

source: The user can specify any amount of fee, such as the one significantly exceeding the minimum.
es: El usuario puede especificar cualquier cantidad de tarifa, como la que exceda significativamente el mínimo.

source: Transaction Representations
es: Representaciones de Transacciones

source: JSON Representation
es: Representación JSON

source: The :ref:`Node REST API <documentation:placeholder>` of DecentralChain nodes uses the JSON representation of transactions. You can send transactions to a node and read transactions stored on the blockchain via REST API in JSON. Here is an example of JSON representation:
es: La :ref:`Node REST API <documentation:placeholder>` de los nodos DecentralChain usa la representación JSON de transacciones. Puede enviar transacciones a un nodo y leer transacciones almacenadas en la cadena de bloques a través de la API REST en JSON. Aquí hay un ejemplo de representación JSON:
