Repository: Decentral-America/docs
Catalog: docs/locales/*/LC_MESSAGES/02_decentralchain.po
Languages: es

source: Software oracles handle data accessible on the web. For example, the temperature, costs of products and merchandise, flight or train delays, etc. The information originates from online sources, e.g. API. The product prophet extricates the required data and pushes it into the blockchain.
es: Los oráculos de software manejan datos accesibles en la web. Por ejemplo, la temperatura, costos de productos y mercancías, retrasos en vuelos o trenes, etc. La información proviene de fuentes en línea, p. API. El profeta del producto extrae los datos necesarios y los inserta en la cadena de bloques.

source: Hardware oracles track real-world objects with devices and sensors. For example, a video camera with an analytics function virtual line crossing tracks vehicles entering a specific zone. If an event is detected, the oracle writes about it on the blockchain. Based on the data of such oracle, some script of decentralized application on the blockchain may be triggered. In this case, for example, a fine and the write-off of tokens from the account of the vehicle owner. But it is not in oracle scope, it is in the scope of the script that is based on the data of such an oracle.
es: Los oráculos de hardware rastrean objetos del mundo real con dispositivos y sensores. Por ejemplo, una cámara de video con una función de análisis de cruce de línea virtual rastrea los vehículos que ingresan a una zona específica. Si se detecta un evento, el oráculo escribe sobre él en la cadena de bloques. Según los datos de dicho oráculo, se puede activar algún script de aplicación descentralizada en la cadena de bloques. En este caso, por ejemplo, una multa y la cancelación de tokens de la cuenta del propietario del vehículo. Pero no está en el ámbito del oráculo, está en el ámbito del script que se basa en los datos de dicho oráculo.

source: Human oracles imply that the data is entered by a human being.
es: Los oráculos humanos implican que los datos son ingresados por un ser humano.

source: Oracles Issue
es: Problema de los Oráculos

source: The oracle is a way of connecting the blockchain with the outside world. The major problem that is solved by the usage of oracles is the very point that blockchains can only access data that is stored on the blockchain. Here, in blockchain, the point is that it is important that decentralized applications can only access data that is stored on the blockchain so that every execution of the script leads to the same result at a given point in time. Therefore, decentralized applications are not able to access data from outside the blockchain, e.g., provided by web services or other external sources of data. Nevertheless, many interesting applications need access to the outside world, e.g., decentralized applications for insurances, decentralized betting systems, financial services and so forth.
es: El oráculo es una forma de conectar la cadena de bloques con el mundo exterior. El principal problema que se resuelve mediante el uso de oráculos es el hecho de que las cadenas de bloques solo pueden acceder a los datos que están almacenados en la cadena de bloques. Aquí, en blockchain, el punto es que es importante que las aplicaciones descentralizadas solo puedan acceder a los datos almacenados en blockchain para que cada ejecución del script conduzca al mismo resultado en un momento dado. Por lo tanto, las aplicaciones descentralizadas no pueden acceder a datos desde fuera de la cadena de bloques, por ejemplo, proporcionados por servicios web u otras fuentes externas de datos. Sin embargo, muchas aplicaciones interesantes necesitan acceso al mundo exterior, por ejemplo, aplicaciones descentralizadas para seguros, sistemas de apuestas descentralizados, servicios financieros, etc.

source: Here, the solution is quite straightforward: if external data is necessary for the execution of a decentralized application, this data needs to be stored on the blockchain. To achieve this, there are usually small programs implemented that access the necessary data and write it to the blockchain. Those little programs are called oracles.
es: Aquí, la solución es bastante sencilla: si se necesitan datos externos para la ejecución de una aplicación descentralizada, estos datos deben almacenarse en la cadena de bloques. Para lograr esto, generalmente se implementan pequeños programas que acceden a los datos necesarios y los escriben en la cadena de bloques. Esos pequeños programas se llaman oráculos.

source: Consensus of Oracles
es: Consenso de Oráculos

source: One source may be unsafe if it does not have the authority or high rating. However, several oracles can be used to stay away from the monopoly and be safer. For example, get information from ten oracles and only if the data of :math:`6` out of :math:`10` oracles coincide, to accept them. This is the consensus of the oracles.
es: Una fuente puede ser insegura si no tiene la autoridad o una calificación alta. Sin embargo, se pueden usar varios oráculos para mantenerse alejado del monopolio y estar más seguro. Por ejemplo, obtener información de diez oráculos y solo si los datos de :math:`6` de :math:`10` oráculos coinciden, para aceptarlos. Este es el consenso de los oráculos.

source: Mainnet, Testnet, Stagenet
es: Redes Principal, Prueba, Escenario

source: Connecting Node to Blockchain Network
es: Conexión del Nodo al Blockchain

source: You can launch your node in any blockchain network. Select the network in the node configuration file.
es: Puedes lanzar tu nodo en cualquier red blockchain. Selecciona la red en el archivo de configuración del nodo.

source: For more information about the configuration file, see the :ref:`node configuration <documentation:placeholder>` article.
es: Para obtener más información sobre el archivo de configuración, consulte el artículo sobre la :ref:`configuración de nodo <documentation:placeholder>`.

source: For installing a node, see the :ref:`install DecentralChain node <documentation:placeholder>` article.
es: Para instalar un nodo, consulte el artículo :ref:`instalar nodo DecentralChain<documentation:placeholder>`.

source: For starting your own blockchain network, see the :ref:`custom blockchain <documentation:placeholder>` article.
es: Para iniciar su propia red blockchain, consulte el artículo :ref:`blockchain personalizado <documentation:placeholder>`.

source: Chain ID
es: Identificador de la Cadena

source: Chain ID is a symbol that is passed over a network during a handshake and allows nodes not to connect to the nodes of other networks. The chain ID is used while building account addresses, therefore, an address on one blockchain network cannot be used on another network. The chain ID is also indicated in transactions so it is impossible to move transactions between different blockchain networks.
es: El identificador de la cadena es un símbolo que se pasa a través de una red durante un enlace y permite que los nodos no se conecten a los nodos de otras redes. El ID de la cadena se usa al crear direcciones de cuenta, por lo tanto, una dirección en una red de cadena de bloques no se puede usar en otra red. El ID de la cadena también se indica en las transacciones, por lo que es imposible mover transacciones entre diferentes redes de blockchain.

source: Blockchain Network
es: Red de Cadena de Bloques

source: Mainnet
es: Red Principal

source: W or :math:`87` (ASCII code of W).
es: W o :math:`87` (código ASCII de W).

source: Testnet
es: Red de Prueba

source: T or :math:`84` (ASCII code of T).
es: T o :math:`84` (código ASCII de T).

source: Stagenet
es: Red de Escenario

source: S or :math:`83` (ASCII code of s).
es: S o :math:`83` (código ASCII de s).

source: API of Pool of Public Nodes
es: API de Grupo de Nodos Públicos

source: Data Service API
es: API de Servicio de Datos

source: `Decentral.Exchange <https://decentral.exchange/>`_ is a decentralized exchange.
es: `Decentral.Exchange <https://decentral.exchange/>`_ es un intercambio descentralizado.

source: API of Decentral.Exchange Matcher
es: API del Emparejador Decentral.Exchange

source: The addresses for order sending and market data obtaining are as follows:
es: Las direcciones para el envío de órdenes y obtención de datos de mercado son las siguientes:

source: DecentralChain Explorer
es: Explorador de DecentralChain

source: `DecentralChain Explorer <https://decentralscan.com/>`_ is a service for browsing blockchain data.
es: `DecentralChain Explorer <https://decentralscan.com/>`_ es un servicio para explorar datos de blockchain.

source: Go to http://decentralscan.com/ and click the three lines, then switch to Mainnet.
es: Vaya a http://decentralscan.com/ y haga clic en las tres líneas, luego cambie a Mainnet.

source: Go to http://decentralscan.com/ and click the three lines, then switch to Testnet.
es: Vaya a http://decentralscan.com/ y haga clic en las tres líneas, luego cambie a Testnet.

source: Go to http://decentralscan.com/ and click the three lines, then switch to Stagenet.
es: Vaya a http://decentralscan.com/ y haga clic en las tres líneas, luego cambie a Stagenet.

source: Faucet: Obtaining Tokens
es: Grifo: Obtención de Activos

source: Protocol
es: Protocolo

source: Cryptographic Practical Details
es: Detalles Prácticos Criptográficos

source: This section describes all the details of cryptographic algorithms which are used to:
es: Esta sección describe todos los detalles de los algoritmos criptográficos que se utilizan para:

source: Create private and public keys from seed.
es: Cree claves públicas y privadas a partir de semillas.

source: Create addresses from public keys.
es: Crear direcciones a partir de claves públicas.

source: Create blocks and transactions signing.
es: Creación de bloques y firma de transacciones.

source: We use Blake2b256 and Keccak256 algorithms (in the form of hash chain) to create cryptographic hashes. And Curve25519 (ED25519 with X25519 keys) to create and verify signatures. Base58 to create the string form of bytes.
es: Usamos los algoritmos Blake2b256 y Keccak256 (en forma de cadena hash) para crear hashes criptográficos. Y Curve25519 (ED25519 con claves X25519) para crear y verificar firmas. Base58 para crear la forma de cadena de bytes.

source: Bytes Encoding Base58
es: Codificación de Bytes Base58

source: All arrays of bytes in the project are encoded by Base58 algorithm with Bitcoin alphabet to make it ease human readable (text readability).
es: Todas las matrices de bytes en el proyecto están codificadas por el algoritmo Base58 con el alfabeto de Bitcoin para que sea más fácil de leer para los humanos (legibilidad del texto).

source: The string teststring is coded into the bytes :math:`[5, 83, 9, -20, 82, -65, 120, -11]`. The bytes :math:`[1, 2, 3, 4, 5]` are coded into the string 7bWpTW.
es: La cadena teststring está codificada en los bytes :math:`[5, 83, 9, -20, 82, -65, 120, -11]`. Los bytes :math:`[1, 2, 3, 4, 5]` están codificados en la cadena 7bWpTW.

source: Creating a Private Key From a Seed
es: Creación de una Clave Privada desde una Semilla

source: A seed string is a representation of entropy, from which you can re-create deterministically all the private keys for one wallet. It should be long enough so that the probability of selection is an unrealistic negligible. In fact, seed should be an array of bytes but for ease of memorization lite wallet uses Brainwallet, to ensure that the seed is made up of words and easy to write down or remember. The application takes the UTF-8 bytes of the string and uses them to create keys and addresses. For example,
es: Una cadena semilla es una representación de la entropía, a partir de la cual puede volver a crear de manera determinista todas las claves privadas para una billetera. Debe ser lo suficientemente largo para que la probabilidad de selección sea despreciable y poco realista. De hecho, la semilla debe ser una matriz de bytes, pero para facilitar la memorización, lite wallet usa Brainwallet, para garantizar que la semilla esté compuesta de palabras y sea fácil de escribir o recordar. La aplicación toma los bytes UTF-8 de la cadena y los usa para crear claves y direcciones. Por ejemplo,

source: After reading this string as UTF-8 bytes and encoding them to Base58, the string will be coded as:
es: Después de leer esta cadena como bytes UTF-8 y codificarlos en Base58, la cadena se codificará como:

source: A seed string is involved with the creation of private keys. To create a private key using the official web wallet or the node, to :math:`4` bytes of int 'nonce' field (big-endian representation), which initially has a value of :math:`0` and increases every time you create the new address, should be prepended to seed bytes. Then we use this array of bytes to calculate hash keccak256(blake2b256(bytes)). This resulting array of bytes we call account seed, from it you can definitely generate one private and public key pair. Then this bytes hash passed in the method of creating a pair of public and private key of Curve25519 algorithm. DecentralChain uses Curve25519-ED25519 signature with X25519 keys (montgomery form), but most embedded cryptography devices and libraries don't support X25519 keys. There are libraries with conversion functions from:
es: Una cadena semilla está involucrada en la creación de claves privadas. Para crear una clave privada utilizando la billetera web oficial o el nodo, a :math:`4` bytes del campo int 'nonce' (representación big-endian), que inicialmente tiene un valor de :math:`0` y aumenta cada vez que crea la nueva dirección, debe anteponerse a los bytes iniciales. Luego usamos esta matriz de bytes para calcular hash keccak256 (blake2b256 (bytes)). Esta matriz resultante de bytes la llamamos semilla de cuenta, a partir de ella definitivamente puede generar un par de claves pública y privada. Luego, este hash de bytes pasó en el método de creación de un par de claves públicas y privadas del algoritmo Curve25519. DecentralChain usa la firma Curve25519-ED25519 con claves X25519 (forma de Montgomery), pero la mayoría de los dispositivos y bibliotecas de criptografía integrados no admiten claves X25519. Hay bibliotecas con funciones de conversión de:

source: ED25519 keys to X25519 (Curve25519) crypto_sign_ed25519_pk_to_curve25519(curve25519_pk, ed25519_pk) for public key.
es: Claves ED25519 para X25519 (Curve25519) crypto_sign_ed25519_pk_to_curve25519(curve25519_pk, ed25519_pk) para clave pública.

source: Crypto_sign_ed25519_sk_to_curve25519(curve25519_sk, ed25519_skpk) for private key.
es: Crypto_sign_ed25519_sk_to_curve25519(curve25519_sk, ed25519_skpk) para clave privada.

source: NOTE: Not all random :math:`32` bytes can be used as private keys (but any bytes of any size can be a seed). The signature scheme for the ED25519 introduces restrictions on the keys, so create the keys only through the methods of the Curve25519 libraries and be sure to make a test of the ability to sign data with a private key and then check it with a public key, however obvious this test might seem. There are valid Curve25519 realizations for different languages:
es: NOTA: No todos los :math:`32` bytes aleatorios se pueden usar como claves privadas (pero cualquier byte de cualquier tamaño puede ser una semilla). El esquema de firma para el ED25519 introduce restricciones en las claves, así que cree las claves solo a través de los métodos de las bibliotecas Curve25519 y asegúrese de hacer una prueba de la capacidad de firmar datos con una clave privada y luego verifíquelo con una clave pública. por obvia que parezca esta prueba. Hay realizaciones de Curve25519 válidas para diferentes idiomas:

source: Also some Curve25519 libraries (as the one used in our project) have the Sha256 hashing integrated, some not (such as most of c/c++/python libraries), so you may need to apply it manually. Note that the private key is clamped, so not any random :math:`32` bytes can be a valid private key.
es: Además, algunas bibliotecas Curve25519 (como la que se usa en nuestro proyecto) tienen el hash Sha256 integrado, otras no (como la mayoría de las bibliotecas c/c++/python), por lo que es posible que deba aplicarlo manualmente. Tenga en cuenta que la clave privada está sujeta, por lo que ningún :math:`32` byte aleatorio puede ser una clave privada válida.

source: Brainwallet seed string
es: Cadena de semillas Brainwallet

source: As UTF-8 bytes encoded
es: Como bytes UTF-8 codificados

source: Account seed bytes with nonce :math:`0` before apply hash function in Base58
es: Contabilice bytes iniciales con nonce :math:`0` antes de aplicar la función hash en Base58

source: blake2b256(account seed bytes)
es: blake2b256(bytes de semilla de cuenta)

source: Account seed ( keccak256(blake2b256(account seed bytes)))
es: Semilla de cuenta (keccak256(blake2b256(bytes de semilla de cuenta)))

source: Account seed after Sha256 hashing (optional, if your library does not do it yourself)
es: Semilla de cuenta después del hashing Sha256 (opcional, si su biblioteca no lo hace usted mismo)

source: Created private key
es: Clave privada creada

source: Created public key
es: Clave pública creada

source: Creating Address from a Public Key
es: Creación de una Dirección desde una Llave Privada

source: Our network address obtained from the public key depends on the byte chainID ('T' for Testnet, 'W' for Mainnet, 'S' for Stagenet), so different networks obtained a different address for a single seed (and hence public keys).
es: Nuestra dirección de red obtenida de la clave pública depende del byte chainID ('T' para Testnet, 'W' para Mainnet, 'S' para Stagenet), por lo que diferentes redes obtuvieron una dirección diferente para una sola semilla (y, por lo tanto, claves públicas) .

source: For the public key:
es: Para la clave pública:

source: Created public key:
es: Clave pública creada:

source: Signing
es: Firma

source: Curve25519 is used for all the signatures in the project. The process is as follows: create the special bytes for signing for transaction or block, then create a signature using these bytes and the private key bytes. For the validation of signatures it’s enough with signature bytes, signed object bytes and the public key. Do not forget that there are many valid (not unique!) signatures for a one array of bytes (block or transaction). Also you should not assume that the ID of the block or transaction is unique. The collision can occur one day! They have already taken place for some weak keys.
es: Curve25519 se utiliza para todas las firmas del proyecto. El proceso es el siguiente: cree los bytes especiales para firmar transacciones o bloques, luego cree una firma usando estos bytes y los bytes de la clave privada. Para la validación de firmas basta con bytes de firma, bytes de objeto firmado y la clave pública. No olvide que hay muchas firmas válidas (¡no únicas!) para una matriz de bytes (bloque o transacción). Además, no debe asumir que la ID del bloque o transacción es única. ¡La colisión puede ocurrir algún día! Ya han tenido lugar para algunas claves débiles.

source: Transaction Data:
es: Datos de la Transacción:

source: Transaction Data
es: Datos de la Transacción

source: Value
es: Valor

source: Sender address (not used, just for information)
es: Dirección del remitente (no utilizada, solo para información)

source: Private key (used for signing, not in tx data)
es: Clave privada (usada para firmar, no en datos tx)

source: Public key
es: Llave pública

source: Recipient address
es: Dirección del receptor

source: Asset id
es: ID del Activo

source: Fee
es: Tarifa

source: Fee asset id
es: ID de Activo de la Tarifa

source: Timestamp
es: Marca de Tiempo

source: Attachment (as byte array)
es: Adjunto (como matriz de bytes)

source: Type
es: Tipo

source: Position
es: Posición

source: Length
es: Longitud

source: Base58 bytes value
es: Valor de bytes base58

source: Transaction type (0x04)
es: Tipo de transacción (0x04)

source: Sender's public key
es: Clave pública del remitente

source: Amount's asset flag (0-DecentralCoins, 1-Asset)
es: Bandera de la cantidad de activos (0-DecentralCoins, 1-Activo)

source: Amount's asset ID (*if used)
es: ID de activo de la cantidad (*si se usa)

source: Fee's asset flag (0-DecentralCoins, 1-Asset)
es: Bandera de activo de la tarifa (0-DecentralCoins, 1-Activo)

source: Fee's asset ID (**if used)
es: ID de activo de la tarifa (**si se usa)

source: Recipient's address
es: Dirección del destinatario

source: Attachment's length (N)
es: Longitud del archivo adjunto (N)

source: Attachment's bytes
es: Bytes del archivo adjunto

source: Total data bytes for sign
es: Bytes de datos totales por signo

source: Signature of transaction data bytes (one of an infinite number of valid signatures)
es: Firma de bytes de datos de transacción (una de un número infinito de firmas válidas)

source: Total transaction bytes with signature:
es: Total de bytes de transacción con firma:

source: Calculating Transaction ID
es: Cálculo de ID de Transacción

source: Transaction ID is not stored in the transaction bytes and for most transactions (except Payment) it can be easily calculated from the special bytes for signing using blake2b256(bytes_for_signing). For payments, the transaction ID is just the signature of this transaction.
es: El ID de transacción no se almacena en los bytes de transacción y para la mayoría de las transacciones (excepto Pago) se puede calcular fácilmente a partir de los bytes especiales para firmar usando blake2b256(bytes_for_signing). Para los pagos, el ID de la transacción es solo la firma de esta transacción.

source: DecentralChain-M5 Solution
es: Solución DecentralChain-M5

source: Reasoning
es: Razonamiento

source: The maximum rate of transactions in blockchain systems is limited by the choice of two parameters: block size and block interval.
es: La tasa máxima de transacciones en los sistemas de cadena de bloques está limitada por la elección de dos parámetros: el tamaño del bloque y el intervalo del bloque.

source: The block interval defines the average amount of time that passes between the creation of two blocks. If we reduce this time, forks will appear more frequently, which will lead to either non-resolved forks or to decreased throughput since a considerable amount of time would be spent on resolving these forks. Larger blocks lead to huge network usage spikes during block propagation, which in turn will lead to throughput problems and huge forks.
es: El intervalo de bloque define la cantidad promedio de tiempo que pasa entre la creación de dos bloques. Si reducimos este tiempo, las bifurcaciones aparecerán con más frecuencia, lo que conducirá a bifurcaciones no resueltas o a una disminución del rendimiento, ya que se dedicaría una cantidad considerable de tiempo a resolver estas bifurcaciones. Los bloques más grandes conducen a grandes picos de uso de la red durante la propagación del bloque, lo que a su vez generará problemas de rendimiento y enormes bifurcaciones.

source: DecentralChain-M5 Solution With Technical Details
es: Solución DecentralChain-M5 con Detalles Técnicos
