Repository: Decentral-America/docs
Catalog: docs/locales/*/LC_MESSAGES/02_decentralchain.po
Languages: es

source: Amount of token to transfer: an integer value specified in the minimum fraction (“cents”) of token.
es: Cantidad de token a transferir: un valor entero especificado en la fracción mínima ("centavos") de token.

source: Arbitrary binary data (typically a comment to transfer) base58 encoded, up to :math:`4` bytes.
es: Datos binarios arbitrarios (normalmente un comentario para transferir) codificados en base58, hasta :math:`4` bytes.

source: Recipient address base58 encoded or recipient alias with alias:<chain_id>: prefix, for example alias:T:merry (See :ref:`chain ID <02_decentralchain/08_mainnet-testnet-stagenet:Chain ID>`).
es: Dirección del destinatario codificada en base58 o alias del destinatario con alias:<chain_id>: prefijo, por ejemplo, alias:T:merry (consulte :ref:`ID de cadena <02_decentralchain/08_mainnet-testnet-stagenet:Chain ID>`).

source: See the :ref:`transfer transaction binary format <02_decentralchain/10_binary-format:Transfer Transaction Binary Format>`.
es: Consulte el :ref:`formato binario de transacción para transferencia <02_decentralchain/10_binary-format:Transfer Transaction Binary Format>`.

source: Exchange Transaction
es: Transacción para Intercambio

source: Exchange transaction exchanges two different tokens between two accounts. Commonly the exchange transaction is created by the matcher service that executes orders to buy and sell tokens. The exchange transaction contains two counter orders: a buy order and a sell order. The blockchain guarantees that the terms of the exchange are not worse than those indicated in each order.
es: La transacción para intercambio intercambia dos tokens diferentes entre dos cuentas. Comúnmente, la transacción para intercambio es creada por el servicio emparejador que ejecuta órdenes para comprar y vender tokens. La transacción para intercambio contiene dos contraórdenes: una orden de compra y una orden de venta. La cadena de bloques garantiza que los términos del intercambio no sean peores que los indicados en cada pedido.

source: An order can be filled partially. An order can participate in several exchange transactions, with different counter orders. One of the two exchanged tokens is the amount asset (base currency): it represents the amount of token in orders and in the Exchange transaction. Another token is a price asset (quote currency): it represents the price.
es: Un pedido se puede completar parcialmente. Una orden puede participar en varias transacciones para intercambio, con diferentes contraórdenes. Uno de los dos tokens intercambiados es el activo de cantidad (moneda base): representa la cantidad de token en los pedidos y en la transacción para intercambio. Otro token es un activo de precio (moneda de cotización): representa el precio.

source: :strong:`Transaction Fee`
es: :strong:`Tarifa de Transacción`

source: The :ref:`minimum fee <02_decentralchain/03_transaction:Minimum Fee>` for an exchange transaction is :math:`0.003` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`. In case of exchange of a :ref:`smart asset <02_decentralchain/02_token(asset):Smart Asset>` for an ordinary asset the minimum fee is :math:`0.007` DecentralCoins, in case of exchange of two smart assets the minimum fee is :math:`0.011` DecentralCoins.
es: La :ref:`tarifa mínima <02_decentralchain/03_transaction:Minimum Fee>` en una transacción para intercambio es :math:`0.003` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`. En caso de intercambio de un :ref:`activo inteligente <02_decentralchain/02_token(asset):Smart Asset>` por un activo ordinario, la tarifa mínima es :math:`0.007` DecentralCoins, en caso de intercambio de dos activos inteligentes, el mínimo la tarifa es :math:`0.011` DecentralCoins.

source: :strong:`Matcher Fee`
es: :strong:`Tarifa del Emparejador`

source: The matcher receives a fee for order execution from each order sender. The minimum matcher fee is set by the matcher. The order sender specifies the fee not less than the minimum amount.
es: El emparejador recibe una tarifa por la ejecución de la orden de cada remitente de la orden. La tarifa mínima del emparejador la establece el emparejador. El remitente del pedido especifica la tarifa no menos que la cantidad mínima.

source: If the order is fully filled with one exchange transaction, the matcher receives the entire fee specified in the order. If the order is partially filled, the matcher receives a part of the fee. The blockchain guarantees that the total matcher fee received from the order sender in all exchange transactions does not exceed the fee specified in the order.
es: Si el pedido se llena por completo con una transacción para intercambio, el emparejador recibe la tarifa completa especificada en el pedido. Si el pedido se completa parcialmente, el emparejador recibe una parte de la tarifa. La cadena de bloques garantiza que la tarifa de emparejador total recibida del remitente de la orden en todas las transacciones de intercambio no exceda la tarifa especificada en la orden.

source: Exchange Transaction JSON Representation
es: Representación JSON de Transacción para Intercambio

source: Amount of the amount asset: an integer value specified in the minimum fraction (“cent”) of asset.
es: Monto de la cantidad activo: un valor entero especificado en la fracción mínima ("centavo") de activo.

source: Price for the amount asset nominated in the price asset, multiplied by the factor: 1) :math:`10^{8}` for the exchange transaction version 3. 2) :math:`10^{(8 + priceAssetDecimals – amountAssetDecimals)}`. Where amountAssetDecimals, priceAssetDecimals are decimals of the assets, for the exchange transaction version 2 or 1.
es: Precio por la cantidad del activo nominado en el precio del activo, multiplicado por el factor: 1) :math:`10^{8}` para la versión de transacción para intercambio 3. 2) :math:`10^{(8 + priceAssetDecimals – amountAssetDecimals )}`. Donde amountAssetDecimals, priceAssetDecimals son decimales de los activos, para la transacción para intercambio versión 2 o 1.

source: Matcher fee for the buy order execution. The fee token ID is indicated in buy order.
es: Tarifa del emparejador por la ejecución de la orden de compra. La identificación del token de tarifa se indica en la orden de compra.

source: Matcher fee for the sell order execution. The fee token ID is indicated in sell order.
es: Tarifa del emparejador por la ejecución de la orden de venta. El ID del token de tarifa se indica en la orden de venta.

source: Buy and sell orders. See the :ref:`order <02_decentralchain/06_order:Order>` article for details.
es: Ordenes de compra y venta. Consulte el artículo sobre :ref:`órdenes <02_decentralchain/06_order:Order>` para obtener más información.

source: See the :ref:`exchange transaction binary format <02_decentralchain/10_binary-format:Exchange Transaction Binary Format>`.
es: Consulte el :ref:`formato binario de transacción para intercambio <02_decentralchain/10_binary-format:Exchange Transaction Binary Format>`.

source: Create Alias Transaction
es: Transacción para Crear Alias

source: Create Alias transaction creates an :ref:`alias <02_decentralchain/01_account:Alias>` for the sender's address.A created alias cannot be deleted.
es: La transacción Create Alias crea un :ref:`alias <02_decentralchain/01_account:Alias>` para la dirección del remitente. Un alias creado no se puede eliminar.

source: The :ref:`minimum fee <02_decentralchain/03_transaction:Minimum Fee>` for a Create Alias transaction is :math:`0.001` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`.
es: La :ref:`tarifa mínima <02_decentralchain/03_transaction:Minimum Fee>` para una transacción de creación de alias es :math:`0.001` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`.

source: Create Alias Transaction JSON Representation
es: Representación JSON de Transacción para Crear Alias

source: Alias. From :math:`4` to :math:`30` bytes (:math:`1` character can take up to :math:`4` bytes).
es: Alias. Desde :math:`4` hasta :math:`30` bytes (el carácter :math:`1` puede ocupar hasta :math:`4` bytes).

source: See the :ref:`create alias transaction binary format <02_decentralchain/10_binary-format:Create Alias Transaction Binary Format>`.
es: Consulte el :ref:`formato binario de transacción para crear alias <02_decentralchain/10_binary-format:Create Alias Transaction Binary Format>`.

source: Mass Transfer Transaction
es: Transacción para Transferencia Masiva

source: Mass transfer transaction transfers a :ref:`token <02_decentralchain/02_token(asset):Token (Asset)>` to several accounts, from :math:`1` :ref:`DecentralCoin <02_decentralchain/02_token(asset):DecentralCoin>` to :math:`100` DecentralCoins .
es: La transacción para transferencia masiva transfiere un :ref:`token <02_decentralchain/02_token(asset):Token (Asset)>` a varias cuentas, desde :math:`1` :ref:`DecentralCoin <02_decentralchain/02_token(asset):DecentralCoin>` a :math:`100` DecentralCoins .

source: The :ref:`minimum fee <02_decentralchain/03_transaction:Minimum Fee>` for a Mass Transfer transaction is :math:`0.001 + 0.0005 × N` DecentralCoins, in case of transferring a :ref:`smart asset <02_decentralchain/02_token(asset):Smart Asset>` :math:`0.001 + 0.0005 × N` DecentralCoins, where :math:`N` DecentralCoins is the number of recipients. The fee value is rounded up to three decimals.
es: La :ref:`tarifa mínima <02_decentralchain/03_transaction:Minimum Fee>` en una transacción para transferencia masiva es :math:`0.001 + 0.0005 × N` DecentralCoins, en caso de transferir un :ref:`activo inteligente <02_decentralchain/02_token(asset):Smart Asset>` :math:`0.001 + 0.0005 × N` DecentralCoins, donde :math:`N` DecentralCoins es el número de destinatarios. El valor de la tarifa se redondea a tres decimales.

source: Mass Transfer Transaction JSON Representation
es: Representación JSON de Transacción para Transferencia Masiva

source: Arbitrary binary data (typically a comment to transfer) base58 encoded, up to :math:`140` bytes.
es: Datos binarios arbitrarios (normalmente un comentario para transferir) codificados en base58, hasta :math:`140` bytes.

source: Number of recipients.
es: Número de destinatarios.

source: Total amount of transfers in transaction.
es: Monto total de transferencias en la transacción.

source: The transferCount and totalAmount fields do not need to be filled when sending a transaction, and they are not stored on the blockchain. The node calculates these fields when providing transaction data via the REST API.
es: No es necesario completar los campos transferCount y totalAmount al enviar una transacción, y no se almacenan en la cadena de bloques. El nodo calcula estos campos cuando proporciona datos de transacciones a través de la API REST.

source: See the :ref:`mass transfer transaction binary format <02_decentralchain/10_binary-format:Mass Transfer Transaction Binary Format>`.
es: Consulte el :ref:`formato binario de transacción para transferencia masiva <02_decentralchain/10_binary-format:Mass Transfer Transaction Binary Format>`.

source: Data Transaction
es: Transacción para Datos

source: Data transaction adds, modifies and deletes data entries in sender's :ref:`account data storage <02_decentralchain/01_account:Account Data Storage>`. Limitations are as follows:
es: La transacción de datos agrega, modifica y elimina entradas de datos en el :ref:`almacenamiento de datos de la cuenta <02_decentralchain/01_account:Account Data Storage>` del remitente. Las limitaciones son las siguientes:

source: The maximum number of entries is :math:`100`.
es: El número máximo de entradas es :math:`100`.

source: For a transaction version 2 the maximum data size (keys + values) is :math:`165,890` bytes.
es: Para una transacción versión 2, el tamaño máximo de datos (claves + valores) es :math:`165,890` bytes.

source: For a transaction version 1 the maximum transaction size (except proofs) is :math:`153,600` bytes.
es: Para una transacción versión 1, el tamaño máximo de transacción (excepto las pruebas) es :math:`153,600` bytes.

source: The :ref:`minimum fee <02_decentralchain/03_transaction:Minimum Fee>` for a Data transaction is :math:`0.001` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` per kilobyte, the size is rounded up to an integer number of kilobytes.
es: La :ref:`tarifa mínima <02_decentralchain/03_transaction:Minimum Fee>` en una transacción para datos es :math:`0.001` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` por kilobyte, el tamaño se redondea hasta un número entero de kilobytes.

source: Data Transaction JSON Representation
es: Representación JSON de Transacción para Datos

source: Entry key. String, up to :math:`400` bytes for version 2, up to :math:`100` characters for version 1.
es: Clave de entrada. Cadena, hasta :math:`400` bytes para la versión 2, hasta :math:`100` caracteres para la versión 1.

source: Entry type: 1) binary. 2) boolean. 3) integer. 4) string. 5) null – delete entry.
es: Tipo de entrada: 1) binario. 2) booleano. 3) entero. 4) cadena. 5) nulo: eliminar entrada.

source: Entry value. Up to :math:`32,767` bytes. Binary value is base64 encoded. null – delete entry.
es: Valor de entrada. Hasta :math:`32,767` bytes. El valor binario está codificado en base64. nulo: eliminar entrada.

source: See the :ref:`data transaction binary format <02_decentralchain/10_binary-format:Data Transaction Binary Format>`.
es: Consulte el :ref:`formato binario de transacción para datos <02_decentralchain/10_binary-format:Data Transaction Binary Format>`.

source: The :ref:`DataTransaction structure <03_ride-language/07_dapp-to-app-invocation:Limitations>` is used for transaction handling in smart contracts.
es: La estructura :ref:`DataTransaction <03_ride-language/07_dapp-to-app-invocation:Limitations>` se usa para el manejo de transacciones en contratos inteligentes.

source: Set Script Transaction
es: Transacción para Asignar Scripts

source: Set script transaction assigns the dApp script :ref:`dApp script <03_ride-language/04_script-types:dApp Script>` or :ref:`account script <03_ride-language/04_script-types:Account Script>` to the sender's account.
es: La transacción para asignar scripts asigna el :ref:`script de dApp <03_ride-language/04_script-types:dApp Script>` o :ref:`script de cuenta <03_ride-language/04_script-types:Account Script>` a la cuenta del remitente .

source: The :ref:`minimum fee <02_decentralchain/03_transaction:Minimum Fee>` for a Set Script transaction is :math:`0.001` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`.
es: La :ref:`tarifa mínima <02_decentralchain/03_transaction:Minimum Fee>` en una transacción para asignar scripts es :math:`0.001` :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`.

source: Set Script Transaction JSON Representation
es: Representación JSON de Transacción para Asignar Scripts

source: Compiled script, base64 encoded. Account script up to :math:`8192` bytes, dApp script up to :math:`32,767` bytes. null – delete script.
es: Script compilado, codificado en base64. Script de cuenta hasta :math:`8192` bytes, script dApp hasta :math:`32,767` bytes. nulo: eliminar secuencia de comandos.

source: See the :ref:`set script transaction binary format <02_decentralchain/10_binary-format:Set Script Transaction Binary Format>`.
es: Consulte el :ref:`formato binario de transacción para asignar scripts <02_decentralchain/10_binary-format:Set Script Transaction Binary Format>`.

source: Invoke Script Transaction
es: Transacción para Invocar Scripts

source: Invoke script transaction invokes the :ref:`callable function <03_ride-language/03_functions:Callable Functions>` of the :ref:`dApp <02_decentralchain/01_account:dApp and Smart Account>`.
es: La transacción de script de invocación invoca la :ref:`función invocable <03_ride-language/03_functions:Callable Functions>` de la :ref:`dApp <02_decentralchain/01_account:dApp y Smart Account>`.

source: In addition to the dApp address, callable function name, and arguments, the Invoke Script transaction can contain payments to dApp. The maximum number of payments is 10.
es: Además de la dirección de la dApp, el nombre de la función invocable y los argumentos, la transacción Invoke Script puede contener pagos a la dApp. El número máximo de pagos es 10.

source: The sender can specify a transaction fee nominated in a sponsored asset instead of DecentralCoins, see the :ref:`sponsored fee <02_decentralchain/03_transaction:Sponsored Fees>` article.
es: El remitente puede especificar una tarifa de transacción nominada en un activo patrocinado en lugar de DecentralCoins, consulte el artículo :ref:`tarifa patrocinada <02_decentralchain/03_transaction:Sponsored Fees>`.

source: The :ref:`minimum fee <02_decentralchain/03_transaction:Minimum Fee>` in :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` for an invoke script transaction is Fee :math:`= 0.005 + S + 1 × I`.
es: La :ref:`tarifa mínima <02_decentralchain/03_transaction:Minimum Fee>` en :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` en una transacción para invocar scripts es Fee :math:`= 0.005 + S + 1 × I`.

source: If the transaction sender is a dApp or smart account, and that the complexity of the account script or dApp script verifier function exceeds the sender complexity threshold, then :math:`S = 0.004`, otherwise :math:`S = 0`.
es: Si el remitente de la transacción es una dApp o una cuenta inteligente, y la complejidad de la secuencia de comandos de la cuenta o la función de verificación de la secuencia de comandos de la dApp supera el umbral de complejidad del remitente, entonces :math:`S = 0.004`; de lo contrario, :math:`S = 0`.

source: :math:`I` is the number of issued assets that are not :ref:`NFT <02_decentralchain/02_token(asset):Non-Fungible Token>`.
es: :math:`I` es el número de activos emitidos que no son :ref:`NFT <02_decentralchain/02_token(asset):Non-Fungible Token>`.

source: :strong:`Total Complexity`
es: :strong:`Complejidad Total`

source: A dApp callable function can invoke a callable function of another dApp, or another callable function of the same dApp, or even itself. All invoked functions are executed within a single Invoke Script transaction. :ref:`More about dApp-to-dApp invocation <03_ride-language/07_dapp-to-app-invocation:dApp-to-App Invocation>`.
es: Una función invocable de dApp puede invocar una función invocable de otra dApp, u otra función invocable de la misma dApp, o incluso a sí misma. Todas las funciones invocadas se ejecutan dentro de una sola transacción Invoke Script. :ref:`Más sobre la invocación de dApp a dApp <03_ride-language/07_dapp-to-app-invocation:Invocación de dApp a App>`.

source: The total :ref:`complexity <03_ride-language/07_dapp-to-app-invocation:Script Complexity>` is limited by :math:`26,000` for all callable functions and asset scripts of involved smart assets in a single invoke script transaction. The sender's account script complexity is not included in that limit.
es: La :ref:`complexity <03_ride-language/07_dapp-to-app-incall:Script Complexity>` total está limitada por :math:`26,000` para todas las funciones invocables y scripts de activos de activos inteligentes involucrados en una sola transacción de script de invocación . La complejidad del script de la cuenta del remitente no está incluida en ese límite.

source: Invoke Script Transaction JSON Representation
es: Representación JSON de Transacción para Invocar Scripts

source: Callable function name. Up to :math:`255` bytes (:math:`1` character can take up to :math:`4` bytes).
es: Nombre de la función invocable. Hasta :math:`255` bytes (:math:`1` carácter puede ocupar hasta :math:`4` bytes).

source: Argument type: 1) binary. 2) boolean. 3) integer. 4) string. 5) list.
es: Tipo de argumento: 1) binario. 2) booleano. 3) entero. 4) cadena. 5) lista.

source: Argument value. 1) integer: from :math:`-9,223,372,036,854,775,808` to :math:`9,223,372,036,854,755,807` inclusive. 2) string or binary: up to :math:`32,767` bytes. Binary value should be base64 encoded. 3) list: up to :math:`1000` elements.
es: Valor del argumento. 1) entero: de :math:`-9,223,372,036,854,775,808` a :math:`9,223,372,036,854,755,807` inclusive. 2) cadena o binario: hasta :math:`32,767` bytes. El valor binario debe estar codificado en base64. 3) lista: hasta :math:`1000` elementos.

source: dApp address base58 encoded or dApp alias with alias:<chain_id>: prefix, for example alias:T:merry (See :ref:`Chain ID <02_decentralchain/08_mainnet-testnet-stagenet:Chain ID>`).
es: Dirección de dApp codificada en base58 o alias de dApp con alias:<chain_id>: prefijo, por ejemplo, alias:T:merry (Consulte :ref:`Chain ID <02_decentralchain/08_mainnet-testnet-stagenet:Chain ID>`).

source: Amount of token in payment: an integer value specified in atomic units.
es: Cantidad de token en pago: un valor entero especificado en unidades atómicas.

source: Script actions performed by the callable function and dApp-to-dApp invocation results.
es: Acciones de script realizadas por la función invocable y resultados de invocación de dApp a dApp.

source: The stateChanges structure does not need to be filled when sending a transaction, and it is not stored on the blockchain. The node returns this structure when providing transaction data via the REST API.
es: No es necesario completar la estructura stateChanges al enviar una transacción, y no se almacena en la cadena de bloques. El nodo devuelve esta estructura cuando proporciona datos de transacciones a través de la API REST.

source: See the :ref:`invoke script transaction binary format <02_decentralchain/10_binary-format:Invoke Script Transaction Binary Format>`.
es: Consulte el :ref:`formato binario de transacción para invocar scripts <02_decentralchain/10_binary-format:Invoke Script Transaction Binary Format>`.

source: Network
es: Red

source: Leases :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>`.
es: Crear un arrendamiento de :ref:`DecentralCoins <02_decentralchain/02_token(activo):DecentralCoin>`.

source: Cancels the leasing.
es: Cancela el arrendamiento.

source: Configures sponsorship.
es: Configura el patrocinio.

source: Lease Transaction
es: Transacción para Arrendamiento

source: Lease transaction leases :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` to another account. After :math:`1000` block the leased tokens are accounted for by the recipient's generating balance. The larger the generating balance of the node is, the higher the chances for that node to be selected to generate the next block. Commonly node owners share the reward for generated blocks with lessors. :ref:`More about leasing <02_decentralchain/05_node:Leased Proof of Stake>`.
es: La transacción para arrendamiento crea un arrendamiento de :ref:`DecentralCoins <02_decentralchain/02_token(asset):DecentralCoin>` a otra cuenta. Después del bloque :math:`1000`, los tokens alquilados se contabilizan según el saldo generador del destinatario. Cuanto mayor sea el saldo de generación del nodo, mayores serán las posibilidades de que ese nodo sea seleccionado para generar el siguiente bloque. Por lo general, los propietarios de los nodos comparten la recompensa por los bloques generados con los arrendadores. :ref:`Más información sobre el arrendamiento de <02_decentralchain/05_node:Leased Proof of Stake>`.
